{
    "data": {
      "videoses": [
        {
          "link": "nLF0n9SACd4",
          "views": 16101,
          "likes": null,
          "duration": 2005,
          "publishedAt": "2018-07-02T16:35:48+00:00",
          "description": "React 16 was released several months ago. Even though this update was largely API-compatible, the rewritten internal engine included new long-requested features and opened the door for exciting future possibilities.\n\nIn this talk, Dan will share the React team’s vision for what the future of React might look like, including some never before seen prototypes.\n\nWhether or not you use React, Dan hopes that you will find something valuable in this talk, and that it sparks new conversations about building delightful user interfaces.",
          "tags": [
            {
              "id": "cjhg0axyh13460195gookni3c",
              "name": "React"
            }
          ],
          "speaker": [
            {
              "id": "cjheuduv21a4c0157lwb8h0y2",
              "name": "Dan Abramov",
              "bio": "Working on @reactjs. Co-author of Redux and Create React App. Building tools for humans.",
              "topics": []
            }
          ]
        },
        {
          "link": "i2iCyulbnus",
          "views": 2026,
          "likes": null,
          "duration": 1623,
          "publishedAt": "2018-07-02T16:35:48+00:00",
          "description": "The life we live online increasingly informs the way we live offline as well. Businesses live and die through algorithms like SEO, humans are sorted in government systems, and we make large, life-governing decisions through what is shown to us on the web: home buying, where to live, what to eat, and who we're in contact with regularly. The first shift we as web developers saw was people living and learning on the web more and more, which excited us. But as we start to automate those tasks through machine learning algorithms, a lot of us have trepidation. We know systems have flaws, what are the political and social consequences?\n\nIn this talk we'll explore this paradigm shift and some of it's dangers, but we'll also talk about the good impacts technology can bring. Helping people who need it, automating tasks for humans with disabilities, communication for emergency services: the possibilities for positive influence are endless. We'll explore just some of the tools that are out there, how with a little creativity, we can use these technologies for good. We as developers have a voice and chance to make a difference.",
          "tags": [
            {
              "id": "cjhg0pta1179f0195fxd1owas",
              "name": "Machine Learning"
            },
            {
              "id": "cjhg0aa14127j0186n3g5jscc",
              "name": "Inspirational"
            }
          ],
          "speaker": [
            {
              "id": "cjheuebbh1c0h0171i0wie5x0",
              "name": "Sarah Drasner",
              "bio": "Sarah Drasner is an award-winning Speaker, Head of Developer Experience at Netlify, Vue core team member, and Staff Writer at CSS-Tricks. Sarah is formerly Principal Lead of Emerging Markets, Cloud Advocates at Microsoft and Manager of UX & Engineering at Trulia/Zillow Group. She’s the author of SVG Animations from O’Reilly and has given Frontend Masters workshops. Sarah is a co-organizer of ConcatenateConf, a free conference for Nigerian and Kenyan developers\n\n",
              "topics": []
            }
          ]
        },
        {
          "link": "FvPXMUuUCS4",
          "views": 1217,
          "likes": null,
          "duration": 1712,
          "publishedAt": "2018-07-02T16:35:48+00:00",
          "description": "It’s no secret that most people don’t read technical documentation for pleasure. Users often come to your docs when they are frustrated with your software, disappointed that they haven't been able to solve the problem on their own and generally feeling pretty low. This is a little sad, yeah, but being aware of these feelings is key for developers and technical writers. These emotions frame the reader’s perspective and therefore, should shape the mood of our docs. After all, when you've been stuck on a bug for hours, do you really want to read something saying 'but this is so easy'? In this talk, we’ll discuss how the language we use affects our users and the first steps towards writing accessible, approachable and use case-driven documentation.",
          "tags": [
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            },
            {
              "id": "cjhg0qgyv17140185a9g96djj",
              "name": "Documentation"
            }
          ],
          "speaker": [
            {
              "id": "cjheuf3wf19m90141yac8bsjp",
              "name": "Carolyn Stransky",
              "bio": "👩🏻‍💻🗞🖤💅🏼 Doing things: @berlinjs @blacklane @flurtmagazine @redischool 🐻💫 @onesiejs",
              "topics": []
            }
          ]
        },
        {
          "link": "A_3BfONFRUc",
          "views": 341,
          "likes": null,
          "duration": 1765,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "In 2017, Airbnb supported 27 languages and had developed robust translation tools that made it easy to add more. We launched Croatian in May with little overhead beyond setting up the new domain and translating phrases. However, this was not true for all new languages; our next most requested language, Hebrew, posed a unique challenge. Because it reads right-to-left, the entire Hebrew UI must be flipped. Browsers only handle reversing the DOM structure, but styling and interactions must be coded manually.\n\nThis talk covers the journey of enabling right-to-left languages on airbnb.com. Recently, Airbnb has moved to a React frontend and away from Sass to a CSS-in-JS paradigm. We developed a performant and cross-browser solution for RTL that leveraged a CSS-in-JS abstraction layer to isolate the logic from our codebase. Our efforts led us most of the way to launching in Arabic and Hebrew while requiring little effort from our product engineers and with minimal disruption to their work.",
          "tags": [
            {
              "id": "cjhg0axyh13460195gookni3c",
              "name": "React"
            },
            {
              "id": "cjhg0qv5417gi0162qms6qvl0",
              "name": "Accessibility"
            }
          ],
          "speaker": [
            {
              "id": "cjheufl7d1agi0194ysht3yff",
              "name": "Maja Wichrowska",
              "bio": "software engineer at @Airbnb - http://github.com/airbnb/react-dates … maintainer - spiritual leader of the church of brunch 🍊🍾🥂",
              "topics": []
            }
          ]
        },
        {
          "link": "kp-NOggyz54",
          "views": 10351,
          "likes": 224,
          "duration": 2236,
          "publishedAt": "2018-07-02T16:37:26+00:00",
          "description": "",
          "tags": [
            {
              "id": "cjhg0aa14127j0186n3g5jscc",
              "name": "Inspirational"
            },
            {
              "id": "cjhg0axyh13460195gookni3c",
              "name": "React"
            }
          ],
          "speaker": [
            {
              "id": "cjheud4hc19sz01784lntjnm3",
              "name": "Ryan Florence",
              "bio": "Founder http://Workshop.me  and http://TotalReact.com ",
              "topics": []
            }
          ]
        },
        {
          "link": "BcVAq3YFiuc",
          "views": 48542,
          "likes": 1114,
          "duration": 3067,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "Michael Jackson, creator of the React Router library, gives this talk where he says a component with a render prop or children prop as renderer can do anything an HoC (Higher Order Component) can do, and more. Presented at Phoenix ReactJS on September 6, 2017, at Galvanize in downtown Phoenix.",
          "tags": [
            {
              "id": "cjhg0axyh13460195gookni3c",
              "name": "React"
            }
          ],
          "speaker": [
            {
              "id": "cjhf0c4ja0ood0163swxsuf1o",
              "name": "Michael Jackson",
              "bio": "Working on @versa_hq, @ReactTraining, & @unpkg. Co-organizer of @shape_hq, member of @LDSchurch. Thriller.",
              "topics": []
            }
          ]
        },
        {
          "link": "srXzADSGR04",
          "views": 1089,
          "likes": 52,
          "duration": 2391,
          "publishedAt": "2018-07-02T16:35:48+00:00",
          "description": "\nAs engineers, we usually spend more time reading and understanding code than writing. While libraries and frameworks come and go, web applications tend to have a long life, so we struggle to balance our desire to stay current with the latest trends against long-term readability and maintenance of our code. Let's change that. Let's learn how to write code that will overcome all the latest trends, so you can go back to doing what you love: Building applications. In this talk, we'll cover the best practices in everything from application architecture to the latest developments in web development. Let's learn how to write code that is easy to read, easy to debug, and most importantly, easy to maintain.",
          "tags": [],
          "speaker": [
            {
              "id": "cjhf0gqoa0pqj0187yj22rcia",
              "name": "Jem Young",
              "bio": "Senior Software Engineer at @Netflix. Panelist on @FrontendHH. I smile at dogs (cats are great too).",
              "topics": []
            }
          ]
        },
        {
          "link": "qURPenhndYA",
          "views": 983,
          "likes": 43,
          "duration": 1593,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "CodeSandbox recently turned one year old, Ives tells all about what happened along the way and what he's learned from building CodeSandbox.",
          "tags": [
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            },
            {
              "id": "cjhg0aa14127j0186n3g5jscc",
              "name": "Inspirational"
            },
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            }
          ],
          "speaker": [
            {
              "id": "cjhf0j2tb0q9f0199bmd7q3ns",
              "name": "Ives van Hoorne",
              "bio": "Creator of https://codesandbox.io , software developer at @Catawiki and CompSci student at @utwenteEN. I like cookies 🍪",
              "topics": []
            }
          ]
        },
        {
          "link": "aOWIJ4Mgb2k",
          "views": 5478,
          "likes": 161,
          "duration": 1637,
          "publishedAt": "2018-07-02T16:35:49+00:00",
          "description": "React Native has come a long way since its announcement 3 years ago, but what if its future meant looking even further into its past?",
          "tags": [
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            },
            {
              "id": "cjhg0axyh13460195gookni3c",
              "name": "React"
            },
            {
              "id": "cjhg0nxwf164l0101czd5huq2",
              "name": "React Native"
            }
          ],
          "speaker": [
            {
              "id": "cjhf0oyjx0sja017373crdtnc",
              "name": "Vincent Riemer",
              "bio": "Software Developer at Symantec, creator of React Native DOM, http://io808.com , and amateur EDM producer/DJ.",
              "topics": []
            }
          ]
        },
        {
          "link": "PUPEptN5MtM",
          "views": 318,
          "likes": 11,
          "duration": 1179,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "",
          "tags": [
            {
              "id": "cjhg0aa14127j0186n3g5jscc",
              "name": "Inspirational"
            },
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            }
          ],
          "speaker": [
            {
              "id": "cjhf0u3190t5v0191yfvo5aa3",
              "name": "Max Stoiber",
              "bio": "Cofounder @withspectrum 💬Advisor @EducativeInc 👨🏼‍🏫 Makes styled-components, react-boilerplate and micro-analytics 💅 Coffee geek, skier, traveller ☕️ he/him",
              "topics": []
            }
          ]
        },
        {
          "link": "WYWVGQKnz5M",
          "views": 3329,
          "likes": 89,
          "duration": 1133,
          "publishedAt": "2018-07-02T16:35:48+00:00",
          "description": "",
          "tags": [
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            },
            {
              "id": "cjhg0aa14127j0186n3g5jscc",
              "name": "Inspirational"
            },
            {
              "id": "cjhg0e2ns13wl0101195y0r2o",
              "name": "Funny"
            }
          ],
          "speaker": [
            {
              "id": "cjhf0wrvz0tz20191qoru829b",
              "name": "Sunil Pai",
              "bio": "Entscheidungsproblem",
              "topics": []
            }
          ]
        },
        {
          "link": "x7cQ3mrcKaY",
          "views": 173545,
          "likes": 1521,
          "duration": 1772,
          "publishedAt": "2018-07-02T16:35:48+00:00",
          "description": "React, the new open-source JS library from Facebook and Instagram, is a different way to write JavaScript apps. When it was introduced at JSConf US in May, the audience was shocked by some of its design principles. One sarcastic tweet from an audience member ended up describing React's philosophy quite accurately: https://twitter.com/cowboy/status/339858717451362304\n\nAt Facebook and Instagram, we're trying to push the limits of what's possible on the web with React. My talk will start with a brief introduction to the framework, and then dive into three controversial topics: Throwing out the notion of templates and building views with JavaScript, \"re-rendering\" your entire application when your data changes, and a lightweight implementation of the DOM and events.",
          "tags": [
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            },
            {
              "id": "cjhg0axyh13460195gookni3c",
              "name": "React"
            }
          ],
          "speaker": [
            {
              "id": "cjhf0yifs0wa10157j6yozdtm",
              "name": "Pete Hunt",
              "bio": "Co-founder & CEO @HelloSmyte. Ex-FB and Instagram. Worked on React.js.",
              "topics": []
            }
          ]
        },
        {
          "link": "3J9EJrvqOiM",
          "views": 3786,
          "likes": 90,
          "duration": 1624,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "\"Reactive programming\" still sounds scary to many developers. As if it is an elevated way of thinking, only accessible to the chosen few. Nothing is less true! It is the most natural way to look at programming problems. You just might not realize it yet! In this talk, Michel will demonstrate that many complex UI problems, such as form validation and routing, can all be seen as '*actions* that change *facts* which leads to *reactions*'. And as soon as we start distinguishing those concepts in our applications; our code will become more declarative, more concise and less imperative.",
          "tags": [
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            }
          ],
          "speaker": [
            {
              "id": "cjhf07qv60ncq0177uo2ybsxz",
              "name": "Michel Weststrate",
              "bio": "OSS Evangelist & Tech Lead @Mendix. Husband & dad. Full stack dev. Creator of #MobX, mobx-state-tree, serializr, immer. Speaker. Christian.",
              "topics": []
            }
          ]
        },
        {
          "link": "QTp_sDjqkf4",
          "views": 241,
          "likes": 2,
          "duration": 2600,
          "publishedAt": "2018-07-02T16:35:48+00:00",
          "description": "We are in a consequential shift in design as it relates to human-computer interaction. Design, at its core, has never been primarily about creating objects; it is fundamentally about solving problems. Aesthetic and functional forms and patterns—be they visual, cognitive, or tangible—are the product of problem solving. One of the most formidable problems that we will face when designing user interfaces in the emerging paradigm of ubiquitous computing, is how to manage the limited bandwidth of user attention.\n\nThis talk will address the need to extrapolate new models and metaphors of interaction in order to manage the burgeoning volume of features and signals in the software that mediates so much of our lives. In this world, user interfaces must become more transparent and unobtrusive. This means that they will need to do more than simply present features and information, they will also need to be able to know when to hide these things from us as well. Interfaces will have to be designed to proactively think ahead of us, and anticipate what we need before we need it.",
          "tags": [
            {
              "id": "cjhg0bwrj13o30151u7hi4mhv",
              "name": "Design"
            },
            {
              "id": "cjhg0bs8813nc0151ukoy8q12",
              "name": "UX"
            }
          ],
          "speaker": [
            {
              "id": "cjhf2vo561glk0163a3oc4p5d",
              "name": "Petro Salema",
              "bio": "Helping teams get from version 0 to 1.0 • A ransomed soul ن",
              "topics": []
            }
          ]
        },
        {
          "link": "NgwQHGqIMbw",
          "views": 4044,
          "likes": 99,
          "duration": 1010,
          "publishedAt": "2018-07-02T16:35:48+00:00",
          "description": "Front-end architecture has evolved greatly since the era of jQuery's dominance. React popularized the Virtual DOM rendering model, Flux did the same with unidirectional data flow, and now The Elm Architecture is opening new frontiers like reliable time travel and managed effects.\n\nWhat benefits do we gain when transitioning from one architecture to another? What does it cost us? This talk explores the tradeoffs between old-school jQuery, modern-day Flux, and cutting-edge Elm Architecture in the browser.",
          "tags": [
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            },
            {
              "id": "cjhg0cf3q131c0162lhpxv7uw",
              "name": "Elm"
            }
          ],
          "speaker": [
            {
              "id": "cjhf2zi0j1fke0191z2sepaa1",
              "name": "Richard Feldman",
              "bio": "Let’s go with the ambitious approach.",
              "topics": []
            }
          ]
        },
        {
          "link": "-qPh6I2hfjw",
          "views": 7570,
          "likes": 158,
          "duration": 1910,
          "publishedAt": "2018-07-02T16:35:48+00:00",
          "description": "Our industry has a problem. We have a \"talent shortage,\" so we're loading the industry with new developers from various bootcamps, but they're having trouble finding jobs because many companies are unwilling to hire and train them. So these new developers are left to themselves to try and find ways to develop the skills they need to be \"marketable.\"",
          "tags": [
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            },
            {
              "id": "cjhg0aa14127j0186n3g5jscc",
              "name": "Inspirational"
            },
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            }
          ],
          "speaker": [
            {
              "id": "cjhf30i451i8i0163x4zdxo27",
              "name": "Kent C. Dodds",
              "bio": "Making software development more accessible · Husband, Father, Mormon, Teacher, OSS, GDE, @TC39 · @PayPalEng @eggheadio @FrontendMasters @Workshop_me · #JS",
              "topics": []
            }
          ]
        },
        {
          "link": "ZCuYPiUIONs",
          "views": 101936,
          "likes": 1347,
          "duration": 1908,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "",
          "tags": [
            {
              "id": "cjhg0axyh13460195gookni3c",
              "name": "React"
            }
          ],
          "speaker": [
            {
              "id": "cjhf33bqk1jvp0157579kupc3",
              "name": "Lin Clark",
              "bio": "stuffing my head with code and turning it into @codecartoons. also, tinkering with WebAssembly, @rustlang and a little JavaScript at @mozilla",
              "topics": []
            }
          ]
        },
        {
          "link": "-6BsiVyC1kM",
          "views": 67827,
          "likes": 890,
          "duration": 1904,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "In this keynote speech from JaxConf 2012, Rich Hickey, creator of Clojure and founder of Datomic gives an awesome analysis of the changing way we think about values (not the philosphoical kind) in light of the increasing complexity of information technology and the advent of Big Data. The broad subject of the talk makes it worth watching for almost anyone in the programming world, and was one of the highlights of the JaxConf lineup.",
          "tags": [
            {
              "id": "cjhg0cw2i12tq0152dwxweli5",
              "name": "Computer Science"
            }
          ],
          "speaker": [
            {
              "id": "cjhf5pojp29000191zr0seuku",
              "name": "Rich Hickey",
              "bio": "Creator of Clojure",
              "topics": []
            }
          ]
        },
        {
          "link": "GSnyVS79OR0",
          "views": 575,
          "likes": 9,
          "duration": 2050,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "Ever wonder what happens when you `npm install` something? Follow an odyssey across the wires as our hero client embarks on an adventure to bring you the software that you need, right when you ask for it. After this talk you'll have a better understanding of the course a package takes - helping you understand architecture that works at scale as well as being able to troubleshoot package installation problems.",
          "tags": [
            {
              "id": "cjhg094m612nx0185d3gnbqdk",
              "name": "NodeJS"
            },
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            }
          ],
          "speaker": [
            {
              "id": "cjhf3e51b1ms00157878cjq72",
              "name": "Jeffrey Lembeck",
              "bio": "Rap game Rick Moranis. ❤️ @rachlembeck. engineering manager @npmjs. @seattlejs co-organizer. Affable af. Forever longing for a hot tub boat to call home.",
              "topics": []
            }
          ]
        },
        {
          "link": "mVVNJKv9esE",
          "views": 31707,
          "likes": 763,
          "duration": 2132,
          "publishedAt": "2018-07-02T16:35:48+00:00",
          "description": "JavaScript and the React community have evolved over the years through all the ups and downs. This talk goes over the tools we've come to recognize, from Angular, Ember and Grunt, all the way go Gulp, Webpack, React and beyond, and captures all these in a unifying mental framework for reasoning in terms of abstraction levels, in an attempt to make sense of what is and might be happening.",
          "tags": [
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            }
          ],
          "speaker": [
            {
              "id": "cjhf5gwdx297p0157vky86omg",
              "name": "Cheng Lou",
              "bio": "I work on Reason and Facebook Messenger",
              "topics": []
            }
          ]
        },
        {
          "link": "8aGhZQkoFbQ",
          "views": 590777,
          "likes": 15135,
          "duration": 1613,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "JavaScript programmers like to use words like, “event-loop”, “non-blocking”, “callback”, “asynchronous”, “single-threaded” and “concurrency”.\n\nWe say things like “don’t block the event loop”, “make sure your code runs at 60 frames-per-second”, “well of course, it won’t work, that function is an asynchronous callback!”\n\nIf you’re anything like me, you nod and agree, as if it’s all obvious, even though you don’t actually know what the words mean; and yet, finding good explanations of how JavaScript actually works isn’t all that easy, so let’s learn!\n\nWith some handy visualisations, and fun hacks, let’s get an intuitive understanding of what happens when JavaScript runs.",
          "tags": [
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            }
          ],
          "speaker": [
            {
              "id": "cjhf5ju4i29ai0163g5fyvgh2",
              "name": "Philip Roberts",
              "bio": "Software Engineer @github",
              "topics": []
            }
          ]
        },
        {
          "link": "8pTEmbeENF4",
          "views": 145756,
          "likes": 3013,
          "duration": 1976,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "For his recent DBX Conference talk, Victor took attendees back to the year 1973, donning the uniform of an IBM systems engineer of the times, delivering his presentation on an overhead projector. The '60s and early '70s were a fertile time for CS ideas, reminds Victor, but even more importantly, it was a time of unfettered thinking, unconstrained by programming dogma, authority, and tradition. 'The most dangerous thought that you can have as a creative person is to think that you know what you're doing,' explains Victor. 'Because once you think you know what you're doing you stop looking around for other ways of doing things and you stop being able to see other ways of doing things. You become blind.' He concludes, 'I think you have to say: \"We don't know what programming is. We don't know what computing is. We don't even know what a computer is.\" And once you truly understand that, and once you truly believe that, then you're free, and you can think anything.'",
          "tags": [
            {
              "id": "cjhg0aa14127j0186n3g5jscc",
              "name": "Inspirational"
            },
            {
              "id": "cjhg0cw2i12tq0152dwxweli5",
              "name": "Computer Science"
            }
          ],
          "speaker": [
            {
              "id": "cjhf5n02g2awu0157y45jhozr",
              "name": "Bret Victor",
              "bio": "If you're not at the right place at the right time, you've got to make the right place and make it the right time. @Dynamicland1",
              "topics": []
            }
          ]
        },
        {
          "link": "34_L7t7fD_U",
          "views": 1441,
          "likes": 25,
          "duration": 3686,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "",
          "tags": [
            {
              "id": "cjhg0aa14127j0186n3g5jscc",
              "name": "Inspirational"
            },
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            }
          ],
          "speaker": [
            {
              "id": "cjhf5pojp29000191zr0seuku",
              "name": "Rich Hickey",
              "bio": "Creator of Clojure",
              "topics": []
            }
          ]
        },
        {
          "link": "f84n5oFoZBc",
          "views": 145450,
          "likes": null,
          "duration": 2389,
          "publishedAt": "2018-07-02T16:35:48+00:00",
          "description": "Rich Hickey's second, \"philosophical\" talk at the first Clojure Conj, in Durham, North Carolina on October 23rd, 2010. ",
          "tags": [
            {
              "id": "cjhg0aa14127j0186n3g5jscc",
              "name": "Inspirational"
            },
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            }
          ],
          "speaker": [
            {
              "id": "cjhf5pojp29000191zr0seuku",
              "name": "Rich Hickey",
              "bio": "Creator of Clojure",
              "topics": []
            }
          ]
        },
        {
          "link": "wOlcB-JxkFw",
          "views": 72838,
          "likes": 2284,
          "duration": 3174,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "When Antichamber was released at the beginning of 2013, it became an instant critical and financial success, but the journey to getting there was as much of a psychological challenge as the game itself. In this talk, Alexander Bruce looks back at the entire history of the game, as he went from working alone in a bedroom to flying around the world and landing on the IGF stage in 2012.",
          "tags": [
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            }
          ],
          "speaker": [
            {
              "id": "cjhf5uihw2cq20163mum3bzt8",
              "name": "Alexander Bruce",
              "bio": "Creator of the game Antichamber",
              "topics": []
            }
          ]
        },
        {
          "link": "xsSnOQynTHs",
          "views": 322052,
          "likes": 4208,
          "duration": 1841,
          "publishedAt": "2018-07-02T16:37:22+00:00",
          "description": "React’s unique strength is bringing to JavaScript development some of the benefits previously exclusive to more radically functional languages such as Elm and ClojureScript, without forcing you to completely eschew local state or rewrite code with exclusively immutable data structures. In this talk, Dan will demonstrate how React can be used together with Webpack Hot Module Replacement to create a live editing environment with time travel that supercharges your debugging experience and transforms the way you work on real apps every day.",
          "tags": [
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            },
            {
              "id": "cjhg0axyh13460195gookni3c",
              "name": "React"
            }
          ],
          "speaker": [
            {
              "id": "cjheuduv21a4c0157lwb8h0y2",
              "name": "Dan Abramov",
              "bio": "Working on @reactjs. Co-author of Redux and Create React App. Building tools for humans.",
              "topics": []
            }
          ]
        },
        {
          "link": "fU9hR3kiOK0",
          "views": 94183,
          "likes": 995,
          "duration": 2863,
          "publishedAt": "2018-07-02T16:35:48+00:00",
          "description": "",
          "tags": [
            {
              "id": "cjhg0cw2i12tq0152dwxweli5",
              "name": "Computer Science"
            }
          ],
          "speaker": [
            {
              "id": "cjhf86plk0ggc01693oiugkw4",
              "name": "Martin Kleppmann",
              "bio": "Author of @intensivedata, and working on @trvedata research project at @Cambridge_CL. Formerly @rapportive co-founder and @LinkedIn engineer.",
              "topics": []
            }
          ]
        },
        {
          "link": "PUv66718DII",
          "views": 152271,
          "likes": 2993,
          "duration": 3260,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "",
          "tags": [
            {
              "id": "cjhg0aa14127j0186n3g5jscc",
              "name": "Inspirational"
            }
          ],
          "speaker": [
            {
              "id": "cjhf5n02g2awu0157y45jhozr",
              "name": "Bret Victor",
              "bio": "If you're not at the right place at the right time, you've got to make the right place and make it the right time. @Dynamicland1",
              "topics": []
            }
          ]
        },
        {
          "link": "cCOL7MC4Pl0",
          "views": 35954,
          "likes": null,
          "duration": 2112,
          "publishedAt": "2018-07-02T16:35:48+00:00",
          "description": "Have you ever had a bug where things were happening in the wrong order, or particular style changes were being ignored? Ever fixed that bug by wrapping a section of code in a setTimeout? Ever found that fix to be unreliable, and played around with the timeout number until it kinda almost always worked? \nThis talk looks at the browser's event loop, the thing that orchestrates the main thread of the browser, which includes JavaScript, events, and rendering. We'll look at the difference between tasks, microtasks, requestAnimationFrame, requestIdleCallback, and where events land. \nHopefully you'll never have to use setTimeout hacks again!\"",
          "tags": [
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            }
          ],
          "speaker": [
            {
              "id": "cjhf8gq040jrh0192qtk74qpo",
              "name": "Jake Archibald",
              "bio": "Googler. I want the web to do what native does best, and fast. No thoughts go unpublished. 'IMO' implicit.",
              "topics": []
            }
          ]
        },
        {
          "link": "RGkIsUBfanQ",
          "views": null,
          "likes": null,
          "duration": 258,
          "publishedAt": "2018-06-07T10:14:00+00:00",
          "description": "Wat",
          "tags": [
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            },
            {
              "id": "cjhg0e2ns13wl0101195y0r2o",
              "name": "Funny"
            }
          ],
          "speaker": [
            {
              "id": "cjhhjkffw23ef0180dmmw74az",
              "name": "Gary Bernhardt",
              "bio": "Illuminating the dark corners of programming. Destroy All Software (dense programming screencasts); Deconstruct (independent software development conference).",
              "topics": []
            }
          ]
        },
        {
          "link": "4fFDFbi3toc",
          "views": 13497,
          "likes": 201,
          "duration": 2420,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "",
          "tags": [
            {
              "id": "cjhg0d5vw13cx0162h18nt4yv",
              "name": "Testing"
            },
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            },
            {
              "id": "cjhg0cw2i12tq0152dwxweli5",
              "name": "Computer Science"
            }
          ],
          "speaker": [
            {
              "id": "cjhf8p47y0mbo01045776r1ze",
              "name": "Will Wilson",
              "bio": "Math, religion, & distributed databases. I like chatting with cool strangers. Currently working on something new. Previous hits: Google, Apple, FoundationDB",
              "topics": []
            }
          ]
        },
        {
          "link": "Qg3XOfioapI",
          "views": 7569,
          "likes": null,
          "duration": 2526,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "Kolmogorov complexity analysis suggests that we can measure how well we understand a piece of music by the concision of a program that produces it. Furthermore, the inherent complexity of grooves and fugues can be compared via the lengths of their programmatic representations, and their relationship can be described as a program transformation. Algorithmic composition has curious implications for the creation, copyright and performance of pieces, both finite and infinite. Expect (finite) demonstrations.",
          "tags": [
            {
              "id": "cjhg0cw2i12tq0152dwxweli5",
              "name": "Computer Science"
            }
          ],
          "speaker": [
            {
              "id": "cjhf8sjbt0n3d017355y2l4hz",
              "name": "Christopher Ford",
              "bio": "Function Composer, Conway's Lawyer and Principal Consultant at @ThoughtWorks.",
              "topics": []
            }
          ]
        },
        {
          "link": "IcgmSRJHu_8",
          "views": 19333,
          "likes": 473,
          "duration": 1506,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "Among the most time-consuming bugs to track down are the ones where we look at our application state and say \"this shouldn’t be possible.\"\n\nWe can use Elm’s compiler to rule out many of these bugs in the first place—but only if we design our Models using the right techniques! This talk explores how.",
          "tags": [
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            },
            {
              "id": "cjhg0cf3q131c0162lhpxv7uw",
              "name": "Elm"
            }
          ],
          "speaker": [
            {
              "id": "cjhf2zi0j1fke0191z2sepaa1",
              "name": "Richard Feldman",
              "bio": "Let’s go with the ambitious approach.",
              "topics": []
            }
          ]
        },
        {
          "link": "IaIR9E--yZg",
          "views": 6553,
          "likes": 88,
          "duration": 1268,
          "publishedAt": "2018-07-02T16:35:48+00:00",
          "description": "Delight 2013 speaker Leah Buley of Intuit shares her experience and tactics as a user experience team of one.",
          "tags": [
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            },
            {
              "id": "cjhg0bs8813nc0151ukoy8q12",
              "name": "UX"
            },
            {
              "id": "cjhg0bwrj13o30151u7hi4mhv",
              "name": "Design"
            }
          ],
          "speaker": [
            {
              "id": "cjhf93jc10q4i0169o1zp5rye",
              "name": "Leah Buley",
              "bio": "Director of Design Education at InVision. Author of The User Experience Team of One.",
              "topics": []
            }
          ]
        },
        {
          "link": "RT46MpK39rQ",
          "views": 35095,
          "likes": 496,
          "duration": 3997,
          "publishedAt": "2018-07-02T16:35:48+00:00",
          "description": "In the 45+ years since Scott Meyers wrote his first program, he’s played many roles: programmer, user, educator, researcher, consultant. Different roles beget different perspectives on software development, and so many perspectives over so much time have led Scott to strong views about the things that really matter. In this presentation, he’ll share what he believes is especially important in software and software development, and he’ll try to convince you to embrace the same ideas he does.",
          "tags": [
            {
              "id": "cjhg0aa14127j0186n3g5jscc",
              "name": "Inspirational"
            },
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            }
          ],
          "speaker": [
            {
              "id": "cjhf97hpq0rlz0173pz4vbhv1",
              "name": "Scott Meyers",
              "bio": "Scott Meyers started programming in 1971, and he started teaching programming in 1972. He’s best known for his Effective C++ books, but he’s also worked on constraint expression for programming languages, program representations in development environments, software simulations of bacteriophage lambda, general principles for improving software quality, and the effective presentation of technical information. In 2009, he received the Dr. Dobb’s Excellence in Programming Award, and in 2014, an online poll likened his hair style to that of the cartoon character, He-Man.",
              "topics": []
            }
          ]
        },
        {
          "link": "G39lKaONAlA",
          "views": 33599,
          "likes": 832,
          "duration": 1728,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "People have mixed feelings about the JavaScript ecosystem. Are we living in the JavaScript fatigue or in the JavaScript Renaissance? Dan Abramov from the React team thinks it’s a bit of both. In this talk, he shares his thoughts on how we can make the tools more approachable and delightful for the next generation of JavaScript developers.",
          "tags": [
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            },
            {
              "id": "cjhg0axyh13460195gookni3c",
              "name": "React"
            }
          ],
          "speaker": [
            {
              "id": "cjheuduv21a4c0157lwb8h0y2",
              "name": "Dan Abramov",
              "bio": "Working on @reactjs. Co-author of Redux and Create React App. Building tools for humans.",
              "topics": []
            }
          ]
        },
        {
          "link": "lzXHMy4ewtM",
          "views": 9964,
          "likes": 222,
          "duration": 2377,
          "publishedAt": "2018-07-02T16:35:48+00:00",
          "description": "For an industry steeped in a mythos of innovation and invention, the path towards reliable software is often obstructed by a web of fixed ideas. Fixed ideas, by actively obscuring alternatives, lead us to inaccurately the weigh the risks and benefits associated with our choices whether they be of an engineering, managerial or business nature. Alan Kay famously quipped that a difference in perspective is worth 80 IQ points but in this talk we'll see that it's worth considerably more than that.",
          "tags": [
            {
              "id": "cjhg0aa14127j0186n3g5jscc",
              "name": "Inspirational"
            }
          ],
          "speaker": [
            {
              "id": "cjhf9boqo0stm0192dn7nxz4v",
              "name": "David Nolen",
              "bio": "musician, Cognitect, Lisp, JavaScript, Kitchen Table Coders, Baduk",
              "topics": []
            }
          ]
        },
        {
          "link": "USH4iPQ44LQ",
          "views": 866,
          "likes": 32,
          "duration": 2201,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "",
          "tags": [
            {
              "id": "cjhg09gx711vs01520uh3s6fp",
              "name": "Performance"
            },
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            }
          ],
          "speaker": [
            {
              "id": "cjhf9euh10tpl0120jkfs959w",
              "name": "Eli Fitch",
              "bio": "Animation/Perf/WebGL fella. Map design tools @mapbox 🌞 | 3D art n games 🌚. Started @CodePenDC. 💖 art, design, & old motorbikes, sometimes simultaneously",
              "topics": []
            }
          ]
        },
        {
          "link": "QGCWal_JWek",
          "views": 2085,
          "likes": 70,
          "duration": 1909,
          "publishedAt": "2018-07-02T16:35:48+00:00",
          "description": "You know minification, linting, testing, bundling, cache busting, transpiling and so on are important. But does your team do all this consistently? Likely not. That's why every team needs a starter kit. Let's discuss why it's so critical, and what belongs in the box.",
          "tags": [
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            },
            {
              "id": "cjhg094m612nx0185d3gnbqdk",
              "name": "NodeJS"
            }
          ],
          "speaker": [
            {
              "id": "cjhf9j0bo0ueo01040l8s8fg3",
              "name": "Cory House",
              "bio": "I help teams transition to React: http://reactjsconsulting.com . Author @pluralsight, Speaker, Software Architect, @microsoft MVP, @JSJabber panelist #JavaScript",
              "topics": []
            }
          ]
        },
        {
          "link": "099cHWSbAL8",
          "views": 619,
          "likes": 12,
          "duration": 2593,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "On July 19, 1989, United Airlines Flight 232 was en route to Chicago when a mechanical failure caused the plane to become all but uncontrollable. In this unsurvivable situation, the flight crew saved more than half of those onboard. How did they do it?\n\nFlight crews and software teams actually have a lot in common, and there’s much we can learn from how the best crews do their jobs. What can we learn from the story of United 232? While this talk won’t earn you your pilot’s license, you’ll definitely come away with some fresh ideas on how to make your team even more amazing.",
          "tags": [
            {
              "id": "cjhg0cw2i12tq0152dwxweli5",
              "name": "Computer Science"
            },
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            }
          ],
          "speaker": [
            {
              "id": "cjhg0sacn17fk0185g6i7kd0n",
              "name": "Nickolas Means",
              "bio": "Storyteller, empathetic leader, student of disasters, builder of distributed teams. Unabashed #avgeek. VP of Engineering at @MuveHealth.",
              "topics": []
            }
          ]
        },
        {
          "link": "pL3Yzjk5R4M",
          "views": 1495,
          "likes": 23,
          "duration": 3189,
          "publishedAt": "2018-07-02T16:35:48+00:00",
          "description": "Long before Agile and Lean became buzzwords, a scrappy group of aerospace engineers at Lockheed's Skunk Works were using similar practices to produce some of the most amazing aircraft ever built. The famous U-2 spy plane, the SR-71 Blackbird, and the F-117A Stealth Fighter are among the incredible planes the engineers at Skunk Works produced under impossibly tight deadlines and very limited budgets.\n\nWhat can we learn from the stories of these amazing planes and the engineers who built them? Let’s go back to our roots and let the original experts teach us about building awesome stuff together.",
          "tags": [
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            }
          ],
          "speaker": [
            {
              "id": "cjhg0sacn17fk0185g6i7kd0n",
              "name": "Nickolas Means",
              "bio": "Storyteller, empathetic leader, student of disasters, builder of distributed teams. Unabashed #avgeek. VP of Engineering at @MuveHealth.",
              "topics": []
            }
          ]
        },
        {
          "link": "vsl5O4ps7LE",
          "views": 7095,
          "likes": 148,
          "duration": 1127,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "",
          "tags": [
            {
              "id": "cjhg0xzhg190d0185dj2w0irs",
              "name": "Angular"
            }
          ],
          "speaker": [
            {
              "id": "cjhg0xp4v19c1019553rrq16b",
              "name": "Tero Parviainen",
              "bio": "Software developer and writer. Working at @CreativeDotAI. I mostly tweet about programming and music.",
              "topics": []
            }
          ]
        },
        {
          "link": "UHI0AzD_WfY",
          "views": 16485,
          "likes": 219,
          "duration": 5101,
          "publishedAt": "2018-07-02T16:35:48+00:00",
          "description": "Angular 2 embraces Observables and Reactive programming - learn what an Observable is, how Angular2 uses them, and how you can use them to make your apps amazing.",
          "tags": [
            {
              "id": "cjhg0xzhg190d0185dj2w0irs",
              "name": "Angular"
            }
          ],
          "speaker": [
            {
              "id": "cjhg0z59m19g00152hoeyezgg",
              "name": "Rob Wormald",
              "bio": "javascripter. googler. developer advocate for angular. texan.",
              "topics": []
            }
          ]
        },
        {
          "link": "-EX4X1SP2Ls",
          "views": 163,
          "likes": 3,
          "duration": 1341,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "",
          "tags": [
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            },
            {
              "id": "cjhg1b8nh1cls0152eqs0reeb",
              "name": "Personal"
            }
          ],
          "speaker": [
            {
              "id": "cjhg1b3z01ckh0162p8xfzw1l",
              "name": "Angelina Fabbro",
              "bio": "award-winning programmer & cogsci weirdo ✬ software, hardware, music ✬ 🏳️‍🌈 currently making music software as the dayjob thing",
              "topics": []
            }
          ]
        },
        {
          "link": "rP1q6oIVco4",
          "views": 9493,
          "likes": 230,
          "duration": 1498,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "The road to JavaScript expertise is hard, but easy to forget. Let’s go back to the beginning and work our way to the top, reminding ourselves of the struggle (but ultimate triumph!) of how we become the incredible developers we know we are. We’ll talk about individual journeys, shared experiences, and the community that has brought us all together.",
          "tags": [
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            },
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            }
          ],
          "speaker": [
            {
              "id": "cjhg1ciz21cua0101tajz8fu4",
              "name": "Raquel Vélez",
              "bio": "\npurveyor of flan ∙ platypus caretaker at @slackhq ∙ former wombat caretaker at @npmjs ∙ polyglot ∙ co-host of @reactivepod ∙ craft engineer",
              "topics": []
            }
          ]
        },
        {
          "link": "HxHBAU0cTHU",
          "views": 1726,
          "likes": null,
          "duration": 1712,
          "publishedAt": "2018-07-02T16:35:48+00:00",
          "description": "Javascript has always been a language with very little syntactic sugar—for better or worse. With ES6/2015, and future iterations,though, Javascript is gaining a more and more abstract and expressive syntax. To some it might appear that our language—which already seems accessible and approachable for beginners—is becoming even more accessible and approachable. However, both the humanities and CS education research have proven that abstraction, while a powerful tool for knowledgeable practitioners, can be an equally powerful foil for beginners.\n\nAs we enter the era of language-level abstractions in ES6/2015, we are charged with the task of rethinking how we teach JavaScript. Through an interdisciplinary montage I will identify the problem of teaching abstraction as a ubiquitous demand across nearly every domain, and align the issues of creativity and critical thinking in the humanities with issues in computer science.\n\nThe talk will conclude with a discussion of how the discipline of computer science and that of the humanities can inform each other to produce more effective and creative solutions to both developing and teaching abstractions.",
          "tags": [
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            }
          ],
          "speaker": [
            {
              "id": "cjhg1hisx1e960152b8nfx5iw",
              "name": "Ashley Williams",
              "bio": "a mess like this is easily five to ten years ahead of its time. @integer32llc @mozilla eng. @rustlang core. rustWASM WG. @nodejs director. former @npmjs.",
              "topics": []
            }
          ]
        },
        {
          "link": "wewAC5X_CZ8",
          "views": 42426,
          "likes": null,
          "duration": 1762,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "",
          "tags": [
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            }
          ],
          "speaker": [
            {
              "id": "cjhg1iyw21ed9018529r1jz2g",
              "name": "Jenn Schiffer",
              "bio": "hello fellow cool babes i am the community engineer on the @glitch team at @fogcreek 🎏👸 also i made http://make8bitart.com  & @jerseyscriptusa 👾🎨 she/her",
              "topics": []
            }
          ]
        },
        {
          "link": "BzeTjn0R2VY",
          "views": 60441,
          "likes": 2039,
          "duration": 1067,
          "publishedAt": "2018-07-02T16:35:48+00:00",
          "description": "We're all against hate, right? We agree it's a problem -- their problem, not our problem, that is. But as Sally Kohn discovered, we all hate -- some of us in subtle ways, others in obvious ones. As she confronts a hard story from her own life, she shares ideas on how we can recognize, challenge and heal from hatred in our institutions and in ourselves.",
          "tags": [
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            },
            {
              "id": "cjhg1m06y1fdk01015q4q7wi8",
              "name": "Society"
            }
          ],
          "speaker": [
            {
              "id": "cjhg1mqhf1efl0186zks8qb0d",
              "name": "Sally Kohn",
              "bio": "@CNN commentator. Activist. @TED talker. Traveler. Keynote speaker. Writer. Human.",
              "topics": []
            }
          ]
        },
        {
          "link": "Ks-_Mh1QhMc",
          "views": 14510057,
          "likes": 190141,
          "duration": 1263,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "Body language affects how others see us, but it may also change how we see ourselves. Social psychologist Amy Cuddy argues that \"power posing\" -- standing in a posture of confidence, even when we don't feel confident -- can boost feelings of confidence, and might have an impact on our chances for success. (Note: Some of the findings presented in this talk have been referenced in an ongoing debate among social scientists about robustness and reproducibility.",
          "tags": [
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            },
            {
              "id": "cjhg1b8nh1cls0152eqs0reeb",
              "name": "Personal"
            }
          ],
          "speaker": [
            {
              "id": "cjhg1o2641g500152hymwgt2a",
              "name": "Amy Cuddy",
              "bio": "Live life with my arms reached out. Eye to eye when speaking. Social psychologist. NYT bestselling author. Harvard Lecturer. Live-music lover & chaser.",
              "topics": []
            }
          ]
        },
        {
          "link": "-thLNvxFUu4",
          "views": 3647,
          "likes": 41,
          "duration": 1507,
          "publishedAt": "2018-07-02T16:35:48+00:00",
          "description": "This talk aims to take you on a journey – from the days of the Easter Islands around 700CE, over the mid-15th century in England to Mars and rain forests of our days and finally to the future of Free, Libre and Open Source Software (OSS). On our way, we’ll take a close look at the culture in Open Source Communities, its status, relevance and why this culture is the key to building the future of OSS. We’ll think about the core values of Open Source, amongst them freedom, democracy and decentralization, take a look at software-development as an act of representation and find out why diversity (regarding gender, skills, ethnicities and ideas / backgrounds) and user-centered approaches will be core determinants when we want to build a future for Open Source.\n\nThis talk aims to encourage everyone of us to broaden our horizons when it comes to how far we can go collectively with all our Open Source projects when we’re thinking about their future, - and it wants to show how widening our communities, aiming for diversity and sustainability will enable us to build this future together.",
          "tags": [
            {
              "id": "cjhg0aa14127j0186n3g5jscc",
              "name": "Inspirational"
            }
          ],
          "speaker": [
            {
              "id": "cjhg1sfkg1h1i0101i7sivfjh",
              "name": "Lena Reinhard",
              "bio": "Former VP Eng taking a break. Speaker, Writer, Photographer, Feminist, former & future CEO. she/her. “Canniest person in the whole world.”",
              "topics": []
            }
          ]
        },
        {
          "link": "oPofnLZZTwQ",
          "views": 1487,
          "likes": 25,
          "duration": 1634,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "In this talk I will be detailing how to create custom renderers using the new Fiber architecture, and showing examples exploring some fun things you can do with them.",
          "tags": [
            {
              "id": "cjhg0axyh13460195gookni3c",
              "name": "React"
            }
          ],
          "speaker": [
            {
              "id": "cjhg27phg1juj0186cm5aj5mh",
              "name": "Ken Wheeler",
              "bio": "Director of OSS @FormidableLabs • Google Developer Expert • Dad • @baconbrix's Dad • All opinions are the opinions of Miller Lite • @toddmotto fan",
              "topics": []
            }
          ]
        },
        {
          "link": "XrNdvWqxBvA",
          "views": 21849,
          "likes": 347,
          "duration": 3370,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "25 years ago I published \"Why Functional Programming Matters\", a manifesto for FP--but the subject is much older than that!\n\nAs software becomes more and more complex, it is more and more important to structure it well. Well-structured software is easy to write, easy to debug, and provides a collection of modules that can be re-used to reduce future programming costs. Conventional languages place conceptual limits on the way problems can be modularised. Functional languages push those limits back. In this paper we show that two features of functional languages in particular, higher-order functions and lazy evaluation, can contribute greatly to modularity. As examples, we manipulate lists and trees, program several numerical algorithms, and implement the alpha-beta heuristic (an algorithm from Artificial Intelligence used in game-playing programs). Since modularity is the key to successful programming, functional languages are vitally important to the real world.\n\nIn this talk we'll take a deep dive into history to revisit our personal selection of highlights.",
          "tags": [
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            },
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            }
          ],
          "speaker": [
            {
              "id": "cjhg2fo9u1nds0101g8mjh71q",
              "name": "John Hughes",
              "bio": "Professor at Chalmers, long-time functional programmer, founder of Quviq AB.",
              "topics": []
            }
          ]
        },
        {
          "link": "Xe1TZaElTAs",
          "views": 80627,
          "likes": 779,
          "duration": 554,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "Noted Internet thinker and author Clay Shirky delivered one of the opening \"provocations\" at Supernova 2007. Using a 1300-year-old Japanese shrine as a metaphor, Clay explained how the New Network changes the basic dynamics of business and collective creativity.",
          "tags": [
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            },
            {
              "id": "cjhg0aa14127j0186n3g5jscc",
              "name": "Inspirational"
            }
          ],
          "speaker": [
            {
              "id": "cjhg2inei1oee0152ubtxcy24",
              "name": "Clay Shirky",
              "bio": "Clay Shirky (born 1964) is an American writer, consultant and teacher on the social and economic effects of Internet technologies and journalism.",
              "topics": []
            }
          ]
        },
        {
          "link": "FihU5JxmnBg",
          "views": 12231,
          "likes": null,
          "duration": 2949,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "",
          "tags": [
            {
              "id": "cjhg0cw2i12tq0152dwxweli5",
              "name": "Computer Science"
            }
          ],
          "speaker": [
            {
              "id": "cjhg2ndgv1q1v0151pfou038x",
              "name": "Stuart Halloway",
              "bio": "\nhusband / father / runner / datomic / clojure",
              "topics": []
            }
          ]
        },
        {
          "link": "qIcM21l61TE",
          "views": 23041,
          "likes": 293,
          "duration": 2748,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "Designers have a responsibility, not only to themselves and to their clients, but also to the wider world: as designers, we create new things. That’s a huge responsibiliy that can be amazing, only if you wonder “what do I want to create, and not to create?”\n\nWe are designers because we love to create, but creation without responsibility breeds destruction. Every day, designers all over the world work on projects without giving any thought or consideration to the impact that work has on the world around them. This attitude leads to destruction, and this needs to change.\nTo illustrate its talk, Mike Monteiro use the exemple of broken lifes because of a change in Facebook Confidentiality Parameters. For Mike Monteiro, every designers should wonder what are the consequences of their job : “be more scared of your work’s consequences than you love the smartness of your own ideas”.",
          "tags": [
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            },
            {
              "id": "cjhg0bwrj13o30151u7hi4mhv",
              "name": "Design"
            }
          ],
          "speaker": [
            {
              "id": "cjhg2q60y1pqz0101ow8m477e",
              "name": "Mike Monteiro",
              "bio": "Editor of Dear Design Student, Mule Design Studio, and Maybe It’s Fiction",
              "topics": []
            }
          ]
        },
        {
          "link": "jVkLVRt6c1U",
          "views": 255421,
          "likes": 3902,
          "duration": 2320,
          "publishedAt": "2018-07-02T16:39:46+00:00",
          "description": "The most popular CreativeMornings talk of all time, Mike Monteiro gives us some valuable advice on how to get paid for the work that you do.",
          "tags": [
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            },
            {
              "id": "cjhg0e2ns13wl0101195y0r2o",
              "name": "Funny"
            }
          ],
          "speaker": [
            {
              "id": "cjhg2q60y1pqz0101ow8m477e",
              "name": "Mike Monteiro",
              "bio": "Editor of Dear Design Student, Mule Design Studio, and Maybe It’s Fiction",
              "topics": []
            }
          ]
        },
        {
          "link": "iCvmsMzlF7o",
          "views": 7988315,
          "likes": 88558,
          "duration": 1250,
          "publishedAt": "2018-07-02T16:37:21+00:00",
          "description": "Brené Brown studies human connection -- our ability to empathize, belong, love. In a poignant, funny talk at TEDxHouston, she shares a deep insight from her research, one that sent her on a personal quest to know herself as well as to understand humanity. A talk to share.",
          "tags": [
            {
              "id": "cjhg0aa14127j0186n3g5jscc",
              "name": "Inspirational"
            },
            {
              "id": "cjhg1m06y1fdk01015q4q7wi8",
              "name": "Society"
            },
            {
              "id": "cjhg1b8nh1cls0152eqs0reeb",
              "name": "Personal"
            }
          ],
          "speaker": [
            {
              "id": "cjhg2ttoy1rhz015188mq2wve",
              "name": "Brené Brown",
              "bio": "Dr. Brené Brown is a research professor at the University of Houston where she holds the Huffington Foundation – Brené Brown Endowed Chair at The Graduate College of Social Work.",
              "topics": []
            }
          ]
        },
        {
          "link": "wkfc0Mvg4QY",
          "views": 1293,
          "likes": 30,
          "duration": 2092,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "",
          "tags": [
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            },
            {
              "id": "cjhg0aa14127j0186n3g5jscc",
              "name": "Inspirational"
            },
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            }
          ],
          "speaker": [
            {
              "id": "cjhg2xt0m1s0u0101csv5zyej",
              "name": "Saron Yitbarek",
              "bio": "Developer. Podcaster. Ethiopian. Host #CommandLinePod @redhat Founder @CodeNewbies. IG: saronyitbarek",
              "topics": []
            },
            {
              "id": "cjhg2xymj1qz7018647ortl1r",
              "name": "Vaidehi Joshi",
              "bio": "writer, engineer @tildeio, east coast seedling repotted in the pnw🌻 creator of #basecs",
              "topics": []
            }
          ]
        },
        {
          "link": "cd8pyX-droM",
          "views": 214,
          "likes": 8,
          "duration": 1688,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "It’s 2018 and with the explosion of people joining the internet for the first time, building a performant application is more crucial than ever before. Unfortunately with all the new tools, libraries, and measurements, it’s difficult to even know where to start when it comes to building an application from scratch. In this talk, we’re going to cover the steps and methodologies that the modern web developer should keep in mind when crafting code. From choosing the right libraries and understanding application architecture, all the way to debugging common performance issues, we’re going to learn how to build a modern, production ready web application.",
          "tags": [
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            },
            {
              "id": "cjhg09gx711vs01520uh3s6fp",
              "name": "Performance"
            }
          ],
          "speaker": [
            {
              "id": "cjhf0gqoa0pqj0187yj22rcia",
              "name": "Jem Young",
              "bio": "Senior Software Engineer at @Netflix. Panelist on @FrontendHH. I smile at dogs (cats are great too).",
              "topics": []
            }
          ]
        },
        {
          "link": "fdol03pcvMA",
          "views": 2640,
          "likes": 159,
          "duration": 1875,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "JavaScript provides primitive types and means of processing those. However, those are not enough. Real data must somehow come into the program and data must somehow leave the program, for it to become useful to us. In this talk, we will see how two abstractions are essential for data flow and to build up other abstractions, such as Iterator, Iterable, Observable, Scheduling, and others.",
          "tags": [
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            }
          ],
          "speaker": [
            {
              "id": "cjhg8jn7q10ag0156icszobcv",
              "name": "André Staltz",
              "bio": "Open source hacker building a phone-to-phone social network with http://www.scuttlebutt.nz . Creator of @cyclejs and #RxJS teacher.",
              "topics": []
            }
          ]
        },
        {
          "link": "kZOJCVvyF-4",
          "views": 9927,
          "likes": null,
          "duration": 3165,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "You may have heard about CSS Variables (aka CSS Custom Properties), but think it’s not something you can use yet. Plus, you already have your preprocessor pipeline in place, why should you care? This talk will show how CSS Variables are much more powerful than static preprocessor variables and can be used today without compromising progressive enhancement. You will also learn several creative tips and tricks to take full advantage of them. As is customary with Lea’s CSS talks, expect a swath of live demos to demonstrate the material.",
          "tags": [
            {
              "id": "cjhg07w6912d10185umgied60",
              "name": "CSS"
            }
          ],
          "speaker": [
            {
              "id": "cjhg8m33u10ya0177p21rbta5",
              "name": "Lea Verou",
              "bio": "HCI researcher @MIT_CSAIL, @CSSWG IE, @CSSSecretsBook author, Ex @W3C staff. Made @mavoweb @prismjs @dabblet. I ♥ standards, code, design, UX, life!",
              "topics": []
            }
          ]
        },
        {
          "link": "IQfqONAkhUk",
          "views": 639,
          "likes": 11,
          "duration": 2001,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "You’ve been there: big bang redesigns are usually a very, very bad idea. Redesigning and rebuilding an existing website from scratch is risky and unpredictable, and in many cases the level of complexity is highly underrated and underestimated. In mid-2016, Smashing Magazine has decided to make a big switch from the existing WordPress setup to an entirely new design, entirely new architecture (JAM Stack) and an entirely new, GitHub-based, editorial workflow.\n\nIn this talk, Vitaly will share some of the insights into Smashing Magazine’s Relaunch in 2017 — with decisions made, failures, successes, lessons learned and shady’n'dirty techniques used along the way. Among other things, you’ll learn how Smashing Magazine uses HTTP/2, service workers and server-less architecture with static site generators to boost performance, with a dash of React, Flexbox, CSS and the peek into the new GitHub-based editorial workflow here and there. Beware: the session will contain at least 27 illustrations of cats!",
          "tags": [
            {
              "id": "cjhg07w6912d10185umgied60",
              "name": "CSS"
            },
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            },
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            }
          ],
          "speaker": [
            {
              "id": "cjhg8ni2j11b90177sstvrhw1",
              "name": "Vitaly Friedman",
              "bio": "Vitaly Friedman loves beautiful content and doesn’t like to give in easily. Vitaly is writer, speaker, author and editor-in-chief of Smashing Magazine. He runs responsive Web design workshops, webinars and loves solving complex UX, front-end and performance problems in large companies.",
              "topics": []
            }
          ]
        },
        {
          "link": "jGG6Wip_PGg",
          "views": 1788,
          "likes": 66,
          "duration": 3042,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "Stress and stress-induced depression hit many knowledge workers, and yet it is still a taboo. “I am stressed” has become something we hear every day, and it has almost become prestigious to say so; it shows that we are busy, important people. On the other hand, it is a bit embarrassing to be really stressed and not being able to handle it.\n\nThe sad thing is that when it comes to the people, who are really stressed, we don’t hear it. We do not see it; we do not talk about it.\n\nWe feel awkward when people are stressed or come back from sick leave. We try not to talk about it. It is so much easier with a broken leg; we can carry stuff for them, hold the door, get coffee etc., but what do we do with a person with stress?\n\nI have been sick with stress and it took nine months to come back. It was the second time and it had to hit me hard before I took it seriously.\n\nI believe strongly in taking openly about stress and depression. It is the only way we can learn from it; the way we can make it okay to say “I need help!”.\n\nIn this talk I will discuss the taboo and explore why it hits knowledge workers so often, as well as come with tips and trick to prevent it.",
          "tags": [
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            },
            {
              "id": "cjhg1b8nh1cls0152eqs0reeb",
              "name": "Personal"
            }
          ],
          "speaker": [
            {
              "id": "cjhg8qkuq12ob0144jykd11hb",
              "name": "Gitte Klitgaard",
              "bio": "Agile Coach, curious, believer in Altruistic Reciprocity, hippie, friend, hugger, learner & more :) Cis, she/hers/her",
              "topics": []
            }
          ]
        },
        {
          "link": "_ahvzDzKdB0",
          "views": 97376,
          "likes": 1601,
          "duration": 3211,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "Guy Steele's keynote at the 1998 ACM OOPSLA conference on \"Growing a Language\" discusses the importance of and issues associated with designing a programming language that can be grown by its users.",
          "tags": [
            {
              "id": "cjhg0cw2i12tq0152dwxweli5",
              "name": "Computer Science"
            }
          ],
          "speaker": [
            {
              "id": "cjhg8tx2y13dg0192ozypnibz",
              "name": "Guy Steele",
              "bio": "Guy Lewis Steele Jr. is an American computer scientist who has played an important role in designing and documenting several computer programming languages.",
              "topics": []
            }
          ]
        },
        {
          "link": "8bZh5LMaSmE",
          "views": 67827,
          "likes": 1366,
          "duration": 2327,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "Theory tells us to build applications out of small, interchangeable objects but reality often supplies the exact opposite. Many apps contain huge classes of long methods and hair-raising conditionals; they're hard to understand, difficult to reuse and costly to change. This talk takes an ugly section of conditional code and converts it into a few simple objects. It bridges the gap between OO theory and practice and teaches straightforward strategies that all can use to improve their code.",
          "tags": [
            {
              "id": "cjhg8vg73139s01166jgjmg25",
              "name": "Ruby"
            }
          ],
          "speaker": [
            {
              "id": "cjhg8vkfa142e0144zifzc37k",
              "name": "Sandi Metz",
              "bio": "Cyclist, Rubyist, author (http://99bottlesofoop.com  and http://poodr.com ), obsessive programmer, recalcitrant blogger and the antidote for ambition.",
              "topics": []
            }
          ]
        },
        {
          "link": "ztspvPYybIY",
          "views": 148726,
          "likes": 2144,
          "duration": 2912,
          "publishedAt": "2018-07-02T16:37:21+00:00",
          "description": "",
          "tags": [
            {
              "id": "cjhg094m612nx0185d3gnbqdk",
              "name": "NodeJS"
            }
          ],
          "speaker": [
            {
              "id": "cjhg8xd6k14fm0192r9qa91gz",
              "name": "Ryan Dahl",
              "bio": "Ryan Dahl is a software engineer and inventor of Node.js",
              "topics": []
            }
          ]
        },
        {
          "link": "t0dUvs3jQnw",
          "views": 1576,
          "likes": 31,
          "duration": 3232,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "Web browsers have become so powerful that developers are now treating them as if they were a runtime environment as predictable as any other. But the truth is that we still need to deal with many unknown factors that torpedo our assumptions. The web is where Postel’s Law meets Murphy’s Law, so we can’t treat web development as if it were just another flavor of software. Instead we must work with the grain of the web. You’ll learn tried and tested (as well as new) approaches to building for the web that will result in experiences that are robust, flexible, and resilient.",
          "tags": [
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            },
            {
              "id": "cjhg09gx711vs01520uh3s6fp",
              "name": "Performance"
            }
          ],
          "speaker": [
            {
              "id": "cjhg9khtk1ak30116xdjbsl9m",
              "name": "Jeremy Keith",
              "bio": "An Irish web developer working with @Clearleft, playing music with @SalterCane, creator of @Huffduffer & @SessionUpdates. https://resilientwebdesign.com ",
              "topics": []
            }
          ]
        },
        {
          "link": "OMPfEXIlTVE",
          "views": 29008,
          "likes": 781,
          "duration": 2153,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "Our code is full of hidden assumptions, things that seem like nothing, secrets that we did not name and thus cannot see. These secrets represent missing concepts and this talk shows you how to expose those concepts with code that is easy to understand, change and extend. Being explicit about hidden ideas makes your code simpler, your apps clearer and your life better. Even very small ideas matter. Everything, even nothing, is something.",
          "tags": [
            {
              "id": "cjhg0cw2i12tq0152dwxweli5",
              "name": "Computer Science"
            },
            {
              "id": "cjhg8vg73139s01166jgjmg25",
              "name": "Ruby"
            }
          ],
          "speaker": [
            {
              "id": "cjhg8vkfa142e0144zifzc37k",
              "name": "Sandi Metz",
              "bio": "Cyclist, Rubyist, author (http://99bottlesofoop.com  and http://poodr.com ), obsessive programmer, recalcitrant blogger and the antidote for ambition.",
              "topics": []
            }
          ]
        },
        {
          "link": "SctS56YQ6fg",
          "views": 107,
          "likes": 2,
          "duration": 2925,
          "publishedAt": "2018-07-02T16:35:48+00:00",
          "description": "Developers can get better at their craft by learning from the great writers who mastered theirs. Writing software isn’t the same as writing a novel, but there are parallels. Besides, advice from writers is better because writers have been struggling with their craft for many centuries, not just a few decades. It’s better-written as well. This talk shares great writers’ best advice for coders: Stephen King on refactoring, Anne Rice on development hardware, Hemingway on modelling with personas, and Neil Gaiman on everything. This session first explores the similarities between writing and coding, and uses writers’ advice to identify different kinds of avoidable bad naming in code. Some class, method, and variable names are so bad that they’re funny, but you’ve still seen them in production code. The second part of the session explores practical techniques for working on better naming, including renaming things. Renaming is even harder because it includes naming things plus other hard things. The final section goes back to writing. The next step after finding better names in code is to write better comments in code, which is almost as hard as naming is. The surprising thing about naming things well in code is not that it’s hard, but how easy it is to accept bad names. This is a hard problem that’s worth working on, because although you can’t make the naming problem go away, you can learn to write much better code regardless of which technologies you use.",
          "tags": [
            {
              "id": "cjhg0cw2i12tq0152dwxweli5",
              "name": "Computer Science"
            }
          ],
          "speaker": [
            {
              "id": "cjhgdiso6005701900u3v0qyy",
              "name": "Peter Hilton",
              "bio": "Software developer, speaker, writer, and musician • Consults at http://signavio.com  • Volunteers at http://joyofcoding.org  • ‘Play for Scala’ book author - http://bit.ly/playscala2p ",
              "topics": []
            }
          ]
        },
        {
          "link": "e-5obm1G_FY",
          "views": 760813,
          "likes": 12789,
          "duration": 1797,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "",
          "tags": [
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            }
          ],
          "speaker": [
            {
              "id": "cjhgdjrmh00li01905s2xuq1c",
              "name": "Anjana Vakil",
              "bio": "Wanderer and wonderer. Engineering + Learning at @Mapbox. @Mozilla TechSpeaker. Alumna of @Outreachy, @RecurseCenter, @Uni_Saarland, & @UCBerkeley.",
              "topics": []
            }
          ]
        },
        {
          "link": "YnWhqhNdYyk",
          "views": 79861,
          "likes": 1096,
          "duration": 3612,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "To this day most people who set out to help others learn C++ start with \"introduction to C\" material. I think this actively contributes to bad C++ code in the world. For the past few years I've been teaching C++ (and making suggestions to folks who intend to teach themselves) in an entirely different way. No char* strings, no strlen, strcmp, strcpy, no printf, and no [] arrays. Pointers introduced very late. References before pointers, and polymorphism with references rather than with pointers. Smart pointers as the default pointer with raw pointers (whether from new or &) reserved for times they're needed. Drawing on the Standard Library sooner rather than later, and writing modern C++ from lesson 1.\n\nIn this session I want to talk about the specific advantages of teaching C++ this way – a way that’s very different from the way you almost certainly learned the language. You’ll be pleasantly surprised to see what you get to leave for later or never cover at all, what bad habits you don't later need to correct, what complicated concepts actually become accessible to beginners, and how you spend a lot less time dictating magic spells you can't explain yet, and more showing someone a comprehensive, sensible, and understandable language.\n\nYou don't have to be a trainer to come to this session. If you ever mentor other developers and show them your C++ code, if you ever help somebody choose a book or a course or other material to learn from, or even if you occasionally feel bad that you work in a language that's hard to learn, come and see how one philosophical shift can turn that very same language into one that's actually pretty easy to learn!",
          "tags": [
            {
              "id": "cjhg0cw2i12tq0152dwxweli5",
              "name": "Computer Science"
            }
          ],
          "speaker": [
            {
              "id": "cjhgdl6u1014p0171jx19004x",
              "name": "Kate Gregory",
              "bio": "I advise, develop, mentor, write, and speak. C++ mostly. Limited availability but you can always ask. Conferences: No Code of Conduct, No Kate.",
              "topics": []
            }
          ]
        },
        {
          "link": "VDfX44fZoMc",
          "views": 11567,
          "likes": 187,
          "duration": 3876,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "Integrated tests are a scam. You’re probably writing 2-5% of the integrated tests you need to test thoroughly. You’re probably duplicating unit tests all over the place. Your integrated tests probably duplicate each other all over the place. When an integrated test fails, who knows what’s broken? Integrated tests probably do you more harm than good. Learn the two-pronged attack that solves the problem: collaboration tests and contract tests.",
          "tags": [
            {
              "id": "cjhg0d5vw13cx0162h18nt4yv",
              "name": "Testing"
            }
          ],
          "speaker": [
            {
              "id": "cjhgjkir11zmi0149swnoof7u",
              "name": "J B Rainsberger",
              "bio": "Swede stuck in a Canadian's body. Barista. 5-pin Bowler. Adviser to software companies. Irreligious Agilist. Friend. http://testdrivendevelopment.training ",
              "topics": []
            }
          ]
        },
        {
          "link": "YyhfK-aBo-Y",
          "views": 13422,
          "likes": 268,
          "duration": 3026,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "What is risk? Many people aren't sure, but it's not just uncertainty: risk is exposure to uncertainty.\n\nInstead of just plastering over the cracks, security should also involve reducing the size and number of cracks, reducing the opportunities for cracks to appear, reducing the class of errors and oversights that can open a system to failure instigated from the outside. We can learn a lot from other kinds of software failure, because every failure unrelated to security can be easily reframed as a security-failure opportunity.\n\nThis is not a talk about access control models, authentication, encryption standards, firewalls, etc. This is a talk about reducing risk that lives in the code and the assumptions of architecture, reducing the risk in development practices and in the blind spot of development practices.",
          "tags": [
            {
              "id": "cjhgjmcbi20ds0149hootybxs",
              "name": "Security"
            }
          ],
          "speaker": [
            {
              "id": "cjhgjmtjn22pp0171lokyj2dw",
              "name": "Kevlin Henney ",
              "bio": "consultant · father · husband · itinerant · programmer · speaker · trainer · writer",
              "topics": []
            }
          ]
        },
        {
          "link": "0tasZ2hSqYI",
          "views": 4496,
          "likes": 16,
          "duration": 3453,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "",
          "tags": [
            {
              "id": "cjhgjq7xl22sc0105imdicvtz",
              "name": "Agile"
            }
          ],
          "speaker": [
            {
              "id": "cjhgjoasd235h01900l7rnqo9",
              "name": "Lisa Crispin",
              "bio": "Agile Tester and Donkey Fan, co-author of _Agile Testing_ and _More Agile Testing. Pronouns: she/her",
              "topics": []
            }
          ]
        },
        {
          "link": "ladXdJ3KKd4",
          "views": 2152,
          "likes": 53,
          "duration": 1618,
          "publishedAt": "2018-07-02T16:35:46+00:00",
          "description": "",
          "tags": [
            {
              "id": "cjhg0axyh13460195gookni3c",
              "name": "React"
            },
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            }
          ],
          "speaker": [
            {
              "id": "cjhgjrarz247r0190ws2l5az0",
              "name": "Shirley Wu",
              "bio": "¾ code ⌨️ ¼ art 🎨; @datasketches @googledevexpert @d3bayarea 💕; live-code → http://twitch.tv/sxywu  & freelance → http://sxywu.com  ✨",
              "topics": []
            }
          ]
        },
        {
          "link": "XDqZemwVXUk",
          "views": 1651,
          "likes": 34,
          "duration": 1203,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "The \"if else\" logic is not entirely intuitive for our minds. We'll explore some alternatives that would lead to the same results but without using the more traditional logic sintax most of us are used to. We'll also see how we can benefit from reducing the complexity of our code in favour of readability, making it say what we really mean instead of having to translate all of our thoughts into a series of \"if else\" statements.",
          "tags": [
            {
              "id": "cjhg0901y12770162f0lf32t4",
              "name": "Javascript"
            }
          ],
          "speaker": [
            {
              "id": "cjhgk1l6b292f0131klrjemzf",
              "name": "Nikolay Bachiyski",
              "bio": "Meta Engineer at @automattic, programming, abstraction, asking why, travel; the silliest of the rationals and the most rational of the sillies",
              "topics": []
            }
          ]
        },
        {
          "link": "4Sso4HtvJsw",
          "views": 14093,
          "likes": null,
          "duration": 3164,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "We all have moments that change the way we think, the way that we look at the world, the things we want to do with our lives. On July 20, 1969 a whole generation of Americans had one of those transforming experiences: Two men landed on the Moon and nothing was ever the same again. Why did we go to the Moon? How did we get there? What was it like to witness it all? And what does any of this have to do with writing software 40 years later? In this talk, Russ Olsen will take you back to a humid Sunday afternoon that changed his life. It might yet change yours.\n\nRuss likes to think that the technology is there to solve problems for people, not the other way around.\n\nRuss started his career doing that other kind of engineering, the sort that involves electricity, gears and getting dirty. Pretty rapidly the wonder of computer programming lured Russ away, which probably explains why most of his fingers are still intact today.\n\nSince turning to coding, Russ has worked on everything from 3D design and image processing software to database query engines and workflow systems. Russ first discovered Ruby back in 2000 when he went looking for a simple programming language to teach to his son. The seven year old lost interest, but Russ never did and he has been building increasingly sophisticated systems in Ruby ever since.",
          "tags": [
            {
              "id": "cjhhjhtmm22060198td08oxah",
              "name": "Clojure"
            }
          ],
          "speaker": [
            {
              "id": "cjhhjhe7g23670191u8rl9ier",
              "name": "Russ Olsen",
              "bio": "Vice President at Cognitect, Writer, Author of Getting Clojure & Eloquent Ruby. Storyteller.",
              "topics": []
            }
          ]
        },
        {
          "link": "0SARbwvhupQ",
          "views": 920189,
          "likes": 7217,
          "duration": 3317,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "A pervasive elitism hovers in the background of collaborative software development:  everyone secretly wants to be seen as a genius.  In this talk, we discuss how to avoid this trap and gracefully exchange personal ego for personal growth and super-charged collaboration.  We'll also examine how software tools affect social behaviors, and how to successfully manage the growth of new ideas.",
          "tags": [
            {
              "id": "cjhg1b8nh1cls0152eqs0reeb",
              "name": "Personal"
            },
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            }
          ],
          "speaker": [
            {
              "id": "cjhhjjcx323l20145iiw63pzf",
              "name": "Brian Fitzpatrick",
              "bio": "Founder & CTO: Tock, Inc. https://www.exploretock.com/ , Xoogler, Ex-Apple, Author, Co-founder of ORD Camp. ✶✶✶✶ Chicagophile ✶✶✶✶ 'No Formal Authority' - HBR",
              "topics": []
            }
          ]
        },
        {
          "link": "WmVH85G59Lk",
          "views": 12331,
          "likes": null,
          "duration": 2014,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "Let’s live code a game together using just CSS and HTML! This talk will demonstrate the power of CSS and will teach a few fun tips as tricks as we build a simple game. It’ll be based in Sass — using data structures like matrices and HTML counter-incrementing, and a little bit of web magic to tie it all together. This talk will inspire you to play with and create your own CSS games, pushing the boundaries of what’s expected from the language itself.",
          "tags": [
            {
              "id": "cjhg07w6912d10185umgied60",
              "name": "CSS"
            }
          ],
          "speaker": [
            {
              "id": "cjhhjewd721q10180zc5wiwd8",
              "name": "Una Kravets",
              "bio": "Director of Product Design @bustle, Google Dev Expert, & cohost @toolsday. Prev UI Eng @digitalocean @ibmdesign. Travel life: http://Instagram.com/unakravets ",
              "topics": []
            }
          ]
        },
        {
          "link": "yTkzNHF6rMs",
          "views": 26353,
          "likes": 265,
          "duration": 2755,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "Some people test in isolation, mocking everything except the class under test. We'll start with that idea, quickly examine the drawbacks, and ask how we might fix them without losing the benefits. This will send us on a trip through behavior vs. data, mutation vs. immutability, interface vs. data dependencies, how data shape affords parallelism, and what a system optimizing each of these for natural isolation might look like.",
          "tags": [
            {
              "id": "cjhg8vg73139s01166jgjmg25",
              "name": "Ruby"
            }
          ],
          "speaker": [
            {
              "id": "cjhhjkffw23ef0180dmmw74az",
              "name": "Gary Bernhardt",
              "bio": "Illuminating the dark corners of programming. Destroy All Software (dense programming screencasts); Deconstruct (independent software development conference).",
              "topics": []
            }
          ]
        },
        {
          "link": "g9Pbd3EyMp8",
          "views": 490,
          "likes": 8,
          "duration": 2351,
          "publishedAt": "2018-07-02T16:35:48+00:00",
          "description": "At Rocket Conference 2016, we invited Robin Christopherson from AbilityNet to talk about why accessibility is important on the web, and how helping people with disabilities will improve the user experience for all of your visitors.",
          "tags": [
            {
              "id": "cjhg0bwrj13o30151u7hi4mhv",
              "name": "Design"
            },
            {
              "id": "cjhg0qv5417gi0162qms6qvl0",
              "name": "Accessibility"
            }
          ],
          "speaker": [
            {
              "id": "cjhhsk7xj2hkh0163l21ewu2q",
              "name": "Robin Christopherson",
              "bio": "Head of Digital Inclusion at AbilityNet. Accessibility/usability, public speaker, podcaster and all-round fan of tech. Blind and married Father of two.",
              "topics": []
            }
          ]
        },
        {
          "link": "hgqqPaVEZpk",
          "views": 413,
          "likes": 8,
          "duration": 2210,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "Let’s face it: the term REST is treated as a buzzword these days rather than as an accurate description of the Web’s blueprints. Everybody claim to do REST APIs; the truth is - nobody is doing REST API. It’s time to stop this. In my presentation I’d like to go with you through the original specifications and build an API that will respect all the constraints. All live, no prepared things. Then, we will compare the results with other API that claim to be REST. You will be surprised how different the results will be!",
          "tags": [
            {
              "id": "cjhg094m612nx0185d3gnbqdk",
              "name": "NodeJS"
            }
          ],
          "speaker": [
            {
              "id": "cjhhsl7zh2ix301361kg0u7v7",
              "name": "Vincenzo Chianese",
              "bio": "WebAPIs, React, Javascript and conferences. Part of @Auth0Ambassador group. Formerly @apiaryio, @oracle, now @lunchbadger, moving @express_gateway forward",
              "topics": []
            }
          ]
        },
        {
          "link": "txZq7Laz7_4",
          "views": 20590,
          "likes": 469,
          "duration": 2651,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "CSS Grid is now live in all major browsers, and with it everything we know about web layouts changes! Imagine drawing a grid in the browser and placing content in one or any number of cells without having to change the HTML or source order. And imagine changing that grid on the fly using media queries or JavaScript while keeping the HTML markup clean and accessible. That’s what CSS Grid does, and that’s why you should be using it today.\nThe CSS Grid Layout Module introduces a native CSS grid system, provided at the viewport level, that achieves what CSS frameworks and popular grid systems could only dream about: Responsive, flexible, pure CSS grid layouts, independent of document source order, that allow us to treat the browser as a true design and layout surface.\nIn this talk you’ll get an intro to CSS Grid and learn how it changes pretty much everything when it comes to layouts on the web. Through examples, code snippets, and practical demos you’ll learn how to use CSS Grid in a theme for modern responsive layouts, and you’ll also learn how to handle older browsers without Grid support in a clean and straight-forward way.\nCSS Grid is here, and you can start using it today. This talk shows you how to do it right.",
          "tags": [
            {
              "id": "cjhg07w6912d10185umgied60",
              "name": "CSS"
            }
          ],
          "speaker": [
            {
              "id": "cjhjbpz0i1h5o01637ukrtfem",
              "name": "Morten Rand-Hendriksen",
              "bio": "Senior Staff Instructor, LinkedIn Learning (http://lnkd.in/mor10 ) + Lynda. Feminist. Talks ethics, web, philosophy, information. Loves to dance. Opinionated.",
              "topics": []
            }
          ]
        },
        {
          "link": "ed7A7r6DBsM",
          "views": 9126,
          "likes": 111,
          "duration": 2800,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "Software is difficult because the parts don't fit together. Why is this? Can we do anything about this? And what's this got to do with Erlang? Come to my talk and you'll find out!",
          "tags": [
            {
              "id": "cjhkg97nw0cr701488y6mkd8o",
              "name": "Erlang"
            },
            {
              "id": "cjhg0cw2i12tq0152dwxweli5",
              "name": "Computer Science"
            }
          ],
          "speaker": [
            {
              "id": "cjhkg82zs0cgk01420rzhr0rw",
              "name": "Joe Armstrong",
              "bio": "Writes programs and books. Invents things. Gives talks. Fixes broken software. Hobbies: Stroking cats, playing piano, grumbling, reading, thinking.",
              "topics": []
            }
          ]
        },
        {
          "link": "lKXe3HUG2l4",
          "views": 133452,
          "likes": 1946,
          "duration": 2750,
          "publishedAt": "2018-07-02T16:35:48+00:00",
          "description": "",
          "tags": [
            {
              "id": "cjhg0cw2i12tq0152dwxweli5",
              "name": "Computer Science"
            },
            {
              "id": "cjhg1m06y1fdk01015q4q7wi8",
              "name": "Society"
            }
          ],
          "speaker": [
            {
              "id": "cjhkg82zs0cgk01420rzhr0rw",
              "name": "Joe Armstrong",
              "bio": "Writes programs and books. Invents things. Gives talks. Fixes broken software. Hobbies: Stroking cats, playing piano, grumbling, reading, thinking.",
              "topics": []
            }
          ]
        },
        {
          "link": "7HECD3eLoVo",
          "views": 3914,
          "likes": 90,
          "duration": 1618,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "",
          "tags": [
            {
              "id": "cjhg0cw2i12tq0152dwxweli5",
              "name": "Computer Science"
            }
          ],
          "speaker": [
            {
              "id": "cjhkglxfc0hyp01429li4b5u5",
              "name": "Pieter Hintjens",
              "bio": "Pieter Hintjens is a writer, programmer and thinker who has spent decades building large software systems and on-line communities, which he describes as \"Living Systems\". He is an expert in distributed computing, having written over 30 protocols and distributed software systems. He designed AMQP in 2004, and founded the ZeroMQ free software project in 2007.",
              "topics": []
            }
          ]
        },
        {
          "link": "36bKE_JsHZs",
          "views": 3704,
          "likes": 60,
          "duration": 2826,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "Pieter will talk about the urgent push towards a decentralized future.  As founder of the ZeroMQ community, he will explain the vision, design and reality of distributed software systems. He'll explain his view on the community itself, also a highly decentralized \"Living System\", as Hintjens calls it. Finally he'll talk about edgenet, a model for a decentralized Internet.",
          "tags": [
            {
              "id": "cjhg0cw2i12tq0152dwxweli5",
              "name": "Computer Science"
            }
          ],
          "speaker": [
            {
              "id": "cjhkglxfc0hyp01429li4b5u5",
              "name": "Pieter Hintjens",
              "bio": "Pieter Hintjens is a writer, programmer and thinker who has spent decades building large software systems and on-line communities, which he describes as \"Living Systems\". He is an expert in distributed computing, having written over 30 protocols and distributed software systems. He designed AMQP in 2004, and founded the ZeroMQ free software project in 2007.",
              "topics": []
            }
          ]
        },
        {
          "link": "ROor6_NGIWU",
          "views": 100685,
          "likes": null,
          "duration": 3770,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "",
          "tags": [
            {
              "id": "cjhhjhtmm22060198td08oxah",
              "name": "Clojure"
            }
          ],
          "speaker": [
            {
              "id": "cjhf5pojp29000191zr0seuku",
              "name": "Rich Hickey",
              "bio": "Creator of Clojure",
              "topics": []
            }
          ]
        },
        {
          "link": "3wyd6J3yjcs",
          "views": 26701,
          "likes": 548,
          "duration": 3054,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "We love our silver bullets don’t we? Constantly chasing the dream that the next big thing will solve all our past problems. It doesn’t matter if it’s a language, framework, platform or library, we’re out there chasing it. Why? Well because it’s going to solve our needs, it’s going to solve the business needs. Well supposedly it will. And how much is it going to cost? Not that much, especially if we’re not the ones paying the bills. It’s about time we look at the hard facts and ask those difficult questions. Are we really looking for a silver bullet? Why are we constantly riding the technology bandwagon? Where is the churn going to take us? And at what cost?",
          "tags": [
            {
              "id": "cjhg1b8nh1cls0152eqs0reeb",
              "name": "Personal"
            },
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            }
          ],
          "speaker": [
            {
              "id": "cjhjlnh152dc20126mlrkxuwq",
              "name": "Hadi Hariri",
              "bio": "Developer, Speaker. Host of @TalkingKotlin. Developer Advocacy. JetBrains.",
              "topics": []
            }
          ]
        },
        {
          "link": "X25xOhntr6s",
          "views": 26955,
          "likes": 525,
          "duration": 3511,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "",
          "tags": [
            {
              "id": "cjhjllp142chs018059kdfzai",
              "name": "Elixir"
            }
          ],
          "speaker": [
            {
              "id": "cjhjlmwwx2dj80148igwkjx0f",
              "name": "Jessica Kerr",
              "bio": "Developer, @Atomist. Panelist, @greaterthancode. Tweets are mine, licensed CC0. she/her",
              "topics": []
            }
          ]
        },
        {
          "link": "4E3xfR6IBII",
          "views": 34005,
          "likes": 550,
          "duration": 1289,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "In the last decade or so we've seen a number of new ideas added to the mix to help us effectively design our software. Patterns help us capture the solutions and rationale for using them. Refactoring allows us to alter the design of a system after the code is written. Agile methods, in particular Extreme Programming, give us a highly iterative and evolutionary approach which is particularly well suited to changing requirements and environments. Martin Fowler has been a leading voice in these techniques and will give a suite of short talks featuring various aspects about his recent thinking about how these and other developments affect our software development.",
          "tags": [
            {
              "id": "cjhgjq7xl22sc0105imdicvtz",
              "name": "Agile"
            }
          ],
          "speaker": [
            {
              "id": "cjhjljm842d0x015762687hj1",
              "name": "Martin Fowler",
              "bio": "Programmer, Loud Mouth, ThoughtWorker",
              "topics": []
            }
          ]
        },
        {
          "link": "VfRVz1iqgKU",
          "views": 4720,
          "likes": 73,
          "duration": 3070,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "Software presents a paradox, its ease of use allows for complexity and adaptability, yet these features often make software impossible: https://www.gresham.ac.uk/lectures-and-events/how-can-software-be-so-hard\nHow can it be possible for teenagers to write smartphone apps that make them multi-millionaires when many commercial and Government IT projects fail, despite employing the skills and resources of international IT companies? What is software and how is it developed? How confident do we need to be that it is sufficiently correct, reliable, usable, safe or secure? What evidence would we need? The main reasons why software projects overrun, get cancelled, or deliver inadequate software will be explored, using examples of project failures and the litigations that often result.",
          "tags": [
            {
              "id": "cjhg0cw2i12tq0152dwxweli5",
              "name": "Computer Science"
            },
            {
              "id": "cjhgjmcbi20ds0149hootybxs",
              "name": "Security"
            }
          ],
          "speaker": [
            {
              "id": "cjhjlffpr2auz0157n478vwom",
              "name": "Martyn Thomas",
              "bio": "A world-renowned expert in software engineering and cybersecurity, Martyn Thomas CBE is the very first IT Livery Company Professor of Information Technology at Gresham College.",
              "topics": []
            }
          ]
        },
        {
          "link": "E0igfLcilSk",
          "views": 1827,
          "likes": 27,
          "duration": 3467,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "Software is an essential part of many safety-critical systems. Modern cars and aircraft contain dozens of processors and millions of lines of computer software. \nThis lecture looks at the standards and guidance that are used when regulators certify these systems for use. Do these standards measure up to the recommendations of a report on Certifiably Dependable Software from the US National Academies? Are they based on sound computer science?",
          "tags": [
            {
              "id": "cjhgjmcbi20ds0149hootybxs",
              "name": "Security"
            },
            {
              "id": "cjhg0cw2i12tq0152dwxweli5",
              "name": "Computer Science"
            }
          ],
          "speaker": [
            {
              "id": "cjhjlffpr2auz0157n478vwom",
              "name": "Martyn Thomas",
              "bio": "A world-renowned expert in software engineering and cybersecurity, Martyn Thomas CBE is the very first IT Livery Company Professor of Information Technology at Gresham College.",
              "topics": []
            }
          ]
        },
        {
          "link": "GRr4xeMn1uU",
          "views": 15552,
          "likes": 247,
          "duration": 2846,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "",
          "tags": [
            {
              "id": "cjhg0cw2i12tq0152dwxweli5",
              "name": "Computer Science"
            },
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            },
            {
              "id": "cjhg0aa14127j0186n3g5jscc",
              "name": "Inspirational"
            }
          ],
          "speaker": [
            {
              "id": "cjhjbspr31ias0107i1fx60zt",
              "name": "Greg Young",
              "bio": "",
              "topics": []
            }
          ]
        },
        {
          "link": "N-lSE3DBerM",
          "views": 2683,
          "likes": 51,
          "duration": 1842,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "",
          "tags": [
            {
              "id": "cjhg0bcw9138q01016huz9ayo",
              "name": "Story"
            },
            {
              "id": "cjhg1b8nh1cls0152eqs0reeb",
              "name": "Personal"
            }
          ],
          "speaker": [
            {
              "id": "cjhjbspr31ias0107i1fx60zt",
              "name": "Greg Young",
              "bio": "",
              "topics": []
            }
          ]
        },
        {
          "link": "IgbHzFb1hGw",
          "views": 7387,
          "likes": 115,
          "duration": 2788,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "",
          "tags": [
            {
              "id": "cjhg1m06y1fdk01015q4q7wi8",
              "name": "Society"
            },
            {
              "id": "cjhg1b8nh1cls0152eqs0reeb",
              "name": "Personal"
            }
          ],
          "speaker": [
            {
              "id": "cjhkgrs8i0jds0131782wva5q",
              "name": "Avdi Grimm",
              "bio": "The boy with the underground spring",
              "topics": []
            }
          ]
        },
        {
          "link": "y1SrFctEYY4",
          "views": 460,
          "likes": 15,
          "duration": 3332,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "At the EyeO Festival in Minneapolis, Minnesota, just a few weeks after Prince's passing, Anil Dash celebrates what would have been Prince's 58th birthday with a deeply personal, wide-ranging talk connecting immigration & the Great Migration, artistry & technology, grave injustices & profound triumphs. This may be the only time we see how American highway policy, AOL chat rooms and Jimi Hendrix's guitar pedals all combined to shape Prince's work.\n\nIn the end, we find out that Prince's career culminated in a cultural victory as unique and inspiring as Prince himself.",
          "tags": [
            {
              "id": "cjhg1b8nh1cls0152eqs0reeb",
              "name": "Personal"
            }
          ],
          "speaker": [
            {
              "id": "cjhkh2s2n0p0s0191m6b8hdv3",
              "name": "Anil Dash",
              "bio": "Just like Wario, I am the CEO of a small and beloved software company. Make the web amazing on @Glitch!",
              "topics": []
            }
          ]
        },
        {
          "link": "CZ3wIuvmHeM",
          "views": 418941,
          "likes": 5646,
          "duration": 3194,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "Josh Evans talks about the chaotic and vibrant world of microservices at Netflix. He starts with the basics- the anatomy of a microservice, the challenges around distributed systems, and the benefits. Then he builds on that foundation exploring the cultural, architectural, and operational methods that lead to microservice mastery.",
          "tags": [
            {
              "id": "cjhkgtkp80jzu01317fh49we3",
              "name": "Microservices"
            }
          ],
          "speaker": [
            {
              "id": "cjhkgzjbj0msp0130q4z8zx51",
              "name": "Josh Evans",
              "bio": "Engineering leader @GitHub, gamer, media enthusiast, science lover, sci-fi fanatic, proud Californian, global citizen",
              "topics": []
            }
          ]
        },
        {
          "link": "I32hmY4diFY",
          "views": 80515,
          "likes": 774,
          "duration": 2341,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "Neha Narkhede talks about the experience at LinkedIn moving from batch-oriented ETL to real-time streams using Apache Kafka and how the design and implementation of Kafka was driven by this goal of acting as a real-time platform for event data. She covers some of the challenges of scaling Kafka to hundreds of billions of events per day at Linkedin, supporting thousands of engineers, etc.",
          "tags": [
            {
              "id": "cjhkgxy390n3v01919gvb6tji",
              "name": "Scaling"
            },
            {
              "id": "cjhkgtkp80jzu01317fh49we3",
              "name": "Microservices"
            }
          ],
          "speaker": [
            {
              "id": "cjhkgwblm0l0a01435t3b74e3",
              "name": "Neha Narkhede",
              "bio": "Co-founder and CTO @confluentinc, Co-creator @apachekafka, Globetrotter, Wannabe photographer. Frequently resorts to retail therapy, yeah .. I know.",
              "topics": []
            }
          ]
        },
        {
          "link": "VYpAodcdFfA",
          "views": 8130,
          "likes": 294,
          "duration": 860,
          "publishedAt": "2018-07-02T16:35:47+00:00",
          "description": "In this talk, Danny Yuan explains intuitively fast Fourier transformation and recurrent neural network. He explores how the concepts play critical roles in time series forecasting. Learn what the tools are, the key concepts associated with them, and why they are useful in time series forecasting.",
          "tags": [
            {
              "id": "cjhg0cw2i12tq0152dwxweli5",
              "name": "Computer Science"
            }
          ],
          "speaker": [
            {
              "id": "cjhkh18dy0n2p0148snsdq6el",
              "name": "Danny Yuan",
              "bio": "works@Uber",
              "topics": []
            }
          ]
        },

      {
        "link": "hnpzNAPiC0E",
        "views": 19344,
        "likes": 428,
        "duration": 3072,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "Lisa Guo overviews Instagram's infrastructure, its history, multi-data center support, tuning uwsgi parameters for scaling, performance monitoring and diagnosis, and Django/Python upgrade.",
        "tags": [
          {
            "id": "cjhg09gx711vs01520uh3s6fp",
            "name": "Performance"
          },
          {
            "id": "cjhkg49y80ays0148pmxji073",
            "name": "Django"
          },
          {
            "id": "cjhkgtkp80jzu01317fh49we3",
            "name": "Microservices"
          },
          {
            "id": "cjhkgxy390n3v01919gvb6tji",
            "name": "Scaling"
          }
        ],
        "speaker": [
          {
            "id": "cjhkgva6l0m610191lwrun4q6",
            "name": "Lisa Guo",
            "bio": "Lisa Guo is a software engineer on Instagram infrastructure for the past 2.5 years. She has worked on various aspects on the back-end, mostly recently focusing on efficiency aspect of the platform. Prior to Instagram, she worked on several Software Defined Networking projects at Facebook infrastructure team.",
            "topics": []
          }
        ]
      },
      {
        "link": "E8-e-3fRHBw",
        "views": 17227,
        "likes": 313,
        "duration": 3127,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "Randy Shoup shares proven patterns that have been successful at Google, eBay, and Stitch Fix. Shoup covers managing data, the need to isolate a microservice's data store behind the service interface, using events as a first-class tool in the architectural toolbox, techniques for service extraction from a monolithic database and much more.",
        "tags": [
          {
            "id": "cjhkgtkp80jzu01317fh49we3",
            "name": "Microservices"
          }
        ],
        "speaker": [
          {
            "id": "cjhkgu9ea0ksb01305jxwcsba",
            "name": "Randy Shoup",
            "bio": "VP Engineering at WeWork (former Stitch Fix, eBay, Google)",
            "topics": []
          }
        ]
      },
      {
        "link": "FvmTSpJU-Xc",
        "views": 42358,
        "likes": 481,
        "duration": 4047,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "",
        "tags": [
          {
            "id": "cjhg1m06y1fdk01015q4q7wi8",
            "name": "Society"
          },
          {
            "id": "cjhg1b8nh1cls0152eqs0reeb",
            "name": "Personal"
          },
          {
            "id": "cjhg0cw2i12tq0152dwxweli5",
            "name": "Computer Science"
          }
        ],
        "speaker": [
          {
            "id": "cjhkgeq460ezo013057afqs2w",
            "name": "Alan Kay",
            "bio": "Alan Kay, American computer scientist and winner of the 2003 A.M. Turing Award, the highest honour in computer science, for his contributions to object-oriented programming languages, including Smalltalk.",
            "topics": []
          }
        ]
      },
      {
        "link": "ubaX1Smg6pY",
        "views": 48786,
        "likes": 522,
        "duration": 6172,
        "publishedAt": "2018-07-02T16:35:46+00:00",
        "description": "Alan Kay, education, process science, and economics of mediocrity.",
        "tags": [
          {
            "id": "cjhg1m06y1fdk01015q4q7wi8",
            "name": "Society"
          },
          {
            "id": "cjhg0cw2i12tq0152dwxweli5",
            "name": "Computer Science"
          }
        ],
        "speaker": [
          {
            "id": "cjhkgeq460ezo013057afqs2w",
            "name": "Alan Kay",
            "bio": "Alan Kay, American computer scientist and winner of the 2003 A.M. Turing Award, the highest honour in computer science, for his contributions to object-oriented programming languages, including Smalltalk.",
            "topics": []
          }
        ]
      },
      {
        "link": "KDHrtYGbUQ8",
        "views": 379,
        "likes": 5,
        "duration": 2486,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "We produce software systems at an ever increasing rate, but our ability to get cleanup after older systems does not keep up with that pace. An IDC study showed that there are some 10k mainframe systems in use containing some 200B LOC. This shows that software is not that soft, and that once let loose systems produce long lasting consequences. Because of the impact of our industry, we need to look at software development as a problem of environmental proportions. We must build our systems with recycling in mind. As builders of the future world, we have to take this responsibility seriously.",
        "tags": [
          {
            "id": "cjhg0cw2i12tq0152dwxweli5",
            "name": "Computer Science"
          }
        ],
        "speaker": [
          {
            "id": "cjhkgcbnd0dtn0143pzg41ohs",
            "name": "Tudor Girba",
            "bio": "Reshaping the Development eXperience. Co-founder of @feenkcom. Related projects: http://gtoolkit.org , @moosetechnology, @humaneA. @pharoproject",
            "topics": []
          }
        ]
      },
      {
        "link": "ZGsYHws-hbc",
        "views": 121,
        "likes": 2,
        "duration": 3313,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "We were supposed to build a better world. Design and technology was supposed to point the way towards utopia. Instead, we designed a nightmare. Find out why this was our fault and what you can do to help fix it.",
        "tags": [
          {
            "id": "cjhg0bwrj13o30151u7hi4mhv",
            "name": "Design"
          },
          {
            "id": "cjhg1m06y1fdk01015q4q7wi8",
            "name": "Society"
          }
        ],
        "speaker": [
          {
            "id": "cjhg2q60y1pqz0101ow8m477e",
            "name": "Mike Monteiro",
            "bio": "Editor of Dear Design Student, Mule Design Studio, and Maybe It’s Fiction",
            "topics": []
          }
        ]
      },
      {
        "link": "bgV39DlmZ2U",
        "views": 4597,
        "likes": 34,
        "duration": 3050,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "",
        "tags": [
          {
            "id": "cjhkg49y80ays0148pmxji073",
            "name": "Django"
          }
        ],
        "speaker": [
          {
            "id": "cjhkg7c4s0d8j0191wcs992ze",
            "name": "Malcolm Tredinnick",
            "bio": "Random IT hacker; knows enough about stuff to be dangerous",
            "topics": []
          }
        ]
      },
      {
        "link": "_e6BKJPnb5o",
        "views": 16509,
        "likes": null,
        "duration": 2439,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "Programmers are evil.  Not lazy.  Not incompetent.  Not... simply bad.  EVIL.  Right down to their frozen little hearts.  And I can prove it.  ",
        "tags": [
          {
            "id": "cjhg0e2ns13wl0101195y0r2o",
            "name": "Funny"
          }
        ],
        "speaker": [
          {
            "id": "cjhkg3qyo0b4e01854e051w0k",
            "name": "Bryan Lunduke",
            "bio": "Writer. Tech Journalist. Game Designer. Comic Maker. Linux Dude.",
            "topics": []
          }
        ]
      },
      {
        "link": "aApmOZwdPqA",
        "views": 11820,
        "likes": 148,
        "duration": 2774,
        "publishedAt": "2018-07-02T16:35:48+00:00",
        "description": "",
        "tags": [
          {
            "id": "cjhg1b8nh1cls0152eqs0reeb",
            "name": "Personal"
          },
          {
            "id": "cjhg0bcw9138q01016huz9ayo",
            "name": "Story"
          },
          {
            "id": "cjhg1m06y1fdk01015q4q7wi8",
            "name": "Society"
          }
        ],
        "speaker": [
          {
            "id": "cjhkg26qj0aar0130sq9dkir1",
            "name": "Kent Beck",
            "bio": "Programmer, coach coach, singer/guitarist, peripatetic. Learning to be me.",
            "topics": []
          }
        ]
      },
      {
        "link": "u5oTz1e5qqE",
        "views": 171561,
        "likes": 1919,
        "duration": 871,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "In this video Scott Hanselman delivers one of the best and personal demos, he'll show you how a combined solution using technologies such as IoT devices, cloud platforms, Machine Learning and Office API's can come together to solve even the most complex problems.\nThe HealthClinic.biz demo used in the video can be found in the repo athttps://github.com/Microsoft/HealthClinic.biz/\n The samples in the repo are used to present an end-to-end demo scenario based on a fictitious B2B and multitenant system, named \"HealthClinic.biz\" that provides different websites, mobile apps, wearable apps, and services running on the latest Microsoft and open technologies.",
        "tags": [
          {
            "id": "cjhkg07z409tr018561qf5ehb",
            "name": "IOT"
          },
          {
            "id": "cjhg1b8nh1cls0152eqs0reeb",
            "name": "Personal"
          },
          {
            "id": "cjhg0bcw9138q01016huz9ayo",
            "name": "Story"
          }
        ],
        "speaker": [
          {
            "id": "cjhkg002x09ld0143h832lcre",
            "name": "Scott Hanselman",
            "bio": "Tech, Code, Race, Linguistics, Web, Parenting, Black Hair, STEM, Beyoncé, Phony. Umuntu ngumuntu ngabantu. @Hanselminutes podcast for inclusive tech talk!",
            "topics": []
          }
        ]
      },
      {
        "link": "J4dlF0kcThQ",
        "views": 25479,
        "likes": 454,
        "duration": 1565,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "",
        "tags": [
          {
            "id": "cjhkk9tgd1xhy0131q13uq3t2",
            "name": "Refactoring"
          }
        ],
        "speaker": [
          {
            "id": "cjhkkajtn1ya40130s0amqv93",
            "name": "Katrina Owen",
            "bio": "I make exercism.io. Co-author of http://99bottlesbook.com  with @sandimetz.",
            "topics": []
          }
        ]
      },
      {
        "link": "D3e3V66TH2Y",
        "views": 13304,
        "likes": 172,
        "duration": 2992,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": " In this talk, we will explore nothing.\n\nAnd, yes, literally nothing. Together we’ll take a look behind the curtains of reality and explore some of the underlying rules that shape our existence. We will dig into ancient philosophy, the history and today's status physics and maths, look into the origins of computing, programming and analyse the way we develop software today. We’ll see how nothing influences us, how it shapes our behaviour every day and how nothing can help us grow – in our professions and, even more, as humans.\n\n“Nothing really matters,”, Freddie Mercury wrote in a song that was released 40 years ago. I want to show you how right he is.",
        "tags": [
          {
            "id": "cjhg0aa14127j0186n3g5jscc",
            "name": "Inspirational"
          }
        ],
        "speaker": [
          {
            "id": "cjhg1sfkg1h1i0101i7sivfjh",
            "name": "Lena Reinhard",
            "bio": "Former VP Eng taking a break. Speaker, Writer, Photographer, Feminist, former & future CEO. she/her. “Canniest person in the whole world.”",
            "topics": []
          }
        ]
      },
      {
        "link": "cGnU3GaALOQ",
        "views": 2801,
        "likes": 40,
        "duration": 646,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "",
        "tags": [
          {
            "id": "cjhg1b8nh1cls0152eqs0reeb",
            "name": "Personal"
          },
          {
            "id": "cjhg1m06y1fdk01015q4q7wi8",
            "name": "Society"
          }
        ],
        "speaker": [
          {
            "id": "cjhkkiiu8223l01915aro14pq",
            "name": "Ryan Martinsen",
            "bio": "My name is Ryan Martinsen. I’m a software engineer based in Orlando, Florida. I’m happily married to my best friend, I love donuts, ice cream, and clean code.",
            "topics": []
          }
        ]
      },
      {
        "link": "V6QHZYCwgCg",
        "views": 351,
        "likes": 5,
        "duration": 3727,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "",
        "tags": [
          {
            "id": "cjhkkhlem21rf0191k3a2g6jb",
            "name": "Management"
          }
        ],
        "speaker": [
          {
            "id": "cjhkkh77420fe0131pjb6dvli",
            "name": "Ken Kousen",
            "bio": "Java Champion, Software trainer and developer, NFJS speaker, and author of Modern Java Recipes, Making Java Groovy, and Gradle Recipes for Android",
            "topics": []
          }
        ]
      },
      {
        "link": "KknECIHBAGE",
        "views": 630,
        "likes": 8,
        "duration": 3555,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "How does the pervasiveness of JavaScript on the client change how we architect applications? We can create hundreds virtual machines in the cloud, but we are using the millions of visual machines that visit our sites every day?\n\nSuddenly we are scripting against thousands of Virtual Machines from the command line while creating things today with JavaScript in the browser that were impossible yesterday. LiveScript becomes JavaScript becomes ES6 and now we're compiling C++ to JavaScript.",
        "tags": [
          {
            "id": "cjhg0901y12770162f0lf32t4",
            "name": "Javascript"
          }
        ],
        "speaker": [
          {
            "id": "cjhkg002x09ld0143h832lcre",
            "name": "Scott Hanselman",
            "bio": "Tech, Code, Race, Linguistics, Web, Parenting, Black Hair, STEM, Beyoncé, Phony. Umuntu ngumuntu ngabantu. @Hanselminutes podcast for inclusive tech talk!",
            "topics": []
          }
        ]
      },
      {
        "link": "arj7oStGLkU",
        "views": 12426851,
        "likes": 398846,
        "duration": 844,
        "publishedAt": "2018-07-02T16:39:46+00:00",
        "description": "Tim Urban knows that procrastination doesn't make sense, but he's never been able to shake his habit of waiting until the last minute to get things done. In this hilarious and insightful talk, Urban takes us on a journey through YouTube binges, Wikipedia rabbit holes and bouts of staring out the window -- and encourages us to think harder about what we're really procrastinating on, before we run out of time.",
        "tags": [
          {
            "id": "cjhg0bcw9138q01016huz9ayo",
            "name": "Story"
          },
          {
            "id": "cjhg1m06y1fdk01015q4q7wi8",
            "name": "Society"
          }
        ],
        "speaker": [
          {
            "id": "cjhkmq7n12ymv0131nmuce4sr",
            "name": "Tim Urban",
            "bio": "http://facebook.com/waitbutwhy ",
            "topics": []
          }
        ]
      },
      {
        "link": "oiNWG05HVzY",
        "views": 23,
        "likes": 1,
        "duration": 336,
        "publishedAt": "2018-07-02T16:35:48+00:00",
        "description": "",
        "tags": [
          {
            "id": "cjhg1m06y1fdk01015q4q7wi8",
            "name": "Society"
          }
        ],
        "speaker": [
          {
            "id": "cjhkmozp52yqq0142qs4y2pow",
            "name": "Anjuan Simmons",
            "bio": "Technology Translator | Storyteller | International Speaker | Writer",
            "topics": []
          }
        ]
      },
      {
        "link": "Q2vqjQdw6jU",
        "views": 315,
        "likes": 9,
        "duration": 1205,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "How many time do software companies spend for software maintenance? From design to the refactoring of existing code? Don't you feel that it would be more useful to throw all that code away? During this talk we are going to try to apply the Martin Fowler's Sacrificial Architecture in the modern web development ecosystem in order to make our frontend code easy to rewrite for every new feature.",
        "tags": [
          {
            "id": "cjhg0901y12770162f0lf32t4",
            "name": "Javascript"
          }
        ],
        "speaker": [
          {
            "id": "cjhl68c5r0icr0151jmz4gtob",
            "name": "Francesco Strazzullo",
            "bio": "Frontend engineer and speaker @extrategy, JavaScripts books reviewer and cofounder of @MarcaUserGruop founders. Also a PlayStation lover.",
            "topics": []
          }
        ]
      },
      {
        "link": "-tVQBLGvfnw",
        "views": 14,
        "likes": 1,
        "duration": 3210,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "As NoSQL databases increase in popularity, they also increase in popularity with hackers. NoSQL\ndatabases are vulnerable to traditional attacks like SQL injection (yes, really). Further, the rush to\nproductivity leaves some of these databases insecure-by-design. As a result, ransom notes have\nplagued databases like MongoDB, ElasticSearch, Hadoop, and CouchDB. This session\ndemonstrates security mistakes and prevention. We'll also look at what NoSQL vendors are doing to\nmitigate future attacks. Both devs and devops should come to this session, because the last thing\neither of you want to see is \"SEND 0.2 BTC TO THIS ADDRESS 1zaGVjj9NcyvDLyYpCh33Msq TO\nRECOVER YOUR DATABASE!\"",
        "tags": [
          {
            "id": "cjhgjmcbi20ds0149hootybxs",
            "name": "Security"
          }
        ],
        "speaker": [
          {
            "id": "cjhl6b1cs0jzl010861qmypp8",
            "name": "Matthew Groves",
            "bio": "#Couchbase Developer Advocate, @Microsoft MVP, author, speaker, podcaster, blogger, live streamer, etc",
            "topics": []
          }
        ]
      },
      {
        "link": "Zn9IreO6wAQ",
        "views": 24,
        "likes": 3,
        "duration": 781,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "3 years ago my wife and I began growing most of our own food. I’d never grown anything before and dedicated 2 years to obsessively learning about growing food. There’s a lot of information to memorize and to keep track of and from the beginning I knew a mobile app would make things much easier. I started learning how to code last year and released version 1 of our free mobile app that helps people grow food in November. This talk explains how I learned to code, how I built it, and some of the motivations behind why. ",
        "tags": [
          {
            "id": "cjhg0bcw9138q01016huz9ayo",
            "name": "Story"
          },
          {
            "id": "cjhg0xzhg190d0185dj2w0irs",
            "name": "Angular"
          }
        ],
        "speaker": [
          {
            "id": "cjhl6cvax0kup0191jpyfzo1z",
            "name": "Dale Spoonemore",
            "bio": "Thoughts about software development (creator of @fromseed2spoon), growing food, being a dad, public speaking, tech stuff, and other randomness",
            "topics": []
          }
        ]
      },
      {
        "link": "V8tXLos5UKg",
        "views": 100,
        "likes": 1,
        "duration": 1997,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "How we can do awesome things with Webassembly? What does it offer? How easy it is to kick start WebAssembly in your application? We can compare the performance difference between with native JS.",
        "tags": [
          {
            "id": "cjhl68vnh0ilh0100b5zr4njq",
            "name": "WebAssembly"
          }
        ],
        "speaker": [
          {
            "id": "cjhl69n2u0jnx01915xzhrclb",
            "name": "Sendil Kumar",
            "bio": "Team member @webpack @java_hipster @rustwasm WG @utrechtjug | Full stack developer @xebialabs | Author🖋 | Speaker | Learner",
            "topics": []
          }
        ]
      },
      {
        "link": "L0xz-ILKsLE",
        "views": 3393,
        "likes": null,
        "duration": 2777,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "The world of compile-to-js is only getting more exciting and the tools are only getting better. With ReasonML, there is a strong candidate for a typed language that compiles down to readable JavaScript that is usable by functional programming beginners and experts alike. With ReasonML, you take everything you love about building applications for the web. Add types for safety and a world class compiler that doesn't require you to write type declarations for every expression but just infers the types through the program.\n\nLearn how to build a universally rendered ReactJS application in ReasonML, on both the front and the backend. Covering: an introduction to the language, an overview of the bindings to existing JavaScript libraries like ReactJS and Express, and how to tie it all together to build a modern webapp without sacrificing type safety or expressiveness, in the same language on both the server and client.",
        "tags": [
          {
            "id": "cjhl5zs3t0f1j0113zfbex25m",
            "name": "ReasonML"
          }
        ],
        "speaker": [
          {
            "id": "cjhl5zm3p0f7v019196zre6yz",
            "name": "Jacob Bass",
            "bio": "Hi, I'm Jacob. Very occasionally I convince myself to write something here, but far more often I go and build something else instead.",
            "topics": []
          }
        ]
      },
      {
        "link": "_v0ghxbncoY",
        "views": 218,
        "likes": 8,
        "duration": 879,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "",
        "tags": [
          {
            "id": "cjhg0axyh13460195gookni3c",
            "name": "React"
          }
        ],
        "speaker": [
          {
            "id": "cjhl66jfw0hq80113d9oduw6b",
            "name": "Wesley de Souza",
            "bio": "Senior Developer, @workandco",
            "topics": []
          }
        ]
      },
      {
        "link": "ZKi87Bx4YNQ",
        "views": 2513,
        "likes": 49,
        "duration": 1830,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "People in our community are bursting with excitement about ReasonML - but why is that, and what does it have to do with our beloved React? Is this something for hipster types only, or will we all be using it in a year's time?\n\nAll great questions! Join me in surfing the hype wave for the answers and more! 🚀",
        "tags": [
          {
            "id": "cjhl5zs3t0f1j0113zfbex25m",
            "name": "ReasonML"
          }
        ],
        "speaker": [
          {
            "id": "cjhl63q350gjw0139plzpt0fk",
            "name": "Marcel Cutts",
            "bio": "Standard human meat bag. Founder of http://Asgard.tech  | Organiser of @ReasonLDN | Cyberpunk enthusiast",
            "topics": []
          }
        ]
      },
      {
        "link": "WTQAI9TzBx0",
        "views": 419,
        "likes": 8,
        "duration": 2884,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "An accessible internet experience makes all the difference for a person with a disability, whether they're enjoying online entertainment, paying bills or booking a trip to go adaptive skiing. You see, people with disabilities gain privacy and independence when they can handle their own affairs. Wouldn't it be radical if every web application supported users with disabilities?\n\nAs web experts, we can enable more of our users by shipping accessible interfaces every time, and I'll show you how. In this talk, We'll audit a web application for accessibility, making the necessary changes to support people with disabilities. The best part about it? By integrating accessibility into our development workflow, we'll make our apps more usable by everyone.",
        "tags": [
          {
            "id": "cjhg0qv5417gi0162qms6qvl0",
            "name": "Accessibility"
          }
        ],
        "speaker": [
          {
            "id": "cjhl6m5tb0nt90100ksrcdg5r",
            "name": "Marcy Sutton",
            "bio": "Accessible web technologies expert, @a11ySea & @GDIBellingham organizer. Mountain explorer, cyclist, music junkie, dog lover.",
            "topics": []
          }
        ]
      },
      {
        "link": "LY6y3HbDVmg",
        "views": 15547,
        "likes": null,
        "duration": 1653,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "Front-end developers sit atop a massive amount of technology, often treating whole pieces of our application as opaque functionality. Grab a hard hat and follow me down into the internals of Preact, a tiny 3kb alternative to React. Along the way we’ll shed light on fundamentals like JSX & Virtual DOM, demystify DOM diffing, and see how keys work up-close. On our way back to the surface, we’ll stop at the Museum of Lost Hours to see some performance and size optimizations. Hope you’re not afraid of the dark!",
        "tags": [
          {
            "id": "cjhmb6rzw3m7h01641vakmfkt",
            "name": "Preact"
          },
          {
            "id": "cjhg0901y12770162f0lf32t4",
            "name": "Javascript"
          }
        ],
        "speaker": [
          {
            "id": "cjhmb6j9a3ltf0196f2adj54t",
            "name": "Jason Miller",
            "bio": "Web DevRel at @google. Creator of @preactjs. Do more with less. http://github.com/developit ",
            "topics": []
          }
        ]
      },
      {
        "link": "iFTWM7HV2UI",
        "views": 465970,
        "likes": 15115,
        "duration": 1376,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "",
        "tags": [
          {
            "id": "cjhg0pta1179f0195fxd1owas",
            "name": "Machine Learning"
          }
        ],
        "speaker": [
          {
            "id": "cjhwhh5k63cdt0185dk81vmgh",
            "name": "Zeynep Tufekci",
            "bio": "Thinking about our tools, ourselves. @UNCSILS prof + @NYTimes writer. Newsletter: https://tinyletter.com/zeynepnotes  Book: https://www.twitterandteargas.org/ ",
            "topics": []
          }
        ]
      },
      {
        "link": "jFULzAMS-jI",
        "views": 6981,
        "likes": 105,
        "duration": 1391,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "The future of state management in React apps is here! \n\nIn this talk, we'll discuss why GraphQL queries and mutations are a perfect fit for describing what's happening with our app's local and remote data. \n\nYou'll also learn how Apollo Client can simplify React state management by eliminating configuration and providing one unified interface to all of your app's data.",
        "tags": [
          {
            "id": "cjhlsxy4o2srq0138tme9d6is",
            "name": "GraphQL"
          },
          {
            "id": "cjhg0axyh13460195gookni3c",
            "name": "React"
          }
        ],
        "speaker": [
          {
            "id": "cjhlsylxg2vqx01086yk9hs0p",
            "name": "Peggy Rayzis",
            "bio": "Exploring the world through code, travel, and music ✨ Open Source Engineer @apollographql",
            "topics": []
          }
        ]
      },
      {
        "link": "m9cTaYI95Zc",
        "views": 3447,
        "likes": 87,
        "duration": 1652,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "This presentation demonstrates how learning just a little bit about JavaScript engine internals can help you improve the run-time performance of your JavaScript code — not just in V8 specifically, but across all JavaScript engines!\n\nI’ll start by explaining how V8 handles arrays behind the scenes, and especially how it can optimize operations on them. I can do all of this with my “JS developer” hat on, i.e. without showing a single line of C++. This knowledge leads to useful insights for JavaScript developers wishing to improve their code’s run-time performance. In the end, the audience will walk away with several practical performance tips, and a deeper understanding of what’s going on under the hood.",
        "tags": [
          {
            "id": "cjhg0901y12770162f0lf32t4",
            "name": "Javascript"
          }
        ],
        "speaker": [
          {
            "id": "cjhnwpd8d23uh0176vuf51s21",
            "name": "Mathias Bynens",
            "bio": "I work on @v8js at Google and on ECMAScript through TC39. ♥ JavaScript, HTML, CSS, HTTP, performance, security, Bash, Unicode, i18n, macOS.",
            "topics": []
          }
        ]
      },
      {
        "link": "kSKeWH4TY9Y",
        "views": 29264,
        "likes": 680,
        "duration": 3579,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "Named '#1 Canadian Video Game Developer' by Brian Provinciano, a Canadian video game developer. Runs Vblank Ent. / creator & developer of Retro City Rampage.",
        "tags": [
          {
            "id": "cjhua67me1lrd0192ceo1ecdm",
            "name": "Video Games"
          },
          {
            "id": "cjhua6gta1lwc0192ou9d4htm",
            "name": "Optimization"
          }
        ],
        "speaker": [
          {
            "id": "cjhua5zlu1klt01511p23h3hz",
            "name": "Brian Provinciano",
            "bio": "Named '#1 Canadian Video Game Developer' by Brian Provinciano, a Canadian video game developer. Runs Vblank Ent. / creator & developer of Retro City Rampage.",
            "topics": [
              {
                "id": "cjhua4pkp1jz70151w1rm4dn6",
                "topic": "Video Games",
                "stage": "PUBLISHED"
              }
            ]
          }
        ]
      },
      {
        "link": "vQX5nokoqrQ",
        "views": 12903,
        "likes": 212,
        "duration": 2000,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "Learn the basics of Kubernetes from the perspective of creating a Helm Chart from scratch! \n\nThe Kubernetes cluster will be launched from Rancher, an open source container management software. At the end of this workshop, you will have a functional understanding of pods, services, deployments, Helm, Rancher, and more!\n\nWhy learn Kubernetes with Helm Charts? \nMuch of today's beginner educational content for Kubernetes uses the Kubernetes CLI tool. This can make it hard to visualize the relationship between each command and debug your cluster. Learning how to incrementally build Helm Charts provides a bigger picture of your cluster and is more reproducible.",
        "tags": [
          {
            "id": "cjhuaanhf1n3u0122bx4s2mpz",
            "name": "Kubernetes"
          }
        ],
        "speaker": [
          {
            "id": "cjhuabiea1mc50191bqgx982r",
            "name": "Amy Codes",
            "bio": "Youtuber & Distributed Systems-er",
            "topics": []
          }
        ]
      },
      {
        "link": "SfWR3dKnFIo",
        "views": 13922,
        "likes": 392,
        "duration": 1652,
        "publishedAt": "2018-07-02T16:35:46+00:00",
        "description": "",
        "tags": [
          {
            "id": "cjhg0axyh13460195gookni3c",
            "name": "React"
          },
          {
            "id": "cjhqht9jl1qhw0157r3cg6f1z",
            "name": "Functional Programming"
          }
        ],
        "speaker": [
          {
            "id": "cjhqhxgd11rxt0157o83cu8oh",
            "name": "Brian Lonsdorf",
            "bio": "Dr. Boolean",
            "topics": []
          }
        ]
      },
      {
        "link": "A8fbdZpHESo",
        "views": 1302,
        "likes": 39,
        "duration": 1742,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "The history of UI programming is littered with frameworks that failed because they compromised user experience in favour of rapid development. As a technology, React Native has what it takes to avoid this fate, but it’s up to us to prove it by building delightful experiences that feel native to the platform. The question “does it feel native?” encompasses a breadth of topics: predictability, performance, gestures, motion, sensors, sound, and more. For those of us coming from web development, there’s a lot to learn. This talk explains what users really expect from our apps, and how we can use React Native to not only meet, but exceed their expectations.",
        "tags": [
          {
            "id": "cjhg0bwrj13o30151u7hi4mhv",
            "name": "Design"
          },
          {
            "id": "cjhg0nxwf164l0101czd5huq2",
            "name": "React Native"
          }
        ],
        "speaker": [
          {
            "id": "cjhot9q2d1db80181oo7lavzj",
            "name": "Jani Evakallio",
            "bio": "@FormidableLabs UK showrunner, React engineer, comedian, speaker, writer, improviser. Twitter Developer Expert™.",
            "topics": []
          }
        ]
      },
      {
        "link": "_M4o0ExLQCs",
        "views": 8415,
        "likes": 128,
        "duration": 4473,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "Coding katas are a way that programmers can kick the tires of their programming languages, paradigms and practices. Conventionally anchored in a TDD cycle, katas are typically simple problems that give programmers the opportunity to exercise deliberate practice and explore different approaches, whether programming style, pair programming or test-first programming.  \n\nBut the simplicity can be deceptive, with many programmers tiring of these katas too soon, missing out on some of the more mind-bending and paradigm-expanding opportunities on offer. \n\nThis session will pick on a handful of katas and dig deeper into TDD, software craftsmanship, lambdas, language(s), (dys)functional programming and Alcubierre drive.",
        "tags": [
          {
            "id": "cjhg0cw2i12tq0152dwxweli5",
            "name": "Computer Science"
          }
        ],
        "speaker": [
          {
            "id": "cjhgjmtjn22pp0171lokyj2dw",
            "name": "Kevlin Henney ",
            "bio": "consultant · father · husband · itinerant · programmer · speaker · trainer · writer",
            "topics": []
          }
        ]
      },
      {
        "link": "dAqKa3waNx8",
        "views": 572,
        "likes": null,
        "duration": 1436,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "We encounter automation every day and may not realise. It could be a set of traffic lights, a thermostat or automated tests for our code. It all works to make our lives easier and more efficient.\n\nA couple of years ago I started working on a chat based automation system using JavaScript in my free time and in this talk I’ll share my progress, my reasons for doing it and what I’d like to do with it in the future. Hopefully I’ll inspire you to embrace automation in your daily life.",
        "tags": [
          {
            "id": "cjhg0901y12770162f0lf32t4",
            "name": "Javascript"
          },
          {
            "id": "cjhkg07z409tr018561qf5ehb",
            "name": "IOT"
          }
        ],
        "speaker": [
          {
            "id": "cjhub54w922f30122kuv79q8l",
            "name": "Luke Bonaccorsi",
            "bio": "Software Engineer at @SkyBet, JavaScripter, eater, proud beard owner, swear enthusiast. Host and organiser of @leedsjs. I automated my curtains with JS. He/him",
            "topics": [
              {
                "id": "cjhq937uq1jel0127hlu81unf",
                "topic": "JavaScript",
                "stage": "PUBLISHED"
              },
              {
                "id": "cjhq96hpc1jt10115sjmth6r8",
                "topic": "Internet of Things",
                "stage": "PUBLISHED"
              }
            ]
          }
        ]
      },
      {
        "link": "Xt5qpbiqw2g",
        "views": 122939,
        "likes": 2945,
        "duration": 1626,
        "publishedAt": "2018-07-02T16:35:46+00:00",
        "description": "Making the jump from HTML & CSS to JavaScript can be intimidating. For many JS beginners, this will be the first programming language they encounter. And if that wasn't challenging enough, there's also immense cultural pressure to live up to unrealistic standards of what it means to be a successful JS developer today.\n\nIn this talk, we'll debunk the myth of the “real JavaScript developer” - a magical creature who knows it all, writing perfect code in the hottest new framework without ever needed to stop and take a break. We'll look at simple strategies to help beginners on their journey learning JavaScript and also come up with a more realistic definition of what it means to be a successful JavaScript developer today.",
        "tags": [
          {
            "id": "cjhg0aa14127j0186n3g5jscc",
            "name": "Inspirational"
          }
        ],
        "speaker": [
          {
            "id": "cjhm5fe1e10fb0196hecq8qxf",
            "name": "Brenna O'Brien",
            "bio": "Brenna is a front-end engineer at TED, where she works with JavaScript and Ember.js to build TED’s internal tools. ",
            "topics": []
          }
        ]
      },
      {
        "link": "19gqsBc_Cx0",
        "views": 10895,
        "likes": 201,
        "duration": 2317,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "What is really the best way to style your React applications? During his presentation Max Stoiber explores the current landscape to see what the world has to offer.",
        "tags": [
          {
            "id": "cjhg0axyh13460195gookni3c",
            "name": "React"
          },
          {
            "id": "cjhg07w6912d10185umgied60",
            "name": "CSS"
          }
        ],
        "speaker": [
          {
            "id": "cjhf0u3190t5v0191yfvo5aa3",
            "name": "Max Stoiber",
            "bio": "Cofounder @withspectrum 💬Advisor @EducativeInc 👨🏼‍🏫 Makes styled-components, react-boilerplate and micro-analytics 💅 Coffee geek, skier, traveller ☕️ he/him",
            "topics": []
          }
        ]
      },
      {
        "link": "wf-BqAjZb8M",
        "views": 225845,
        "likes": 3486,
        "duration": 3125,
        "publishedAt": "2018-07-02T16:37:27+00:00",
        "description": "Distillation of knowledge gained from a decade of Python consulting, Python training, code reviews, and serving as a core developer.   Learn to avoid some of the hazards of the PEP 8 style guide and learn what really matters for creating beautiful intelligible code.",
        "tags": [
          {
            "id": "cjiaa46dt1qt80165b9wby992",
            "name": "Python"
          }
        ],
        "speaker": [
          {
            "id": "cjiaa3qgf1qk20165itzvo4gd",
            "name": "Raymond Hettinger",
            "bio": "Python core developer. Freelance programmer/consultant/trainer. Husband to Rachel. Father to Matthew.",
            "topics": [
              {
                "id": "cjhq9cb3n1my70100kpy734x7",
                "topic": "Python",
                "stage": "PUBLISHED"
              }
            ]
          }
        ]
      },
      {
        "link": "x9pxbnFC4aQ",
        "views": 11157,
        "likes": 227,
        "duration": 3603,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "The software industry is awash in folk wisdom.  The \"rule of three\" tells us that we should only create a generic implementation once we've solved a problem three times.  The Knuth quote about \"premature optimization\" either tells us that optimization is always bad, or bad 97% of the time, depending on how much of the quote we bothered to read.\n\nNone of these prescriptions describe a context in which they might not apply.  Taken literally, most are wildly misleading.  To use them properly, we must already have a nuanced understanding of software.\n\nThis talk presents a framework to intuit these same insights, but also their boundaries.  It provides concepts and vocabulary that enable the viewer to not only explain how a problem should be solved, but why.",
        "tags": [
          {
            "id": "cjhg0cw2i12tq0152dwxweli5",
            "name": "Computer Science"
          },
          {
            "id": "cjhny4bad2nqe01944npfpzit",
            "name": "Software Architecture"
          }
        ],
        "speaker": [
          {
            "id": "cjhny9w822qm501936vnvtjam",
            "name": "Zach Tellman",
            "bio": "Zach writes code and sometimes not-code. He is currently working on a tool for exploratory data processing.",
            "topics": []
          }
        ]
      },
      {
        "link": "ybNj-id0kjY",
        "views": 11444,
        "likes": 281,
        "duration": 2392,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "",
        "tags": [
          {
            "id": "cjhg09gx711vs01520uh3s6fp",
            "name": "Performance"
          },
          {
            "id": "cjhg0xzhg190d0185dj2w0irs",
            "name": "Angular"
          }
        ],
        "speaker": [
          {
            "id": "cjhubi89w2hlb0122b7am7xsz",
            "name": "Minko Gechev",
            "bio": "Former member of the Angular mobile team, codelyzer, Guess.js, @Google developer expert, author, speaker, etc. Computer science ❤️",
            "topics": [
              {
                "id": "cjhq937uq1jel0127hlu81unf",
                "topic": "JavaScript",
                "stage": "PUBLISHED"
              },
              {
                "id": "cjhq93kzt1hlq01348rhtt1zr",
                "topic": "Angular",
                "stage": "PUBLISHED"
              }
            ]
          }
        ]
      },
      {
        "link": "HWfwVtdDeZU",
        "views": 4637,
        "likes": 40,
        "duration": 2535,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "With the increasing ubiquity of screens and devices, cohesiveness is imperative to creating a successful user experience. There are countless recent examples of this. In the the version notes in an update to the Apple Store app for iOS, it stated: “Now start shopping on one device and finish on another, or even on your Mac or PC.” Another observation made by a tech news site following the redesign of Spotify announced: “Another key factor behind the design overhaul is for Spotify to feel familiar across all platforms.” There are countless other examples. This presentation examines what’s required to deliver a unified, consistent user experience, regardless of where the digital experience begins, continues and ends.",
        "tags": [
          {
            "id": "cjhg0bs8813nc0151ukoy8q12",
            "name": "UX"
          }
        ],
        "speaker": [
          {
            "id": "cjhubpzqp2sj601920huxvl58",
            "name": "Cameron Moll",
            "bio": "Founded and sold Authentic Jobs. Managing design in Silicon Valley. Author, speaker, father of 5, BYU/LDS.",
            "topics": [
              {
                "id": "cjhq9zwxq1vix0115s0ych36s",
                "topic": "UX",
                "stage": "PUBLISHED"
              }
            ]
          }
        ]
      },
      {
        "link": "wvGvJemoDHI",
        "views": 173,
        "likes": 6,
        "duration": 2331,
        "publishedAt": "2018-07-02T16:35:48+00:00",
        "description": "Accessibility is often forgotten by JavaScript developers, even in 2018; as a result, people with disabilities get left behind. Fortunately, there are techniques and tools that can help kickstart the process. In this talk, you’ll learn hands-on skills for developing inclusively with JavaScript and hard-coding accessibility into your workflow.",
        "tags": [
          {
            "id": "cjhg0qv5417gi0162qms6qvl0",
            "name": "Accessibility"
          }
        ],
        "speaker": [
          {
            "id": "cjhl6m5tb0nt90100ksrcdg5r",
            "name": "Marcy Sutton",
            "bio": "Accessible web technologies expert, @a11ySea & @GDIBellingham organizer. Mountain explorer, cyclist, music junkie, dog lover.",
            "topics": []
          }
        ]
      },
      {
        "link": "3P8McQwe1Rg",
        "views": 514,
        "likes": 18,
        "duration": 2729,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "Throughout much of this conference you're going to hear people state obvious things. Sometimes, they'll even tell you that they think what they're saying is obvious. Why are they saying them at all, then?\n\nIt's obvious there must be more to the story, so let's examine what we mean by \"obvious\". You'll leave this talk encouraged and ready to apply what you've learned to better empathize with others. Through application, you'll see growth in both your professional and personal life.",
        "tags": [
          {
            "id": "cjhg1b8nh1cls0152eqs0reeb",
            "name": "Personal"
          }
        ],
        "speaker": [
          {
            "id": "cji2xhm692i6y0184oidof05j",
            "name": "Ernie Miller",
            "bio": "Christian. Husband. Father. Programmer. Speaker. Blogger. Engineering Manager at @splice. Loves you. All opinions are your cat's. DMs open.",
            "topics": []
          }
        ]
      },
      {
        "link": "YBRiffheLXE",
        "views": 610,
        "likes": 18,
        "duration": 2080,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "On March 28, 1979 at exactly 4:00am, control rods flew into the reactor core of Three Mile Island Unit #2. A fault in the cooling system had tripped the reactor. At 4:02, the emergency cooling system automatically kicked in as reactor temperature continued to climb. At 4:04, one of the operators switched the emergency cooling system off, dooming the reactor to partial meltdown. Why?\n\nLet’s let the incredibly complex failure at Three Mile Island teach us how to dig into our own incidents. We'll learn how the ideas behind just culture can help us learn from our mistakes and build stronger teams.",
        "tags": [],
        "speaker": [
          {
            "id": "cjhg0sacn17fk0185g6i7kd0n",
            "name": "Nickolas Means",
            "bio": "Storyteller, empathetic leader, student of disasters, builder of distributed teams. Unabashed #avgeek. VP of Engineering at @MuveHealth.",
            "topics": []
          }
        ]
      },
      {
        "link": "lKxOL-2y8c8",
        "views": 195,
        "likes": 1,
        "duration": 2799,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "In 2012, I got a job at one of the best Drupal agencies in the world as Director of Marketing. I was on top of the world, raising brand awareness, generating leads with dream clients, and getting some much deserved awards for the company.\n\nBut when you work for a company with a talented engineering team and a strong maker culture, it makes you want to make things too.\n\nIn 2015, I found myself quitting my dream marketing job at a great company in order to pursue a career in software engineering. The transition to full time programming took less than 5 months, and now, 3 years later, I'm happier with my career than I've ever been.\n\nIf you have always been interested in transitioning into a programming career, but don't know how, this talk is for you!\n\nIf you have thought maybe you want to code, but you're not sure if you can do it, this talk is for you!\n\nIn this talk, I will talk about how I transitioned from marketing into full time programming, and cover the following topics:\n\nHow do you know that programming is right for you?\nAre coding bootcamps really worth the money?\nWhat did you learn at a coding bootcamp? \nWhat are alternatives to coding bootcamps?\nHow do I get my first job as a developer?",
        "tags": [
          {
            "id": "cjhg1b8nh1cls0152eqs0reeb",
            "name": "Personal"
          },
          {
            "id": "cjhg0aa14127j0186n3g5jscc",
            "name": "Inspirational"
          }
        ],
        "speaker": [
          {
            "id": "cjihgsl4r1q5201174jtusq08",
            "name": "Cecy Correa",
            "bio": "#Latinx technologist. Former @girldevelopit ATX chapter leader. Organizer @austinonrails. Taco enthusiast. Pro-wrestling fan.🤘 Pronouns: she / her.",
            "topics": []
          }
        ]
      },
      {
        "link": "Pg3UeB-5FdA",
        "views": 53426,
        "likes": 934,
        "duration": 2948,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "What's in a programming paradigm? How did the major paradigms come to be, and why? Once we've sworn our love to one paradigm, does a program written under any other still smell as sweet? Can functional programmers learn anything from the object-oriented paradigm, or vice versa?",
        "tags": [
          {
            "id": "cjihg27yx1hg801036be1htne",
            "name": "Object-Oriented Programming"
          },
          {
            "id": "cjhqht9jl1qhw0157r3cg6f1z",
            "name": "Functional Programming"
          }
        ],
        "speaker": [
          {
            "id": "cjhgdjrmh00li01905s2xuq1c",
            "name": "Anjana Vakil",
            "bio": "Wanderer and wonderer. Engineering + Learning at @Mapbox. @Mozilla TechSpeaker. Alumna of @Outreachy, @RecurseCenter, @Uni_Saarland, & @UCBerkeley.",
            "topics": []
          }
        ]
      },
      {
        "link": "FKTxC9pl-WM",
        "views": 270437,
        "likes": 5600,
        "duration": 1380,
        "publishedAt": "2019-01-20T20:36:25+00:00",
        "description": "",
        "tags": [
          {
            "id": "cjhg0bcw9138q01016huz9ayo",
            "name": "Story"
          },
          {
            "id": "cjhg0aa14127j0186n3g5jscc",
            "name": "Inspirational"
          }
        ],
        "speaker": [
          {
            "id": "cjr5d2kow16le0108drsf4l3a",
            "name": "Kathy Sierra",
            "bio": "Kathy Sierra is an American programming instructor and game developer",
            "topics": []
          }
        ]
      },
      {
        "link": "zi0w7J7MCrk",
        "views": 4767,
        "likes": 90,
        "duration": 1542,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "This presentation explains the various ways in which JavaScript relies on Unicode, what the consequences are for JavaScript developers, and how ECMAScript 6 will make our lives a bit easier in this regard.\n\nFirst off, the basics of Unicode are explained. Once that’s out of the way, I’ll talk a little bit about different character encodings, only to determine the character encoding that JavaScript uses internally.\n\nThen we’ll explore the various consequences of JavaScript exposing “characters” according to UCS-2/UTF-16, and I’ll explain why it can be problematic.\n\nFinally, I’ll present robust ECMAScript 5-compatible workarounds to the issues encountered, and explain how ECMAScript 6 will make it easier to support full Unicode in JavaScript strings and regular expressions.",
        "tags": [
          {
            "id": "cjhg0901y12770162f0lf32t4",
            "name": "Javascript"
          }
        ],
        "speaker": [
          {
            "id": "cjhnwpd8d23uh0176vuf51s21",
            "name": "Mathias Bynens",
            "bio": "I work on @v8js at Google and on ECMAScript through TC39. ♥ JavaScript, HTML, CSS, HTTP, performance, security, Bash, Unicode, i18n, macOS.",
            "topics": []
          }
        ]
      },
      {
        "link": "sZg3DoTfHLQ",
        "views": 1320,
        "likes": 40,
        "duration": 1658,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "What if your components' state was deterministic?\nLearn about implementation of State Machines to manage React Components' state - from the basics of the Automata theory to autogenerated tests.",
        "tags": [
          {
            "id": "cjhg0axyh13460195gookni3c",
            "name": "React"
          }
        ],
        "speaker": [
          {
            "id": "cjhnwe6ry1z4u01946iwuyzml",
            "name": "Michele Bertoli",
            "bio": "Front End Engineer at @facebook. Undefined is not a function. Follow me!",
            "topics": []
          }
        ]
      },
      {
        "link": "t7WraVE8rY8",
        "views": 243,
        "likes": 11,
        "duration": 1496,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "August 30, 2016, was by all accounts an average Tuesday, and release number 523 just a simple re-factor, but something went horribly wrong that day: bad code escaped from the office, and it quickly spread to infect tens of thousands, giving rise to a hoard of zombie ServiceWorkers!\n\nThis is a disaster about a typo. This is a thriller about technology out of control. This is a tragedy about wasted CPU cycles. This is a cautionary tale about living in the age of ServiceWorker.",
        "tags": [
          {
            "id": "cjhg0901y12770162f0lf32t4",
            "name": "Javascript"
          }
        ],
        "speaker": [
          {
            "id": "cjhoifgmf0k9301425pqkixu9",
            "name": "Alexander Pope",
            "bio": "Regardless of what Google might think, Alexander Pope does *not* write poetry; he mostly writes JavaScript and pushes pixels around. Originally of Canadian extraction, Alexander now works and lives in the wilds of Norway (Oslo).",
            "topics": []
          }
        ]
      },
      {
        "link": "gcij93d9st8",
        "views": 811,
        "likes": 14,
        "duration": 1035,
        "publishedAt": "2019-01-20T20:31:35+00:00",
        "description": "While there are a lot of machine learning frameworks and libraries available, putting the models in production at large scale is still a challenge. Sahil would like to talk about how they took on the challenge of deploying deep learning models in production: how they chose their tools and developed their internal deep learning infrastructure using Kubernetes. He will cover how they do model training in Docker containers, distributed TensorFlow training in a cluster of containers, automated re-training of models and finally, the deployment of models to serve predictions. At the large scale which they operate on, nothing comes easy. He will also talk about how they optimize their model predictions infrastructure for latency or throughput depending on the use case.",
        "tags": [
          {
            "id": "cjhg0pta1179f0195fxd1owas",
            "name": "Machine Learning"
          },
          {
            "id": "cjhuaanhf1n3u0122bx4s2mpz",
            "name": "Kubernetes"
          }
        ],
        "speaker": [
          {
            "id": "cjr5cwpow15kc0108zpy18p8x",
            "name": "Sahil Dua",
            "bio": "\nGit contributor. Tech Speaker. Currently @BookingCom. Open Source Contributor. http://github.com/sahildua2305 ",
            "topics": []
          }
        ]
      },
      {
        "link": "Z2d9rw9RwyE",
        "views": 1209,
        "likes": 33,
        "duration": 1777,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "\nThis talk explores various ways that we, as front-end developers, can make our products more delightful to use. While it’s design’s job to give us static mock-ups, it’s our job to bring those designs to life.",
        "tags": [
          {
            "id": "cjhg0axyh13460195gookni3c",
            "name": "React"
          },
          {
            "id": "cjhg0901y12770162f0lf32t4",
            "name": "Javascript"
          }
        ],
        "speaker": [
          {
            "id": "cjhnylvlt2vfv0176ufohear6",
            "name": "Josh Comeau",
            "bio": "Software developer @khanacademy. Previously @unsplash, @breather. React.js and Redux. Perpetual tinkerer. Pianist. Cat person. He/Him. Gay 🌈",
            "topics": []
          }
        ]
      },
      {
        "link": "CTTL5_G2U9U",
        "views": 706,
        "likes": 25,
        "duration": 1800,
        "publishedAt": "2018-08-22T15:35:29+00:00",
        "description": "The case for Progressive Web\n\nThe mobile web is slow and we've become accustomed to developing large and complex applications with powerful desktop and laptop machines. 73% of mobile internet users say that they’ve encountered a website that was too slow to load. The world of front end development is evolving continuously with more client-side heavy applications and with this, bundle sizes for many JS frameworks can be huge. This can significantly affect loading times, especially on a mobile device with a poor connection.\n\nPRPL Pattern\n\nThis talk will cover the concept behind the PRPL pattern, what it is and how you can use it to build a fast and reliable progressive single-page application.\n\nWe’ll talk about how you can:\n\n* Push the most important resources first\n* Render your initial route as soon as possible\n* Pre-cache resources for all your routes using a Service Worker\n* Lazy load your remaining routes so that they load on demand",
        "tags": [
          {
            "id": "cjhg09gx711vs01520uh3s6fp",
            "name": "Performance"
          },
          {
            "id": "cjhg0901y12770162f0lf32t4",
            "name": "Javascript"
          }
        ],
        "speaker": []
      },
      {
        "link": "_0T5OSSzxms",
        "views": 16232,
        "likes": 315,
        "duration": 2207,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "",
        "tags": [
          {
            "id": "cjhl5zs3t0f1j0113zfbex25m",
            "name": "ReasonML"
          },
          {
            "id": "cjhg0901y12770162f0lf32t4",
            "name": "Javascript"
          }
        ],
        "speaker": [
          {
            "id": "cjhf5gwdx297p0157vky86omg",
            "name": "Cheng Lou",
            "bio": "I work on Reason and Facebook Messenger",
            "topics": []
          }
        ]
      },
      {
        "link": "24S5u_4gx7w",
        "views": 4164,
        "likes": 67,
        "duration": 2167,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "What's in a language? How can it help us express our intent better? Based on his last talk, Cheng will explore some concrete, daily patterns in our codebase that Reason elegantly solves through a few simple yet rich concepts.",
        "tags": [
          {
            "id": "cjhg0901y12770162f0lf32t4",
            "name": "Javascript"
          },
          {
            "id": "cjhl5zs3t0f1j0113zfbex25m",
            "name": "ReasonML"
          }
        ],
        "speaker": [
          {
            "id": "cjhf5gwdx297p0157vky86omg",
            "name": "Cheng Lou",
            "bio": "I work on Reason and Facebook Messenger",
            "topics": []
          }
        ]
      },
      {
        "link": "9YkUCxvaLEk",
        "views": 20205,
        "likes": 760,
        "duration": 952,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "Flow Control in JavaScript is hard! Native Promises in JavaScript have helped immensely, but the syntax is still a little callback-y. With Async + Await, we can write synchronous looking code without losing any of the benefits of JavaScript's asynchronous nature.\n\nWes explores how async + await works, best practices for flow control, and explores several solutions for handling errors.",
        "tags": [
          {
            "id": "cjhg0901y12770162f0lf32t4",
            "name": "Javascript"
          },
          {
            "id": "cjhomlu6c264w0193ewmewr3o",
            "name": "Async+Await"
          }
        ],
        "speaker": [
          {
            "id": "cjhomk4fp21yz0169n7aa3ap3",
            "name": "Wes Bos",
            "bio": "Fullstack Dev ❯ JS⚛ CSS Node ❯ https://ES6.io  ❯ https://LearnNode.com  ❯ http://ReactForBeginners.com  ❯ http://JavaScript30.com  ❯ 🔥 Tips ❯ ♥@KaitBos ❯ @SyntaxFM",
            "topics": []
          }
        ]
      },
      {
        "link": "OGABsubI6PA",
        "views": 810,
        "likes": 21,
        "duration": 676,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "I want to show you that the unexpected JavaScript things you encountered are understandable by humans and formally specified.",
        "tags": [
          {
            "id": "cjhg0901y12770162f0lf32t4",
            "name": "Javascript"
          },
          {
            "id": "cjhg0e2ns13wl0101195y0r2o",
            "name": "Funny"
          }
        ],
        "speaker": [
          {
            "id": "cjhpf1el939sz0175uh910fyp",
            "name": "Sven Sauleau",
            "bio": "#JavaScript at @babeljs - #FP #DistributedSystems #concurrency #compilers and #Vim master",
            "topics": [
              {
                "id": "cjhq9ny3x1rz40158akm07v1a",
                "topic": "Babel",
                "stage": "PUBLISHED"
              },
              {
                "id": "cjhqacp3b20ft0115yrbi3yj5",
                "topic": "Web Assembly",
                "stage": "PUBLISHED"
              },
              {
                "id": "cjhq937uq1jel0127hlu81unf",
                "topic": "JavaScript",
                "stage": "PUBLISHED"
              }
            ]
          }
        ]
      },
      {
        "link": "NYnI7-xWH-I",
        "views": 385,
        "likes": 9,
        "duration": 1191,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "Every day, we get 1 day closer to integrating WebAssembly into webpack as a first class citizen. But what does this mean and why should you care? Sean reveals how webpack works under the hood.\n\nLearn about its limitations and constraints, and how they are unlocking those constraints to make WebAssembly a pure and enjoyable experience.\n\nLearn also how you can apply these concepts to your every day programming and walk away feeling excited about the future of webpack and WebAssembly.",
        "tags": [
          {
            "id": "cjhg0901y12770162f0lf32t4",
            "name": "Javascript"
          },
          {
            "id": "cjhoy8ih3019r01846v9s61ss",
            "name": "Webpack"
          },
          {
            "id": "cjhl68vnh0ilh0100b5zr4njq",
            "name": "WebAssembly"
          }
        ],
        "speaker": [
          {
            "id": "cjhoy7lyl00rd0101lg2cum6u",
            "name": "Sean Thomas",
            "bio": "Speaker, engineer, @webpack Core Team, Developer Advocate, Lutheran. Views are my own. TPM @Microsoft @EdgeDevTools. Chronic Typos. Always bet on #JavaScript",
            "topics": []
          }
        ]
      },
      {
        "link": "X77LnVnfbJk",
        "views": 520,
        "likes": 13,
        "duration": 679,
        "publishedAt": "2018-07-05T15:43:57+00:00",
        "description": "I would talk about some myths on Jest & Enzyme. Moreover to stop the comparison of Jest and Enzyme. Instead would focus on how they can work together to test well your React Components. The talk would focus on \"How Jest and Enzyme complement each other\" and can help you test React components in a better way.",
        "tags": [
          {
            "id": "cjhg0axyh13460195gookni3c",
            "name": "React"
          },
          {
            "id": "cjhg0d5vw13cx0162h18nt4yv",
            "name": "Testing"
          }
        ],
        "speaker": [
          {
            "id": "cjj8q01iv0f3n01301vnpcb1r",
            "name": "Manjula Dube",
            "bio": "Dev @MarleySpoonDE, No longer scared of @ken_wheeler now. ex @bookmyshow OSS @geekabyte_info @prisma. Talk to me about Web,Perf,React,JS.",
            "topics": []
          }
        ]
      },
      {
        "link": "sj4lwJLPGbQ",
        "views": 75,
        "likes": 5,
        "duration": 1483,
        "publishedAt": "2018-07-05T15:41:17+00:00",
        "description": "",
        "tags": [
          {
            "id": "cjhpzpbie15hq012980yctj1e",
            "name": "Serverless"
          }
        ],
        "speaker": [
          {
            "id": "cjhl63q350gjw0139plzpt0fk",
            "name": "Marcel Cutts",
            "bio": "Standard human meat bag. Founder of http://Asgard.tech  | Organiser of @ReasonLDN | Cyberpunk enthusiast",
            "topics": []
          }
        ]
      },
      {
        "link": "tzfHlEFd2Fk",
        "views": 682,
        "likes": 16,
        "duration": 2361,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "Concatenating, minifying, compressing, caching: all serviceable ways to improve the performance of web interfaces. But none are as effective as not coding something in the first place. Code that don't exist is infinitely performant and extremely easy to maintain and document. This talk will identify some examples of front-end code that are either not needed at all, make the interface worse just by being there, or can be replaced by something much, much simpler. Say hello to unprogressive non-enhancement.",
        "tags": [
          {
            "id": "cjhg0bs8813nc0151ukoy8q12",
            "name": "UX"
          },
          {
            "id": "cjhg0qv5417gi0162qms6qvl0",
            "name": "Accessibility"
          }
        ],
        "speaker": [
          {
            "id": "cji2phngc2xz801712vxo094z",
            "name": "Heydon Pickering",
            "bio": "Inclusive designer, writer, speaker. Helping good ideas become more accessible.",
            "topics": [
              {
                "id": "cjhq9iop01q380100z1k8xi0f",
                "topic": "Accessibility",
                "stage": "PUBLISHED"
              }
            ]
          }
        ]
      },
      {
        "link": "ZZmUwXEiPm4",
        "views": 11796,
        "likes": 310,
        "duration": 1736,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "Over the last years a modular approach to programming in JS gained a huge following and with the advent of virtual DOM building isomorphic JavaScript application for the web became dramatically more approachable; yet, we are still largely deploying monolithic application blobs that know how to render the settings page of our single page apps before accepting user input on the homepage.\n\nMy talk will explore 2 primary themes:\n\nHow to build highly sophisticated web apps that load a constant amount of JS to make the first page the user sees interactive; where constant means, even if you have 100s of engineers write code for your app for a year, the size will still be the same.\nHow to throughout the lifecycle of your application never load a single line of JS that is not currently needed.\nAs part of this exploration I will introduce 3 novel concepts: lazy decoration, asynchronous dependency injection and reverse dependencies in module systems.",
        "tags": [
          {
            "id": "cjhg0901y12770162f0lf32t4",
            "name": "Javascript"
          }
        ],
        "speaker": [
          {
            "id": "cji4pnxgv0sc70168o4sea3v9",
            "name": "Malte Ubl",
            "bio": "Tech lead of the AMP Project. JavaScript infrastructure at Google. Curator of @JSConfEU",
            "topics": [
              {
                "id": "cjhq937uq1jel0127hlu81unf",
                "topic": "JavaScript",
                "stage": "PUBLISHED"
              }
            ]
          }
        ]
      },
      {
        "link": "LRKlqR6KY_E",
        "views": 617,
        "likes": 18,
        "duration": 1978,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "Abstract Syntax Trees, AST for short are a very less talked about subject in the world of Javascript. But surprisingly, almost all of the common tooling used by modern front end developers, from linting, minifying, babel-transforming, uglifying, webpacking depend heavily on the AST for reliable and standardised transformations. Learning how to use an AST is much simpler than I imagined. Here's about why ASTs are so ubiquitous and how you can make use of it to enhance your daily workflow.",
        "tags": [
          {
            "id": "cjhg0901y12770162f0lf32t4",
            "name": "Javascript"
          }
        ],
        "speaker": [
          {
            "id": "cjhwhzazl3kke0185gfwjap4e",
            "name": "Pavithra Kodmad",
            "bio": "UI Engineer @Atlassian, Ex-Flipkart, Serial Javascripter, Certified Cat Whisperer, Gooner, OSS Newbie, Personal opinions. @blrjavascript Married to @rahulcs",
            "topics": [
              {
                "id": "cjhq937uq1jel0127hlu81unf",
                "topic": "JavaScript",
                "stage": "PUBLISHED"
              }
            ]
          }
        ]
      },
      {
        "link": "bovBQtB_PDo",
        "views": 2282,
        "likes": 100,
        "duration": 2150,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "",
        "tags": [
          {
            "id": "cjhg1b8nh1cls0152eqs0reeb",
            "name": "Personal"
          },
          {
            "id": "cjhg0bcw9138q01016huz9ayo",
            "name": "Story"
          }
        ],
        "speaker": [
          {
            "id": "cjhubtccn2vd70191kcxou6ue",
            "name": "Sara Vieira",
            "bio": "International agent of JS Bullshit 🚀 Works for @YLDio ",
            "topics": [
              {
                "id": "cjhq93bxy1ibq01208pxi4tba",
                "topic": "React",
                "stage": "PUBLISHED"
              },
              {
                "id": "cjhq95byp1k6t01005z1blzsr",
                "topic": "CSS",
                "stage": "PUBLISHED"
              },
              {
                "id": "cjhq9bbog1kmz0134ei9hj0nm",
                "topic": "CSS in JS",
                "stage": "PUBLISHED"
              },
              {
                "id": "cjhq9hurf1oq30115vvf1gkp6",
                "topic": "GraphQL",
                "stage": "PUBLISHED"
              },
              {
                "id": "cjhqaaf0c1yl40134u0r1qaj5",
                "topic": "Preact",
                "stage": "PUBLISHED"
              }
            ]
          }
        ]
      },
      {
        "link": "-J8YyfrSwTk",
        "views": 4732,
        "likes": null,
        "duration": 4165,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "A talk given at Harvard's CS51 class in 2010 (which is taught in OCaml), with a collection of suggestions about how to be an effective ML programmer in an industrial setting",
        "tags": [
          {
            "id": "cjhu9ohfy1epx0194fhgxfd3p",
            "name": "OCaml"
          }
        ],
        "speaker": [
          {
            "id": "cjhu9wqo21ibo0194uu2d5k76",
            "name": "Yaron Minsky",
            "bio": "Occasional OCaml programmer",
            "topics": [
              {
                "id": "cjhu9v9sa1gh80126seo2y5d3",
                "topic": "OCaml",
                "stage": "PUBLISHED"
              }
            ]
          }
        ]
      },
      {
        "link": "jJFuAce9mZU",
        "views": 4080,
        "likes": 64,
        "duration": 3031,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "Alex Qin tells the true story of her physical transformation, and the surprising and drastic ways in which it affected how she was perceived and treated as a programmer. She also covers the effects of unconscious bias, micro-aggressions, and stereotype threat within our community, and how to make engineering teams and our entire field more inclusive to all, and thusly more successful.",
        "tags": [
          {
            "id": "cjhg0pta1179f0195fxd1owas",
            "name": "Machine Learning"
          },
          {
            "id": "cjhg1m06y1fdk01015q4q7wi8",
            "name": "Society"
          }
        ],
        "speaker": [
          {
            "id": "cjhx66wse1wbi0112ipgo1wkj",
            "name": "Alex Qin",
            "bio": "programmer, educator, public speaker | founder @codecooperative | director of technology (link: http://gakko.org) gakko.org | teaching everyone to build #radicalTechnology",
            "topics": []
          }
        ]
      },
      {
        "link": "-tDy7ds0dag",
        "views": 3472,
        "likes": 80,
        "duration": 1507,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "Forms in React can be verbose, repetitive, and messy.  Managing the state of values, errors, and touched can make matters even worse.  Formik adds a level of organization to your forms that allows for easier implementation, integrated validation, and a consistent interface to add third party components.  Formik also makes it easy to abstract common form behavior into primitives that you can share and compose throughout your application. Watch as Jared Palmer walks us through some common form problems and the solutions that Formik provides.",
        "tags": [
          {
            "id": "cjhg0axyh13460195gookni3c",
            "name": "React"
          }
        ],
        "speaker": [
          {
            "id": "cjhwgtog4315p01013b0ypseu",
            "name": "Jared Palmer",
            "bio": "Engineering Lead at The Palmer Group • Speaker • Open Source Samurai • Creator of Formik, Razzle, Backpack, After.js, react-fns",
            "topics": [
              {
                "id": "cjhq937uq1jel0127hlu81unf",
                "topic": "JavaScript",
                "stage": "PUBLISHED"
              },
              {
                "id": "cjhq93bxy1ibq01208pxi4tba",
                "topic": "React",
                "stage": "PUBLISHED"
              },
              {
                "id": "cjhqadv3820lt0120qd0t7oaq",
                "topic": "Forms",
                "stage": "PUBLISHED"
              }
            ]
          }
        ]
      },
      {
        "link": "2Vhy5188Msc",
        "views": 1482,
        "likes": 41,
        "duration": 1279,
        "publishedAt": "2018-07-02T16:35:48+00:00",
        "description": "Universal React applications are tough to configure. Either you buy into a framework like Next.js, fork a boilerplate, or set things up yourself. Aiming to fill this void, Razzle is a tool that abstracts all the complex configuration needed for SSR into a single dependency--giving you the developer experience of create-react-app, but then leaving the rest of your app's architectural decisions about frameworks, routing, and data fetching up to you. With this approach, Razzle not only works with React, but also Reason, Elm, Vue, Angular, and most importantly... whatever comes next.",
        "tags": [
          {
            "id": "cjhg0axyh13460195gookni3c",
            "name": "React"
          }
        ],
        "speaker": [
          {
            "id": "cjhwgtog4315p01013b0ypseu",
            "name": "Jared Palmer",
            "bio": "Engineering Lead at The Palmer Group • Speaker • Open Source Samurai • Creator of Formik, Razzle, Backpack, After.js, react-fns",
            "topics": [
              {
                "id": "cjhq937uq1jel0127hlu81unf",
                "topic": "JavaScript",
                "stage": "PUBLISHED"
              },
              {
                "id": "cjhq93bxy1ibq01208pxi4tba",
                "topic": "React",
                "stage": "PUBLISHED"
              },
              {
                "id": "cjhqadv3820lt0120qd0t7oaq",
                "topic": "Forms",
                "stage": "PUBLISHED"
              }
            ]
          }
        ]
      },
      {
        "link": "VU1NKX6Qkxc",
        "views": 12677,
        "likes": 428,
        "duration": 1533,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "",
        "tags": [
          {
            "id": "cjhg0axyh13460195gookni3c",
            "name": "React"
          },
          {
            "id": "cjhg0901y12770162f0lf32t4",
            "name": "Javascript"
          }
        ],
        "speaker": [
          {
            "id": "cjhv3ej7d62hu016546q95zsi",
            "name": "David Khourshid",
            "bio": "Pianist and Web Developer, with a passion for CSS and JavaScript. VS Live Share team @Microsoft. 1/2 of @keyframers 🎥",
            "topics": []
          }
        ]
      },
      {
        "link": "T9-Mb_axNgA",
        "views": 1280,
        "likes": 24,
        "duration": 1688,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "",
        "tags": [
          {
            "id": "cjhg0axyh13460195gookni3c",
            "name": "React"
          }
        ],
        "speaker": [
          {
            "id": "cjhwg95o72ihy0119oyne1h2z",
            "name": "Michael Chan",
            "bio": "Clumsy Jesus follower. Awkward friend. Mediocre web developer. JavaScript teacher http://learnreact.com . 💌 http://eepurl.com/8uOb9 ",
            "topics": [
              {
                "id": "cjhq93bxy1ibq01208pxi4tba",
                "topic": "React",
                "stage": "PUBLISHED"
              }
            ]
          }
        ]
      },
      {
        "link": "XpDsk374LDE",
        "views": 14733,
        "likes": 374,
        "duration": 2821,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "",
        "tags": [
          {
            "id": "cjhg0cf3q131c0162lhpxv7uw",
            "name": "Elm"
          }
        ],
        "speaker": [
          {
            "id": "cjhwgh49n2pfu0165dr6dyxms",
            "name": "Evan Czaplicki",
            "bio": "Designer/developer of @elmlang. Working at @NoRedInk.",
            "topics": [
              {
                "id": "cjhq9ltw31qev0162y0g66h9k",
                "topic": "Elm",
                "stage": "PUBLISHED"
              }
            ]
          }
        ]
      },
      {
        "link": "PBpugV5l90c",
        "views": 685,
        "likes": 19,
        "duration": 1600,
        "publishedAt": "2018-07-02T16:35:46+00:00",
        "description": "This talk will focus on the creative exploitation of React component architecture to render not only to DOM elements, but other targets as well, at the same time. We will explore techniques you can use to achieve this, common pitfalls, useful applications of these patterns and not so useful, but wildly entertaining applications of these patterns.",
        "tags": [
          {
            "id": "cjhg0axyh13460195gookni3c",
            "name": "React"
          }
        ],
        "speaker": [
          {
            "id": "cjhg27phg1juj0186cm5aj5mh",
            "name": "Ken Wheeler",
            "bio": "Director of OSS @FormidableLabs • Google Developer Expert • Dad • @baconbrix's Dad • All opinions are the opinions of Miller Lite • @toddmotto fan",
            "topics": []
          }
        ]
      },
      {
        "link": "uXPIryLyIm0",
        "views": 286,
        "likes": 13,
        "duration": 1084,
        "publishedAt": "2018-07-05T15:50:03+00:00",
        "description": "",
        "tags": [
          {
            "id": "cjhg0axyh13460195gookni3c",
            "name": "React"
          },
          {
            "id": "cjhg0901y12770162f0lf32t4",
            "name": "Javascript"
          },
          {
            "id": "cjhlsxy4o2srq0138tme9d6is",
            "name": "GraphQL"
          }
        ],
        "speaker": [
          {
            "id": "cjhubtccn2vd70191kcxou6ue",
            "name": "Sara Vieira",
            "bio": "International agent of JS Bullshit 🚀 Works for @YLDio ",
            "topics": [
              {
                "id": "cjhq93bxy1ibq01208pxi4tba",
                "topic": "React",
                "stage": "PUBLISHED"
              },
              {
                "id": "cjhq95byp1k6t01005z1blzsr",
                "topic": "CSS",
                "stage": "PUBLISHED"
              },
              {
                "id": "cjhq9bbog1kmz0134ei9hj0nm",
                "topic": "CSS in JS",
                "stage": "PUBLISHED"
              },
              {
                "id": "cjhq9hurf1oq30115vvf1gkp6",
                "topic": "GraphQL",
                "stage": "PUBLISHED"
              },
              {
                "id": "cjhqaaf0c1yl40134u0r1qaj5",
                "topic": "Preact",
                "stage": "PUBLISHED"
              }
            ]
          }
        ]
      },
      {
        "link": "A6FPWsPdfuc",
        "views": 1628,
        "likes": 39,
        "duration": 1825,
        "publishedAt": "2018-07-02T16:35:50+00:00",
        "description": "",
        "tags": [],
        "speaker": [
          {
            "id": "cjhxx02mg2gfi0196m0wb6uv0",
            "name": "Eduardo San Martin Morote",
            "bio": "Former indie game dev, now I do web – I  ❤️ building stuff – @vuejs core team – Organiser of @vuejsparis – Freelance, Speaker 🇪🇸🇫🇷🇬🇧",
            "topics": [
              {
                "id": "cjhq93fl01jnc0158xaqhh1r6",
                "topic": "Vue",
                "stage": "PUBLISHED"
              }
            ]
          }
        ]
      },
      {
        "link": "TOFVFxI2dvU",
        "views": 992,
        "likes": 38,
        "duration": 1667,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "",
        "tags": [],
        "speaker": [
          {
            "id": "cjhf0j2tb0q9f0199bmd7q3ns",
            "name": "Ives van Hoorne",
            "bio": "Creator of https://codesandbox.io , software developer at @Catawiki and CompSci student at @utwenteEN. I like cookies 🍪",
            "topics": []
          }
        ]
      },
      {
        "link": "l22DgeQux20",
        "views": 599,
        "likes": 25,
        "duration": 1534,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "As a Vue consultant and member of the core team, Chris will share some of the lesser-known features and patterns you can use to improve your apps and amaze your colleagues.",
        "tags": [],
        "speaker": [
          {
            "id": "cjhxxc4xm2mhg0198xe4bhaeg",
            "name": "Chris Fritz",
            "bio": "Educator/engineer hybrid. @vuejs core team member and curator of our docs. You can support my open source work at http://patreon.com/chrisvuefritz . 🙏🏻",
            "topics": [
              {
                "id": "cjhq93fl01jnc0158xaqhh1r6",
                "topic": "Vue",
                "stage": "PUBLISHED"
              }
            ]
          }
        ]
      },
      {
        "link": "LLnVLjpY6gE",
        "views": 9293,
        "likes": 247,
        "duration": 1914,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "",
        "tags": [],
        "speaker": [
          {
            "id": "cjheuebbh1c0h0171i0wie5x0",
            "name": "Sarah Drasner",
            "bio": "Sarah Drasner is an award-winning Speaker, Head of Developer Experience at Netlify, Vue core team member, and Staff Writer at CSS-Tricks. Sarah is formerly Principal Lead of Emerging Markets, Cloud Advocates at Microsoft and Manager of UX & Engineering at Trulia/Zillow Group. She’s the author of SVG Animations from O’Reilly and has given Frontend Masters workshops. Sarah is a co-organizer of ConcatenateConf, a free conference for Nigerian and Kenyan developers\n\n",
            "topics": []
          }
        ]
      },
      {
        "link": "KrL8BBbxmfk",
        "views": 17,
        "likes": 0,
        "duration": 1903,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "When we build web products today we’re increasingly moving away from siloed roles. We’re breaking down the distinctions between various prefixes of designers & developers in favour of being multi-skilled generalists. Rather than having an awkward mix of disparate skills, though, generalist make-all-the-startup-things-y hackers are the inevitable foundation of the product teams of the future.\n\n\"The Bauhaus strives to combine all the arts—sculpture, painting, applied art & visual art—as the inseparable components of a new architecture\" — 90 years later, I think we're finally achieving the vision of the Bauhaus.",
        "tags": [
          {
            "id": "cjhg0aa14127j0186n3g5jscc",
            "name": "Inspirational"
          },
          {
            "id": "cjhg0bwrj13o30151u7hi4mhv",
            "name": "Design"
          }
        ],
        "speaker": [
          {
            "id": "cjihhmmwp227l0169h2ih5ept",
            "name": "Jon Gold",
            "bio": "what I talk about when I talk about liberation for all beings · musician, entheo-technologist",
            "topics": []
          }
        ]
      },
      {
        "link": "gb2gXX7xiAM",
        "views": 424,
        "likes": 6,
        "duration": 1792,
        "publishedAt": "2018-07-05T15:48:16+00:00",
        "description": "React v16.0 comes with some major changes and an update to the core algorithm. With React v16.0 Facebook has completely revised the internals of React while keeping the public API essentially the same.\nLearn about what’s new in React 16 which would include a brief explanation of the new algorithm along with focus on few of the new features like Error Boundaries, Portals, Fragments and SSR with React 16.",
        "tags": [
          {
            "id": "cjhg0axyh13460195gookni3c",
            "name": "React"
          }
        ],
        "speaker": [
          {
            "id": "cjj8q01iv0f3n01301vnpcb1r",
            "name": "Manjula Dube",
            "bio": "Dev @MarleySpoonDE, No longer scared of @ken_wheeler now. ex @bookmyshow OSS @geekabyte_info @prisma. Talk to me about Web,Perf,React,JS.",
            "topics": []
          }
        ]
      },
      {
        "link": "gVNekDsgUqU",
        "views": 492,
        "likes": 16,
        "duration": 2242,
        "publishedAt": "2018-07-02T16:35:48+00:00",
        "description": "Vue Single File Component is ideal for sketching out UI components, animation, interaction prototypes and data visualization. I present a mini Vue SFC based framework that prescribes setup, languages and coding styles in exchange for the best prototyping experience.\n",
        "tags": [],
        "speaker": [
          {
            "id": "cji0df8t7487t0172bgtobbgt",
            "name": "Pine Wu",
            "bio": "Vivi Vivace I Vizi e le Virtu.",
            "topics": [
              {
                "id": "cjhq93fl01jnc0158xaqhh1r6",
                "topic": "Vue",
                "stage": "PUBLISHED"
              }
            ]
          }
        ]
      },
      {
        "link": "r4pNEdIt_l4",
        "views": 8188,
        "likes": 198,
        "duration": 1126,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "With today’s modern JavaScript frameworks, we are used to the fact that when the application state changes, the DOM is updated automatically. But how do the frameworks detect state changes, and how do they efficiently propagate the changes through the system? Evan answers these questions based on his experience building Vue.js.",
        "tags": [],
        "speaker": [
          {
            "id": "cji622t0v3etz0134xicwv0to",
            "name": "Evan You",
            "bio": "Design, code & things in between. Full-time open source. Creator @vuejs, previously @meteorjs & @google, @parsonsamt alumnus",
            "topics": []
          }
        ]
      },
      {
        "link": "OF3A_arLJ8k",
        "views": 475,
        "likes": 12,
        "duration": 1628,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "Writing a Universal Application with Vue might be hard, this talk will show common problems with server-side rendering and how to deal with them. It will also show how Nuxt.js solves most of these problems for you.",
        "tags": [],
        "speaker": [
          {
            "id": "cji0doi2t4dk50152vxqo7x8v",
            "name": "Sebastien Chopin",
            "bio": "Author of @nuxt_js & @_monojs • Community partner of @vuejs • Working on @cmty_app",
            "topics": [
              {
                "id": "cjhq93fl01jnc0158xaqhh1r6",
                "topic": "Vue",
                "stage": "PUBLISHED"
              },
              {
                "id": "cjhqa3k8e1xka0162qt8i2v8o",
                "topic": "Universal Javascript",
                "stage": "PUBLISHED"
              }
            ]
          }
        ]
      },
      {
        "link": "NAimzL6XXAY",
        "views": 2306,
        "likes": 51,
        "duration": 1263,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "",
        "tags": [
          {
            "id": "cji0dp8or00dk01877vcx73a5",
            "name": "NativeScript"
          }
        ],
        "speaker": [
          {
            "id": "cji0drfil01p10142uq7uikaj",
            "name": "Jen Looper",
            "bio": " Web & Mobile developer, Sr. DevRel @ ProgressSW. GDE Multilingual multiculturist. Woke GenX Green Mom. NativeScript/Angular/Vue/ML. Founder http://VueVixens.org ",
            "topics": []
          }
        ]
      },
      {
        "link": "rfgXKJPMCos",
        "views": 3215,
        "likes": 66,
        "duration": 3306,
        "publishedAt": "2018-07-02T16:35:48+00:00",
        "description": "When you look at the JavaScript world these days you can get disheartened. On the one side there is an overwhelming offer of things you should know but are \"considered harmful\" by the time you have a chance to look at them. On the other side you have fire and brimstone talks about how relying on JavaScript makes you a terrible person. Let Chris set your mind at ease. Things aren't that grim or complicated.",
        "tags": [
          {
            "id": "cjhg0901y12770162f0lf32t4",
            "name": "Javascript"
          }
        ],
        "speaker": [
          {
            "id": "cji0diee3494v0105y5yzh8f4",
            "name": "Chris Heilmann",
            "bio": "The robots are coming and we need to make a great example for them. Program Manager for Open Web and Browsers at Microsoft. Presenter, JavaScript lover.",
            "topics": [
              {
                "id": "cjhq937uq1jel0127hlu81unf",
                "topic": "JavaScript",
                "stage": "PUBLISHED"
              }
            ]
          }
        ]
      },
      {
        "link": "v0TFmdO4ZP0",
        "views": 149492,
        "likes": 2407,
        "duration": 1354,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "I am not an expert developer. I am also not a beginning developer.\n\nI'm an intermediate developer, and I want to navigate the path from being a mediocre or good developer, to becoming a great or expert level developer.\n\nHow in the heck do I do this?\n\nThe tutorial ecosystem of the web is heavily skewed towards beginners, but what about the rest of us?\n\nIf you identify with these statements in the slightest, then this talk is for you. With ideas from cognitive science, education, and some advice from admired programmers along the way, we are going to explore what it means to be a world-class developer and what we need to do to get there. I'll talk a little bit about the philosophy, attitude, and habits (both good and bad) required for learning how to learn better, and then we will talk about the kinds of skills and knowledge that an expert programmer in general needs. Along the way we'll touch about various myths and cognitive biases about who can and cannot be a great programmer, and leave you with a path to get started. By the end of the talk, I will have proposed a curriculum of topics that should take an intermediate developer and turn them into an advanced one, and special attention will be given to mastery of the JavaScript language.",
        "tags": [
          {
            "id": "cjhg0901y12770162f0lf32t4",
            "name": "Javascript"
          }
        ],
        "speaker": [
          {
            "id": "cjhg1b3z01ckh0162p8xfzw1l",
            "name": "Angelina Fabbro",
            "bio": "award-winning programmer & cogsci weirdo ✬ software, hardware, music ✬ 🏳️‍🌈 currently making music software as the dayjob thing",
            "topics": []
          }
        ]
      },
      {
        "link": "WEn4Izv0DW8",
        "views": 1622,
        "likes": 48,
        "duration": 2649,
        "publishedAt": "2018-07-05T15:46:48+00:00",
        "description": "Knitting and computing may seem completely unconnected, but they're very similar. Every beginning knitter learns that there are only two stitches - knit and purl. So knitting is inherently binary, and that opens up a world of possibilities for a coder.\n\nKnitted fabric can be used to encode data in a number of ways, from QR code mittens to a fluffy red virus scarf. Patterns themselves become algorithms, and new syntax proposals allow for automated testing, compilers, and even visualisers. Crafters and programmers are working together in the burgeoning Maker scene to hack hardware, create innovative e-textiles, and push the computational limits of sticks and string.\n\nIn this Software Art Thou talk, developer and knitting enthusiast Kris Howard shows how knitting can make you a better coder.",
        "tags": [
          {
            "id": "cjhg0cw2i12tq0152dwxweli5",
            "name": "Computer Science"
          }
        ],
        "speaker": [
          {
            "id": "cjj8q3kyl0fh60146zaaowh9v",
            "name": "Kris Howard ",
            "bio": "Amazonian @awscloud, geek, speaker, crafter, social media addict, and all-around Hermione | prev @yow_conf @canva | 🇦🇺🇺🇸 She/her | Opinions are my own!",
            "topics": []
          }
        ]
      },
      {
        "link": "xqT8e6_yzLg",
        "views": 639,
        "likes": 22,
        "duration": 1940,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "When we work alone, it’s easy to make sure things come out the way we think is best. But what happens when we need to get an entire team to agree on — and actually _use_ — best practices? What if we have to convince an entire _company_?\n\nIn this talk, we’ll learn how IBM is working to get huge, distributed teams to not only agree on a set of best practices but to actually follow them, leading to:\n\n* Improved developer experience and engagement\n* Increased velocity\n* Decreased technical debt\n* Higher reliability\n* Broad adoption of best practices\nand many more improvements in team cohesion and quality\nLearn battle-tested strategies and techniques that will benefit companies of any size, helping create teams that are more engaged, more effective, and more cohesive.",
        "tags": [
          {
            "id": "cjhkkhlem21rf0191k3a2g6jb",
            "name": "Management"
          }
        ],
        "speaker": [
          {
            "id": "cji4d1f8c2kmi01969twnkdyz",
            "name": "Jason Lengstorf",
            "bio": "💻 Lead developer / software architect. 📢 Frequent speaker. 🎨 Occasional designer. 🍸 Mediocre bartender. DevRel @gatsbyjs // Previously @IBM, @insidePN",
            "topics": []
          }
        ]
      },
      {
        "link": "0xbf5zjuE70",
        "views": 427,
        "likes": 20,
        "duration": 1970,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "Functional programming means cleaner code, easier maintenance, and simpler testing, but most of us will never use it because it’s explained in such a complex, mathematical, and confusing way. This talk explains how we can get the benefits of functional programming today — no math required.",
        "tags": [
          {
            "id": "cjhg0901y12770162f0lf32t4",
            "name": "Javascript"
          },
          {
            "id": "cjhqht9jl1qhw0157r3cg6f1z",
            "name": "Functional Programming"
          }
        ],
        "speaker": [
          {
            "id": "cji4d1f8c2kmi01969twnkdyz",
            "name": "Jason Lengstorf",
            "bio": "💻 Lead developer / software architect. 📢 Frequent speaker. 🎨 Occasional designer. 🍸 Mediocre bartender. DevRel @gatsbyjs // Previously @IBM, @insidePN",
            "topics": []
          }
        ]
      },
      {
        "link": "HktWin_LPf4",
        "views": 27814,
        "likes": null,
        "duration": 1781,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "WebAssembly is fast. It’s being called “the future of the web”. It’s speed and potential have major browser vendors working together to make it a reality. And it’s on it’s way—the MVP hit multiple browsers in October of last year.\n\nBut what makes it fast? Starting from the basics, this talk will walk you through what WebAssembly is, and then why it’s fast.",
        "tags": [
          {
            "id": "cjhl68vnh0ilh0100b5zr4njq",
            "name": "WebAssembly"
          }
        ],
        "speaker": [
          {
            "id": "cjhf33bqk1jvp0157579kupc3",
            "name": "Lin Clark",
            "bio": "stuffing my head with code and turning it into @codecartoons. also, tinkering with WebAssembly, @rustlang and a little JavaScript at @mozilla",
            "topics": []
          }
        ]
      },
      {
        "link": "YrtANPtnhyg",
        "views": 4004424,
        "likes": 29013,
        "duration": 920,
        "publishedAt": "2018-07-05T15:39:19+00:00",
        "description": "At TEDIndia, Pranav Mistry demos several tools that help the physical world interact with the world of data -- including a deep look at his SixthSense device and a new, paradigm-shifting paper \"laptop.\" In an onstage Q&A, Mistry says he'll open-source the software behind SixthSense, to open its possibilities to all.",
        "tags": [
          {
            "id": "cjhg0cw2i12tq0152dwxweli5",
            "name": "Computer Science"
          },
          {
            "id": "cjhg0aa14127j0186n3g5jscc",
            "name": "Inspirational"
          }
        ],
        "speaker": [
          {
            "id": "cjj8puied0dox0130b7vw8k7j",
            "name": "Pranav Mistry",
            "bio": "Pranav Mistry is a computer scientist and inventor. He is the Global Senior Vice President of Research at Samsung and the head of Think Tank Team. He is best known for his work on SixthSense, Samsung Galaxy Gear and Project Beyond.",
            "topics": []
          }
        ]
      },
      {
        "link": "M3BM9TB-8yA",
        "views": 138553,
        "likes": null,
        "duration": 1602,
        "publishedAt": "2018-07-02T16:35:48+00:00",
        "description": "",
        "tags": [
          {
            "id": "cjhg094m612nx0185d3gnbqdk",
            "name": "NodeJS"
          }
        ],
        "speaker": [
          {
            "id": "cjhg8xd6k14fm0192r9qa91gz",
            "name": "Ryan Dahl",
            "bio": "Ryan Dahl is a software engineer and inventor of Node.js",
            "topics": []
          }
        ]
      },
      {
        "link": "2EckNbSGass",
        "views": 77,
        "likes": 5,
        "duration": 1007,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "As a UX designer, you are constantly between the fires of the users, the project managers, the developers and other stakeholders. In this talk, Roxanne explains how she dealt with resistance anyone can encounter during a project, and what she especially learned from dealing with these different kinds of heats.",
        "tags": [
          {
            "id": "cjhg0bs8813nc0151ukoy8q12",
            "name": "UX"
          }
        ],
        "speaker": [
          {
            "id": "cji4bz8e124rh0196vbfv6b1l",
            "name": "Roxanne GroenenBerg",
            "bio": "Roxanne GroenenBerg is an enthusiastic and driven UX Consultant at Backelite, the Service Design Agency part of the Capgemini Group. As a consultant, she had worked for various clients, mostly at the client site, on various projects varying from redesigning business processes to optimizing the User Experience of various mediums.",
            "topics": [
              {
                "id": "cjhq9zwxq1vix0115s0ych36s",
                "topic": "UX",
                "stage": "PUBLISHED"
              }
            ]
          }
        ]
      },
      {
        "link": "O7pnOru0S3E",
        "views": 389,
        "likes": 4,
        "duration": 3181,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "We can all agree that JavaScript is a trending programming language. But is this a good thing? Is JavaScript the right language to learn or to study? Can we push the language into the academic field so that students are better prepared for the jobs of the future in IT? \n\nI want to make a case here, that JavaScript forces you to go one step further in understanding what you are doing, compared with other mainstream languages that have their abstractions already built into the language. We will look at a few common patterns to establish some context and we will discuss about the dangers of abstractions and the source of the JavaScript Fatigue™.",
        "tags": [
          {
            "id": "cjhg0aa14127j0186n3g5jscc",
            "name": "Inspirational"
          },
          {
            "id": "cjhg0901y12770162f0lf32t4",
            "name": "Javascript"
          }
        ],
        "speaker": [
          {
            "id": "cji4c41cx289e0190mtvxbxf7",
            "name": "Alex Moldovan",
            "bio": "Building software and communities JavaScript Engineering Manager @FortechRomania. Founder of @jsheroes. I never wear matching socks 🧦",
            "topics": [
              {
                "id": "cjhq9ak3v1lcw0162ml7n0rmz",
                "topic": "Web Performance",
                "stage": "PUBLISHED"
              },
              {
                "id": "cjhq93bxy1ibq01208pxi4tba",
                "topic": "React",
                "stage": "PUBLISHED"
              }
            ]
          }
        ]
      },
      {
        "link": "0yKf8TrLUOw",
        "views": 11837,
        "likes": 189,
        "duration": 2596,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "This talk is about the world's most popular programming language...Java? Python? COBOL?\nNo... Excel!\n\nExcel somehow hits the sweet spot between being powerful enough to run entire domains like finance and insurance, but also easy enough to attract a huge audience. Why is that?\n\nIn this talk we'll explore some of the mechanisms that make spreadsheets so powerful, while implementing a few interesting mathematical problems in spreadsheets.\n\nWhile doing that, you might learn some (functional) programming concepts too, as we'll talk about sorting, dynamic programming and lambdas.",
        "tags": [
          {
            "id": "cjhqht9jl1qhw0157r3cg6f1z",
            "name": "Functional Programming"
          }
        ],
        "speaker": [
          {
            "id": "cji7q37ee2aja0128yzeu6ing",
            "name": "Felienne Hermans",
            "bio": "Programming and Education and Programming Education @tudelft Podcaster @seradio Organizer @joyofcoding",
            "topics": [
              {
                "id": "cjhq9gla61p090100eh1bwzrm",
                "topic": "Functional Programming",
                "stage": "PUBLISHED"
              }
            ]
          }
        ]
      },
      {
        "link": "lpvgfmEU2Ck",
        "views": 1456026,
        "likes": 5082,
        "duration": 265,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": " ",
        "tags": [
          {
            "id": "cjhg0e2ns13wl0101195y0r2o",
            "name": "Funny"
          }
        ],
        "speaker": [
          {
            "id": "cji7ph8zg244j0117jzxtok65",
            "name": "Don McMillan",
            "bio": "Don McMillan graduated from Stanford University with a Master’s Degree in Electrical Engineering. (He has a BSEE from Lehigh University) He went to work for AT&T Bell Laboratories where he worked as part of the team that designed the world’s first 32-bit Microprocessor. He then moved to the Silicon Valley where he worked at VLSI Technology as a computer chip designer. During his 6 years at VLSI he designed more than 20 Standard and ASIC Designs many of which are still out there today.",
            "topics": []
          }
        ]
      },
      {
        "link": "ediHVy0869c",
        "views": 426,
        "likes": 18,
        "duration": 2399,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "We are not blessed with infinite resources, so when we make things for the web we have to decide what gets done and what doesn't. But what we choose to prioritize isn't always what deserves to be a priority. This talk explores the spurious thinking, the privileges and the prejudices, behind our faulty prioritizations and defends inclusive design as the ultimate priority when building interfaces.",
        "tags": [
          {
            "id": "cjhg0aa14127j0186n3g5jscc",
            "name": "Inspirational"
          },
          {
            "id": "cjhg0qv5417gi0162qms6qvl0",
            "name": "Accessibility"
          }
        ],
        "speaker": [
          {
            "id": "cji2phngc2xz801712vxo094z",
            "name": "Heydon Pickering",
            "bio": "Inclusive designer, writer, speaker. Helping good ideas become more accessible.",
            "topics": [
              {
                "id": "cjhq9iop01q380100z1k8xi0f",
                "topic": "Accessibility",
                "stage": "PUBLISHED"
              }
            ]
          }
        ]
      },
      {
        "link": "mxzK4sWfvH8",
        "views": 42773,
        "likes": 1645,
        "duration": 2496,
        "publishedAt": "2018-07-05T14:59:31+00:00",
        "description": "Humans only have limited mental capacity and no-one is ever operating at 100%. We are all influenced by the world around us and by how our minds work. As designers we need to be able to understand this and design for it.",
        "tags": [
          {
            "id": "cjhg0bs8813nc0151ukoy8q12",
            "name": "UX"
          }
        ],
        "speaker": [
          {
            "id": "cjj8ofqdh01rd0144gy2kk65v",
            "name": "Joe Leech",
            "bio": "User Experience (UX) and Product Management Consultant, Speaker and author of Psychology for Designers. In China they call me 红豆 乔.",
            "topics": []
          }
        ]
      },
      {
        "link": "PJjHfa5yxlU",
        "views": 21929,
        "likes": 433,
        "duration": 2295,
        "publishedAt": "2018-07-02T16:35:48+00:00",
        "description": "Most code is a mess. Most new requirements change existing code. Ergo, much our work involves altering imperfect code.\n\nThat's the bad news.\n\nThe good news is that every big mess consists of many small ones. Certain small problems occur so frequently that they've been given names, and are collectively known as \"Code Smells\".\n\nThis talk shows how to take a pile of perplexing code, identify the \"smells\", and surgically apply the curative refactorings. It breaks a messy problem into clear-cut pieces, and proves that you can fix anything without being forced to understand everything.",
        "tags": [
          {
            "id": "cjhg8vg73139s01166jgjmg25",
            "name": "Ruby"
          }
        ],
        "speaker": [
          {
            "id": "cjhg8vkfa142e0144zifzc37k",
            "name": "Sandi Metz",
            "bio": "Cyclist, Rubyist, author (http://99bottlesofoop.com  and http://poodr.com ), obsessive programmer, recalcitrant blogger and the antidote for ambition.",
            "topics": []
          }
        ]
      },
      {
        "link": "v-2yFMzxqwU",
        "views": 30219,
        "likes": 368,
        "duration": 2832,
        "publishedAt": "2018-07-02T16:35:46+00:00",
        "description": "A great walk through the SOLID Principles behind OO Design",
        "tags": [
          {
            "id": "cjhny4bad2nqe01944npfpzit",
            "name": "Software Architecture"
          },
          {
            "id": "cjihg27yx1hg801036be1htne",
            "name": "Object-Oriented Programming"
          }
        ],
        "speaker": [
          {
            "id": "cjhg8vkfa142e0144zifzc37k",
            "name": "Sandi Metz",
            "bio": "Cyclist, Rubyist, author (http://99bottlesofoop.com  and http://poodr.com ), obsessive programmer, recalcitrant blogger and the antidote for ambition.",
            "topics": []
          }
        ]
      },
      {
        "link": "VscdPA6sUkc",
        "views": 423463,
        "likes": 8395,
        "duration": 4663,
        "publishedAt": "2018-07-02T16:35:47+00:00",
        "description": "Diablo developer David Brevik returns to the GDC stage to give a classic post-mortem on Blizzard's action RPG hit Diablo in this 2016 talk. Brevik shares key takeaways from the experience and sheds light on how the game went from a single-player, turn-based claymation DOS game to the genre-defining classic it became.",
        "tags": [
          {
            "id": "cjhua67me1lrd0192ceo1ecdm",
            "name": "Video Games"
          }
        ],
        "speaker": [
          {
            "id": "cjimuzdas12dd0138pryf9mgo",
            "name": "David Brevik",
            "bio": "Computer & gaming fanatic. Creator of Diablo. Indie Game Developer making It Lurks Below. Love sports, scotch, board games, music, coffee and father of 4 girls",
            "topics": []
          }
        ]
      },

      {
        "link": "cZeWjYVNWfU",
        "views": 115,
        "likes": 1,
        "duration": 1745,
        "publishedAt": "2018-08-02T17:23:49+00:00",
        "description": "When I first heard about the Web Bluetooth API I was so curious, that I could not wait to try it out. So I asked myself: Which Bluetooth device should I buy? Especially if I do not want to through it away after I was finished experimenting with the API. So obviously a Bluetooth enabled vibrator was a perfect fit. And it came with a serious use case, too: The slogan of the vibrator was \"Let him control you\", which I found very limiting, so I used the Web Bluetooth API to connect it to the browser, and the Web Audio API, to establish my own slogan: \"Let a video control you\". In my talk you will learn how to use the Web Bluetooth API to connect a Bluetooth enabled device to the browser. Also you will see what is possible with the Web Audio API, especially when it comes to analyzing spoken words.",
        "tags": [
          {
            "id": "cjhkg07z409tr018561qf5ehb",
            "name": "IOT"
          }
        ],
        "speaker": [
          {
            "id": "cjkctan2x0p9z0148y3uo3tia",
            "name": "Michaela Lehr",
            "bio": "Executive Partner @GeilDanke, UX designer, frontend developer, contributes to @podlove_org, loves Buffy, knitting, WebXR, yoga Ⓥ",
            "topics": []
          }
        ]
      },
      {
        "link": "Zemce4Y1Y-A",
        "views": 9094,
        "likes": 98,
        "duration": 2405,
        "publishedAt": "2018-07-05T14:56:00+00:00",
        "description": "React has always been about the Virtual DOM. A nice way to render HTML (and some of SVG and maybe some Web Components). Although there's also react-art, react-three, react-canvas, react-curses... Oh, and react-native! Even if you bottom out at HTML, most of what React does really well is rendering to OTHER React components. Meanwhile most projects still try to retrofit our needs into HTML and CSS primitives. I'll talk about why the DOM is flawed and how it is becoming a second-class citizen in the land of React apps.",
        "tags": [
          {
            "id": "cjhg0axyh13460195gookni3c",
            "name": "React"
          }
        ],
        "speaker": [
          {
            "id": "cjj8oa24l52nz0138ddc95vas",
            "name": "Sebastian Markbåge",
            "bio": "React JS · TC39 · The Facebook · Tweets are personal",
            "topics": []
          }
        ]
      },
      {
        "link": "RhdlBHHimeM",
        "views": 55,
        "likes": 2550,
        "duration": 4078,
        "publishedAt": "2018-07-27T10:27:48+00:00",
        "description": "The idea is spreading that perhaps software development is simply incompatible with engineering; that software developers are not, and never will be, real engineers. Glenn Vanderburg, VP of Engineering at First, takes a fresh look at what that really should mean for this field. With an extra 45 years of experience about the task of programming, and a broad survey of the varied different engineering disciplines, can we envision a future for a field of “software engineering” that is worthy of the name?",
        "tags": [
          {
            "id": "cjhg0cw2i12tq0152dwxweli5",
            "name": "Computer Science"
          }
        ],
        "speaker": [
          {
            "id": "cjk3ue1065yw5016178l7zx7a",
            "name": "Glenn Vanderburg",
            "bio": "VP of Engineering at @FirstHQ. Formerly @LivingSocial, @infoether, @thinkrelevance.",
            "topics": []
          }
        ]
      },
      {
        "link": "p2F-128e3sI",
        "views": 8276,
        "likes": 76,
        "duration": 3028,
        "publishedAt": "2018-08-02T17:24:38+00:00",
        "description": "",
        "tags": [
          {
            "id": "cjhg0901y12770162f0lf32t4",
            "name": "Javascript"
          },
          {
            "id": "cjhua6gta1lwc0192ou9d4htm",
            "name": "Optimization"
          }
        ],
        "speaker": [
          {
            "id": "cjk3ukc8j64ks0161jhqebstz",
            "name": "Guillermo Rauch",
            "bio": "@zeithq",
            "topics": []
          }
        ]
      },
      {
        "link": "d0pOgY8__JM",
        "views": 12564,
        "likes": 221,
        "duration": 1980,
        "publishedAt": "2018-08-02T17:24:23+00:00",
        "description": "JavaScript that writes JavaScript: Christoph will give an intro to jscodeshift and the underlying tools like recast and ast-types that help rewrite and modernize a lot of Facebook’s JavaScript code day-to-day. We’ll explore why these tools become increasingly important and how they change how we think about open source and breaking API changes at Facebook. At the end of the talk everyone will be able to run their own code transformations across all of their projects safely and efficiently.",
        "tags": [],
        "speaker": [
          {
            "id": "cjkct4gib0gaz01480hwgzihz",
            "name": "Christoph Nakazawa",
            "bio": "Formerly Pojer · 👨🏻‍💻 Engineering Manager at Facebook · 🚇 Metro · 🃏 Jest · 📦 Yarn",
            "topics": []
          }
        ]
      },
      {
        "link": "SXjA1aIM35E",
        "views": 0,
        "likes": 0,
        "duration": 2603,
        "publishedAt": "2018-08-03T13:57:46+00:00",
        "description": "Working on open source has changed my life. I am self-employed and work on open source full-time. I don't have a boss. I only work on projects that I enjoy working on, and I can work whenever and wherever I want. I also let people use all the code I write for free. This is all made possible thanks to the amazing support from the community made up of the users of my open source projects.\n\nI think I'm incredibly lucky to be in this position today. Yet there are still many open source maintainers struggling on the verge of burnout while their software is being used by millions. So in this talk I will share with you my journey of open source - in particular how I made it my full-time job - in the hope of shedding some insights on open source sustainability.",
        "tags": [
          {
            "id": "cjke200ro3jsc0142maqtdf4f",
            "name": "Open Source"
          },
          {
            "id": "cjhg0aa14127j0186n3g5jscc",
            "name": "Inspirational"
          }
        ],
        "speaker": [
          {
            "id": "cji622t0v3etz0134xicwv0to",
            "name": "Evan You",
            "bio": "Design, code & things in between. Full-time open source. Creator @vuejs, previously @meteorjs & @google, @parsonsamt alumnus",
            "topics": []
          }
        ]
      },
      {
        "link": "R-GzJgEccEQ",
        "views": 9322,
        "likes": 204,
        "duration": 2018,
        "publishedAt": "2018-08-22T15:31:51+00:00",
        "description": "What if instead of building your own mental model of how data flows through your application, you could actually see the data flowing in real-time? In this talk we will explore functional and reactive streams as a building block in JavaScript applications, with tools like RxJS, Cycle.js, xstream, which enable DevTools from the future.",
        "tags": [
          {
            "id": "cjhg0901y12770162f0lf32t4",
            "name": "Javascript"
          }
        ],
        "speaker": [
          {
            "id": "cjhg8jn7q10ag0156icszobcv",
            "name": "André Staltz",
            "bio": "Open source hacker building a phone-to-phone social network with http://www.scuttlebutt.nz . Creator of @cyclejs and #RxJS teacher.",
            "topics": []
          }
        ]
      },
      {
        "link": "maykR0aVsj8",
        "views": 9107,
        "likes": 160,
        "duration": 1471,
        "publishedAt": "2018-08-22T15:21:50+00:00",
        "description": "",
        "tags": [
          {
            "id": "cjhg0bcw9138q01016huz9ayo",
            "name": "Story"
          }
        ],
        "speaker": [
          {
            "id": "cjl5adf561a3p0157j7y8uig1",
            "name": "Preethi Kasireddy",
            "bio": "Blockchain engineer. Founder & CEO of @isTruStory. Previously @Coinbase, @a16z, @GoldmanSachs. I live and breathe crypto. Studied Systems Engineering @USC",
            "topics": []
          }
        ]
      },
      {
        "link": "EkluES9Rvak",
        "views": 167165,
        "likes": 2400,
        "duration": 2899,
        "publishedAt": "2018-08-22T15:24:17+00:00",
        "description": "Quick, what does this do: /(\\/\\*?\\\\/)|\\/\\/.*?(\\r?\\n|$)/g? If you're like many developers, you just averted your eyes, and your heart is now in your throat. Symptoms included sweaty palms and recurring nightmares with blood-thirsty ASCII symbols. But don't worry, this condition doesn't have to be chronic. A cure is right around the corner.\n\nAs with many developers, you're familiar with the power of regular expressions, but anything beyond the basics scares the crap out of you. Fear no more young padawan! In this talk, we'll start with the basics and progressively enhance your knowledge until you're coding regular expressions like a champ. Everything will be demonstrated live with visual examples that ensure maximum comprehension.",
        "tags": [
          {
            "id": "cjhg0cw2i12tq0152dwxweli5",
            "name": "Computer Science"
          }
        ],
        "speaker": [
          {
            "id": "cjhg8m33u10ya0177p21rbta5",
            "name": "Lea Verou",
            "bio": "HCI researcher @MIT_CSAIL, @CSSWG IE, @CSSSecretsBook author, Ex @W3C staff. Made @mavoweb @prismjs @dabblet. I ♥ standards, code, design, UX, life!",
            "topics": []
          }
        ]
      },
      {
        "link": "zjjvIaYMd0o",
        "views": 655,
        "likes": 9,
        "duration": 3408,
        "publishedAt": "2018-09-29T15:23:28+00:00",
        "description": "No matter if we’re software developers, designers, product owners, managers, or work on software in any other way: our work has impact. But how is this impact constituted? What does it look like in practice? And which consequences does this have for our work on software today?\n\nThis talk by Lena Reinhard takes you on a journey from the early days of computing, to debugging, to the technology industry, to our roles in all of this. It shows why we need to care about the social and ethical implications of our work, and highlights ways for us to approach these topics – by ourselves, and together with the people we work with. This talk wants to encourage you to think about your own role, your power, and your responsibilities as a person working on technology. You’ll learn what you can do to live up to them – and how you can help debug the tech industry.",
        "tags": [
          {
            "id": "cjhg1m06y1fdk01015q4q7wi8",
            "name": "Society"
          },
          {
            "id": "cjhg0cw2i12tq0152dwxweli5",
            "name": "Computer Science"
          }
        ],
        "speaker": [
          {
            "id": "cjhg1sfkg1h1i0101i7sivfjh",
            "name": "Lena Reinhard",
            "bio": "Former VP Eng taking a break. Speaker, Writer, Photographer, Feminist, former & future CEO. she/her. “Canniest person in the whole world.”",
            "topics": []
          }
        ]
      },
      {
        "link": "f4xUaRKCW-s",
        "views": 128,
        "likes": 4,
        "duration": 1243,
        "publishedAt": "2018-09-29T15:03:20+00:00",
        "description": "Most of us won’t realise we’re burning out until we reach crisis point. Jessica Rose came to Monki Gras to warn us that pushing ourselves to the point of burnout can actually make us less effective. She also explains how we can recognise some of the signs of burnout and recommends a range of self-care strategies.",
        "tags": [
          {
            "id": "cjhg1b8nh1cls0152eqs0reeb",
            "name": "Personal"
          },
          {
            "id": "cjhg0bcw9138q01016huz9ayo",
            "name": "Story"
          }
        ],
        "speaker": []
      },
      {
        "link": "Up7LcbGZFuo",
        "views": 13567,
        "likes": 315,
        "duration": 3099,
        "publishedAt": "2018-09-29T15:21:34+00:00",
        "description": "Statically typed functional programming languages encourage a very different way of thinking about types. The type system is your friend, not an annoyance, and can be used in many ways that might not be familiar to OO programmers.\nTypes can be used to represent the domain in a fine-grained, self documenting way. And in many cases, types can even be used to encode business rules so that you literally cannot create incorrect code. You can then use the static type checking almost as an instant unit test — making sure that your code is correct at compile time.\n\nIn this talk, we'll look at some of the ways you can use types as part of a domain driven design process, with some simple real world examples in F#. No jargon, no maths, and no prior F# experience necessary.",
        "tags": [
          {
            "id": "cjhqht9jl1qhw0157r3cg6f1z",
            "name": "Functional Programming"
          }
        ],
        "speaker": [
          {
            "id": "cjmnl3j0a0jm70195vv7kh4em",
            "name": "Scott Wlaschin",
            "bio": "I believe that solutions emerge from the judicious study of discernible reality.",
            "topics": []
          }
        ]
      },
      {
        "link": "8O5zOSEemUM",
        "views": 2025,
        "likes": 61,
        "duration": 1657,
        "publishedAt": "2018-09-29T15:14:41+00:00",
        "description": "",
        "tags": [
          {
            "id": "cjhg0nxwf164l0101czd5huq2",
            "name": "React Native"
          }
        ],
        "speaker": []
      },
      {
        "link": "5V9p3vV6fSk",
        "views": 198,
        "likes": 26,
        "duration": 2554,
        "publishedAt": "2018-09-29T15:17:59+00:00",
        "description": "In this talk we’ll bridge the gap from Java to Kotlin. You’ll learn what function types are available, where to best use each type, how they reduce boilerplate and transform how you build your apps, and finally how you can take advantage of all these great Kotlin functions from your Java code as well.",
        "tags": [
          {
            "id": "cjmnkyxi20j8c0195mexxcozs",
            "name": "Kotlin"
          }
        ],
        "speaker": []
      },
      {
        "link": "mVcMAtaAwsA",
        "views": 2545,
        "likes": 108,
        "duration": 1853,
        "publishedAt": "2018-09-29T15:26:14+00:00",
        "description": "Over the last three years, I’ve spoken to hundreds of React Native developers, and slowly a picture emerges. It’s a picture of excitement and frustration, obsession with technology and pushing the boundaries. It’s a picture of you. This talk will blend meticulous research, subjective personal experiences and speculative fiction to discover the core of that elusive Developer Experience, and ask the inconvenient questions you’ve always been afraid to ask.",
        "tags": [
          {
            "id": "cjhg0nxwf164l0101czd5huq2",
            "name": "React Native"
          },
          {
            "id": "cjhg1b8nh1cls0152eqs0reeb",
            "name": "Personal"
          }
        ],
        "speaker": [
          {
            "id": "cjhot9q2d1db80181oo7lavzj",
            "name": "Jani Evakallio",
            "bio": "@FormidableLabs UK showrunner, React engineer, comedian, speaker, writer, improviser. Twitter Developer Expert™.",
            "topics": []
          }
        ]
      },
      {
        "link": "6NU_ucpHm8M",
        "views": 557,
        "likes": 3,
        "duration": 3710,
        "publishedAt": "2018-10-23T16:38:49+00:00",
        "description": "Sensemaking tools help you deal with uncertainty and complexity in a practical and day-to-day environment. In this experiential Software Art Thou presentation, author and mentor Lynne Cazaly will take you through practical skills for sensemaking and build your capability in visual thinking, facilitation, and helping people connect the dots through a short practical session. Leverage these skills to be one of those people that help get shit done!",
        "tags": [
          {
            "id": "cjhg0aa14127j0186n3g5jscc",
            "name": "Inspirational"
          }
        ],
        "speaker": [
          {
            "id": "cjnlye6ml0x6z0139cbldyi3x",
            "name": "Lynne Cazaly",
            "bio": "Conference Speaker, Master Facilitator & Author including the books Agile-ish, Leader as Facilitator, Making Sense, & Visual Mojo. #avgeek",
            "topics": []
          }
        ]
      },
      {
        "link": "rJTzA6ohHQA",
        "views": 0,
        "likes": 0,
        "duration": 0,
        "publishedAt": "2019-01-19T23:32:07+00:00",
        "description": "",
        "tags": [],
        "speaker": [
          {
            "id": "cjr43squd0ldg013884i9ue8q",
            "name": "Andy Mockler",
            "bio": "👨🏻‍💻 writing bad code @ @shopify",
            "topics": []
          }
        ]
      },
      {
        "link": "gsT2BBWBVmM",
        "views": 374,
        "likes": 6,
        "duration": 1812,
        "publishedAt": "2019-01-20T20:25:08+00:00",
        "description": "",
        "tags": [
          {
            "id": "cjhg0qgyv17140185a9g96djj",
            "name": "Documentation"
          }
        ],
        "speaker": []
      },
      {
        "link": "_HCmFvxxKaQ",
        "views": 1130,
        "likes": 14,
        "duration": 1680,
        "publishedAt": "2019-01-19T23:46:34+00:00",
        "description": "",
        "tags": [
          {
            "id": "cjhg0qgyv17140185a9g96djj",
            "name": "Documentation"
          }
        ],
        "speaker": [
          {
            "id": "cjr44f5by0pns0182nc3lyjae",
            "name": "Kat King",
            "bio": "She/her/hers. Making music, writing code, flopping around, seeking joy. Bad at twitter. Working on the Docs @twilio.",
            "topics": []
          }
        ]
      },
      {
        "link": "p0PPtdRHG6M",
        "views": 357,
        "likes": 2,
        "duration": 1740,
        "publishedAt": "2019-01-19T23:54:02+00:00",
        "description": "Nearly everyone agrees that good documentation is important to the success of software projects, and yet very few projects actually have good documentation. Even successful projects often have barely adequate documentation.\n\nOften, it’s not for want of effort - the project’s developers have worked hard on it - nor for lack of documentation - the authors have produced a lot of it.\n\nIt simply turns out to be not very good - not helpful enough for the users who should be able to rely on it, and a depressing chore for the authors who have to maintain it.",
        "tags": [
          {
            "id": "cjhg0qgyv17140185a9g96djj",
            "name": "Documentation"
          }
        ],
        "speaker": [
          {
            "id": "cjr44pqgn0qx40142p5qjlh3t",
            "name": "Daniele Procida",
            "bio": "Community manager at Divio AG (@divio), purveyors of the finest Python/Django deployment tools in the world.",
            "topics": []
          }
        ]
      },
      {
        "link": "JuI6NUbEzDw",
        "views": 70,
        "likes": 3,
        "duration": 1572,
        "publishedAt": "2019-01-19T23:50:36+00:00",
        "description": "Writers of software and writers of documentation practice a shared art: we bestow abstractions with names. We know weve succeeded when our names illuminate concepts, elicit a-ha moments, and empower users to put our product to work. We know we've failed when the names we've chosen confuse, frustrate, misguide, or offend.\n\nNaming things well matters. Too often, though, good names are hard to come by, and bad names are hard to change.",
        "tags": [
          {
            "id": "cjhg0qgyv17140185a9g96djj",
            "name": "Documentation"
          }
        ],
        "speaker": [
          {
            "id": "cjr44ld2j0s7t0169t9ix19b3",
            "name": "Ruthie BenDor",
            "bio": "Web worker. Cyclist. Californian.",
            "topics": []
          }
        ]
      },
      {
        "link": "_TmhQI6X4JA",
        "views": 0,
        "likes": 0,
        "duration": 2596,
        "publishedAt": "2019-01-19T23:40:31+00:00",
        "description": "In this talk from Fluent Conference 2017, I give a tour of the web animations ecosystem, comparing animation approaches in detail and exploring the principles that transcend them all.\n\nTo do this, I use lessons learned from building and maintaining Bouncy Ball, a project that compares web animation approaches.\n\nLinks:\nThe Bouncy Ball Project: http://sparkbox.github.io/bouncy-ball/\nGithub Repo: https://github.com/sparkbox/bouncy-ball",
        "tags": [
          {
            "id": "cjhg07w6912d10185umgied60",
            "name": "CSS"
          }
        ],
        "speaker": [
          {
            "id": "cjr4488dy0p0y01712xq8160v",
            "name": "Bryan Braun",
            "bio": "Web designer/developer. Creator of http://gridmaster.io , AnchorJS, Bouncy Ball, and more. BYU grad, now in Ohio, making ✨ at @hearsparkbox.  🚴‍♂️ ＞ 🚗",
            "topics": []
          }
        ]
      }
 
 
      ]
    }
  }